{
    "version": "https://jsonfeed.org/version/1",
    "title": "Iterating",
    "description": "",
    "home_page_url": "https://iterating.com",
    "feed_url": "https://iterating.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "AL8X"
    },
    "items": [
        {
            "id": "https://iterating.com/how-to-keep-score/",
            "url": "https://iterating.com/how-to-keep-score/",
            "title": "How to Keep Score",
            "summary": "How do you measure how well you're doing in your life?&hellip;",
            "content_html": "<p>How do you measure how well you're doing in your life?</p>\n<p>Money? Cars? Homes? Careers? Accolades and awards?</p>\n<p>Championships?</p>\n<p>Exits?</p>\n<p>Moonshots?</p>\n<p>Followers?</p>\n<p>PRs?</p>\n<p>Net worth?</p>\n<p>I think these are all fine and dandy, but really, I think these are all wrong.</p>\n<p>I think things like: Do the people I love, love me back?</p>\n<p>Am I happy and content?</p>\n<p>Do the people I love believe I love them?</p>\n<p>Warren Buffett (of all people -- you'll soon see why I note this) once said something along the lines of \"Would you rather be known as the world's greatest lover but in fact be the world's worst? Or would you rather be known as the world's worst lover but in fact be the world's best?\"</p>\n<p>The idea being only you can define how well you're doing in life. If you rely on the opinion of others, you will often find that path lacking. I know I did.</p>\n<p>Too many people sell their sacred character for more reputation.</p>\n<p>Soul for money.</p>\n<p>Determining our own truth and sticking to our own first principles is a huge and hard win. To be worthy. Believe we are and have enough. To seek more not for external praise but internal reward. Because you resonate when you chase what is congruent with your innerkeeper.</p>\n<p>Too many people want to go viral. </p>\n<p>Just be the cure.</p>\n<p> </p>\n<p> </p>\n<p> </p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-10-30T00:43:11-04:00",
            "date_modified": "2025-10-30T00:43:11-04:00"
        },
        {
            "id": "https://iterating.com/revenge-of-the-nerds/",
            "url": "https://iterating.com/revenge-of-the-nerds/",
            "title": "Revenge of the Nerds",
            "summary": "Life is oversimplification. Here is another example. People who excel early&hellip;",
            "content_html": "<p>Life is oversimplification.</p>\n<p>Here is another example.</p>\n<p>People who excel early in life in athletics use their bodies to fund their lives. Often sacrificing their health in their later years to do so.</p>\n<p>People who excel early in life in business use their brains to fund their lives. Often sacrificing their health in their early years to do so.</p>\n<p>But what I realized about nerds (especially those who do really well for themselves), they start becoming health nuts.</p>\n<p>Instead of peaking physically at an early age, they peak later. Much later.</p>\n<p>Making up for lost time.</p>\n<p>It results in this strange thing of seeing old legends in terrible shape and old nerds looking jacked.</p>\n<p>I use these terms affectionately.</p>\n<p>Who am I to say which way is best?</p>\n<p>I skipped class in law school to go lift.</p>\n<p>Look how great I turned out.</p>\n<p>You know where the weight room is?</p>\n<p>I'll check it out.</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-10-29T11:50:24-04:00",
            "date_modified": "2025-10-29T12:04:48-04:00"
        },
        {
            "id": "https://iterating.com/pros-and-cons/",
            "url": "https://iterating.com/pros-and-cons/",
            "title": "Prose and Cons",
            "summary": "You know that the \"con\" in conmen is short for confidence?&hellip;",
            "content_html": "<p>You know that the \"con\" in conmen is short for confidence?</p>\n<p>Confidence is a heck of thing. Faith in someone or something.</p>\n<p>I saw the recent video of Michael Jordan nervously (Michael Jordan!) shooting a free throw.</p>\n<p>He sank it with ease. Goats will be goats. But Michael Jordan, man. Nervous making a free throw in somebody's backyard.</p>\n<p>Ain't that something?</p>\n<p>Confidence is not the absence of nerves; being nervous is kind of like being excited, right?</p>\n<p>Who doesn't like being excited?</p>\n<p>Think about that the next time you're nervous.</p>\n<p>And sink it with ease.</p>\n<p> </p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-10-28T14:34:25-04:00",
            "date_modified": "2025-10-28T14:46:33-04:00"
        },
        {
            "id": "https://iterating.com/pen-over-sword/",
            "url": "https://iterating.com/pen-over-sword/",
            "title": "Quill Over Sword",
            "summary": "When I sit down to write here, I usually do so&hellip;",
            "content_html": "<p>When I sit down to write here, I usually do so spontaneously.</p>\n<p>You can probably tell because sometimes I wait to get to the point because I have no point when I start writing.</p>\n<p>Like right now, I have no point to make here, so I'm stalling by writing more words.</p>\n<p>Is it working?</p>\n<p>Is a point being made here?</p>\n<p>I don't know.</p>\n<p>This is my finest work yet.</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-10-27T13:31:30-04:00",
            "date_modified": "2025-10-27T13:32:13-04:00"
        },
        {
            "id": "https://iterating.com/both-can-be-true/",
            "url": "https://iterating.com/both-can-be-true/",
            "title": "Both Can Be True",
            "summary": "Almost forgot to write today. I mean, I did forget. But&hellip;",
            "content_html": "<p>Almost forgot to write today. I mean, I did forget.</p>\n<p>But no time like the present.</p>\n<p>My goal is to write at least once a day. And while no one's really paying attention, I'm paying attention. That means something, at least to me. Maybe someone in the future, too.</p>\n<p>If you ever have the good fortune to love someone, my goodness, what a thing it is.</p>\n<p>And the thing about love is it makes you stronger and weaker at the same time. </p>\n<p>Love gives you strength beyond measure, but it can also leave you so vulnerable in many ways.</p>\n<p>Heartbreaks are audible, visceral, and as true as any compound fracture. And I'm not just talking romantic ones.</p>\n<p>Love is having the utmost affection and concern. Strength and weakness.</p>\n<p>I don't know why I write about love today -- who knows why I write about anything.</p>\n<p>I am so loved in this life. For that, I am too lucky (I know it). For them, I love forever (they know it).</p>\n<p>I've been hearing a lot of people giving up on love, which just seems a foolish waste of an infinite resource.</p>\n<p>Love is reserved for those made of flesh and bone. I won't speak for celestial bodies, just all of humanity and all Earth life, if that's alright. Oh, and those things that are alive but do not have flesh or bones can probably love, too. You know what I meant.</p>\n<p>But will ai ever know love? It'll parrot anything you train it to. Some living things are that way.</p>\n<p>Humans can fall in love with anything.</p>\n<p>Strength and weakness.</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-10-26T23:22:39-04:00",
            "date_modified": "2025-10-26T23:55:46-04:00"
        },
        {
            "id": "https://iterating.com/new-dog-old-tricks/",
            "url": "https://iterating.com/new-dog-old-tricks/",
            "title": "New Dog, Old Tricks",
            "summary": "There's a part of me that grew up with this idea&hellip;",
            "content_html": "<p>There's a part of me that grew up with this idea of fair fights.</p>\n<p>Generally speaking, it was one versus one, no outside interference, and you played by a set of rules. No hitting the spinal column, eye balls, balls balls.</p>\n<p>You know, fair fights.</p>\n<p>But to those who are not yet fully formed, or those who are and were given a size, age, or health disadvantage (relative to their opponent(s)), there is no such thing as a fair fight.</p>\n<p>Every fight is unfair. Already in favor of the other side.</p>\n<p>We can do things like train and learn techniques and what not.</p>\n<p>But big can usually beat little.</p>\n<p>Usually.</p>\n<p>One of the ways it sometimes doesn't is by changing it into a fair fight.</p>\n<p>Kicking groins. Gouging eyes. Elbowing spines.</p>\n<p>Pocket sand!</p>\n<p>You know, fighting \"dirty\"? But to me, that's not fighting dirty. That's fighting fair.</p>\n<p>Real life ain't the UFC or boxing.</p>\n<p>I suppose there is the law. But that's the only rules. </p>\n<p>If someone is trying to kill you, you should be prepared to fight to the death.</p>\n<p>And should you ever find yourself unarmed and in a fight, remember that the easiest ways to win are:</p>\n<p>1) Explosive, angry, force. I mean animal mean. The will to fight and do so violently is incredibly underrated. Who wants to contend with a pissed-off yellow jacket?; and/or</p>\n<p>2) Tire them out. Most people aren't trained to fight for any length of time. If you can handle their initial wind, there usually isn't enough time for them to get their second. Fatigue and cowards, you know. This is the downside of Point 1.</p>\n<p>Oh, and this probably wouldn't work as well to those with extensive training.</p>\n<p>But yeah, like most fights, the best way to win is just to avoid them.</p>\n<p>Woof.</p>\n<p>DISCLAIMER: I am a man of peace. Do not fight, people. Follow the law. And absolutely, positively, defend yourself and your loved ones.</p>\n<p>There is no honor in violent encounters, but there is in you.</p>\n<p>Good, Dog.</p>\n<p> </p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-10-25T18:22:11-04:00",
            "date_modified": "2025-10-25T19:05:42-04:00"
        },
        {
            "id": "https://iterating.com/fall/",
            "url": "https://iterating.com/fall/",
            "title": "Fall",
            "summary": "What a wonderful time of year. Color changes. Perky cool winds.",
            "content_html": "<p>What a wonderful time of year.</p>\n<p>Color changes. Perky cool winds. Favorite hoodies.</p>\n<p>Falls seem shorter now. </p>\n<p>There's always nostalgia in my blood during these months.</p>\n<p>I'm blessed with the ability to focus on my best memories. Like how we only listen to our favorite band's best songs and forget their worst.</p>\n<p>Skip. Skip. Aww sookie.</p>\n<p>And fall is a wonderful season to reminisce. </p>\n<p>Winter is unforgiving, but autumn is more of a listener.</p>\n<p>May all your falls be short ones.</p>\n<p>To autumn and everything after.</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-10-24T22:42:01-04:00",
            "date_modified": "2025-10-24T22:59:41-04:00"
        },
        {
            "id": "https://iterating.com/bodies-of-water/",
            "url": "https://iterating.com/bodies-of-water/",
            "title": "Bodies of Water",
            "summary": "I'm a peninsula guy, I see that now. NYC (yeah yeah,&hellip;",
            "content_html": "<p>I'm a peninsula guy, I see that now.</p>\n<p>NYC (yeah yeah, it's an island, work with me here I'm making a point). Great Lakes. The Bay. Korea.</p>\n<p>I like and have always liked being by the water.</p>\n<p>I like being close to water because it soothes my fire. It cools it down. Let's me relax. But I'm careful to never let it put it out.</p>\n<p>My whole life, bodies of water have called to me. And yet, I don't really get in. It's the city boy in me. I like to sit by it. Feel that cool breeze. Watch my loved ones revel and frolic in it. </p>\n<p>It is my opposite, water is. And as such, I respect it so. And while I draw near it, I always keep it a bit away.</p>\n<p>This is why the peninsula is my way. It juts out into the water, even surrounds itself in it, but it is always rooted into the mainland. Sticks its head and neck out, but maintains a firm foundation. A solid plan, as plans go.</p>\n<p>I remember the first time I saw the Pacific Ocean.</p>\n<p>It's ferocity humbled me; I stood in awe of it. How it smashed and swept what it wanted to, paying no mind to the little dot of H2O and fire watching it.</p>\n<p>I'm more of a lake guy, now.</p>\n<p>If you think it's because I'm getting older, you're probably right. And because the fire's not as bright. This makes my life easier. Easier and better. </p>\n<p>Oceans, lakes, humans. My favorite bodies of water (not necessarily in that order).</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-10-23T16:08:25-04:00",
            "date_modified": "2025-10-23T16:21:44-04:00"
        },
        {
            "id": "https://iterating.com/go-out-there-and-sling-it/",
            "url": "https://iterating.com/go-out-there-and-sling-it/",
            "title": "Go Out There and Sling It",
            "summary": "Ever heard of Tom Brady, Jr.? Owns a piece of the&hellip;",
            "content_html": "<p>Ever heard of Tom Brady, Jr.?</p>\n<p>Owns a piece of the Raiders and some baseball card stores? </p>\n<p>Well, before all that glitz and glamour, the kid played football.</p>\n<p>But it didn't start all sunshines and rainbows.</p>\n<p>First, he had to get drafted.</p>\n<p>So draft day came, and he sat with his parents at home and waited.</p>\n<p>And waited.</p>\n<p>And waited.</p>\n<p>It got so bad he had to go take a walk, his parents by his side, as they tried to soothe and console their pride and joy.</p>\n<p>Ever proud, though not so joyful. Because their son was at his lowest.</p>\n<p>And then the call came. Pick 199! Half-dozen QBs taken before him.</p>\n<p>And his father's reaction?</p>\n<p>\"We were <strong><em>jubilant</em></strong>.\"</p>\n<p>Maybe things would have turned out better for Tom if he'd have been drafted higher.</p>\n<p>I mean, minority owner? C'mon. Card shops? Who would pay for cardboard?</p>\n<p>What sticks with me here is I've always admired his parents.</p>\n<p>In a day and age, now and then, where many would be heartbroken or outraged, his parents were jubilant.</p>\n<p>What a magical word.</p>\n<p>Jubilant.</p>\n<p>I want you to use that word today to describe something you feel.</p>\n<p>And I want you to mean it.</p>\n<p>To Tom Brady, Sr.</p>\n<p>My hero.</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-10-22T14:31:50-04:00",
            "date_modified": "2025-10-22T14:57:09-04:00"
        },
        {
            "id": "https://iterating.com/more-human-than-human/",
            "url": "https://iterating.com/more-human-than-human/",
            "title": "More Human Than Human",
            "summary": "Have you heard about this new fangled thing called Artificial Intelligence?&hellip;",
            "content_html": "<p>Have you heard about this new fangled thing called Artificial Intelligence?</p>\n<p>No?</p>\n<p>It's all the rage with kids and old people. I fit somewhere in the middle. It might just catch on.</p>\n<p>And I have to admit, it's got a lot of utility.</p>\n<p>Just this past week, I had it rediscover (for me) a Korean singer in the 80s/90s. I was K-Poppin' before K-Poppin' was cool.</p>\n<p>Anyway, AI is like a personal assistant who you task with an assignment that would normally take hours, days, or weeks and instead it completes it almost instantly. Sure, it's wrong more than we like, but that comes with everything.</p>\n<p>Perfection eludes even (and especially) code.</p>\n<p>Oh, and the price is right. One of the perks of this race towards AGI is that companies are losing huge amounts just to gain users like us. Of course, we are helping train it, feeding and fattening it up. But nothing in the world is free (except our souls).</p>\n<p>It seems like more than ever, the program is starting to sound real.</p>\n<p>And if it can do most of our tasks, what is left for humans?</p>\n<p>Are we all supplied a universal basic income and left to pursue our dreams?</p>\n<p>Can you buy a fleet of robots that work for you? You buy a robot that companies hire, paying you their salary?</p>\n<p>You see where I'm headed?</p>\n<p>It seems naive to not believe our future is somewhat dystopian.</p>\n<p>Some might say it is already here.</p>\n<p>But I think there's always a lot of value in contemplating what it means to be a human being right now and in this near future.</p>\n<p>I don't know. All this is from a rusty brain, writing with rusty muscles. Rambles. Iterations. But I don't hallucinate.</p>\n<p>We are now able to upload a person's image, writings, voice recordings and recreate them. Add in tangible robots or VR headsets, and you can almost have everyone you have ever wanted in your life, in your life.</p>\n<p>Sure, it wouldn't be them, but you wouldn't be able to tell the difference.</p>\n<p>Or would you?</p>\n<p>And if you could, would you even care?</p>\n<p>I had this idea once about contact lenses you put on that would put you in another world. You would put them on and suddenly be in another timeline. And the idea being, if that world was better than this one, would you ever take the contacts off?</p>\n<p>If dreams were for sale, which ones would you buy?</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-10-21T14:51:35-04:00",
            "date_modified": "2025-10-21T15:08:19-04:00"
        }
    ]
}
