{
    "version": "https://jsonfeed.org/version/1",
    "title": "Iterating",
    "description": "",
    "home_page_url": "https://iterating.com",
    "feed_url": "https://iterating.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "杻백"
    },
    "items": [
        {
            "id": "https://iterating.com/slingshots-slingshots-slingshots/",
            "url": "https://iterating.com/slingshots-slingshots-slingshots/",
            "title": "Slingshots Slingshots Slingshots",
            "summary": "One of the reasons I like to try new things is&hellip;",
            "content_html": "<p>One of the reasons I like to try new things is because after a while, things can start sounding like an echo chamber.</p>\n<p>You hear the same things over and over.</p>\n<p>Groups agreeing with one another on everything and everyone.</p>\n<p>And any ideas to the contrary are disregarded at best.</p>\n<p>For me, even, I could agree with you vehemently on something, but if you keep pounding the idea home, I start to see the contrary views.</p>\n<p>Your certainty makes me doubt.</p>\n<p>So I stay away from fanatics.</p>\n<p>On all sides.</p>\n<p>Or, perhaps better said, keep them at a distance.</p>\n<p>Some of my favorite ideas are led by people who basically say:</p>\n<p>If you don't get it, you're just a moron.</p>\n<p>Which, you should know by now, I understand.</p>\n<p>Maybe it's the smugness.</p>\n<p>Maybe that's why my brain goes, \"Well, maybe there is another view here.\"</p>\n<p>I always liked a well-written dissent over the more popular majority opinion.</p>\n<blockquote>\n<p>\"How are you liking the company?\"</p>\n<p>\"Well, this company feels like a Goliath. And I have always been a David guy.\"</p>\n</blockquote>\n<p>And maybe that's it.</p>\n<p>Maybe if a room feels like it's full of drooling, nodding giants, I instinctively grab my rounds.</p>\n<p>Has the art of cordial disagreement faded away?</p>\n<p>Agree to disagree?</p>\n<p>Do professors still give out their best grades to students who disagree with their point of view, but do so so articulately and well-reasoned that it deserves the top grade?</p>\n<p>My concern is it seems the world is flocking more and more into these silos of safety.</p>\n<p>Where everyone in this silo has to think a certain way.</p>\n<p>They all say the same things, believe the same things, and if you do not, well then, please see yourself out.</p>\n<p>I am proud to say I have very few people I would call true friends. And believe it or not, some of them disagree with me. I know, I know, impossible, you say.</p>\n<p>But it's true. They have their own ideas. Their own guidelines. And when I need to hear another side to an angle I am considering, I go there first.</p>\n<p>Break this argument.</p>\n<p>Shatter it.</p>\n<p>What am I missing?</p>\n<p>Don't echo.</p>\n<p>Counter.</p>\n<p>Left jab?</p>\n<p>Right straight.</p>\n<p>Left headkick?</p>\n<p>Right legkick.</p>\n<p>Get out of them chambers that have endless mirrors.</p>",
            "author": {
                "name": "杻백"
            },
            "tags": [
            ],
            "date_published": "2025-12-29T14:25:20-05:00",
            "date_modified": "2025-12-29T14:25:20-05:00"
        },
        {
            "id": "https://iterating.com/fetch/",
            "url": "https://iterating.com/fetch/",
            "title": "Fetch",
            "summary": "One of the things I have always tried to distill is&hellip;",
            "content_html": "<p>One of the things I have always tried to distill is this idea of success.</p>\n<p>What is it?</p>\n<p>How do you measure it?</p>\n<p>How will you know when you are \"successful?\"</p>\n<p>I mean, does a bell chime or does some little guy dressed as an elf dance at your side when it happens?</p>\n<p>I think too many of us measure success by net worth.</p>\n<p>And I suppose that's one way to do it.</p>\n<p>I grew up with a terrible sense of money.</p>\n<p>Didn't have much, didn't need much.</p>\n<p>Maybe that's not so terrible.</p>\n<p>But what I'm getting at is can you be a great family man <em>and</em> succeed in business?</p>\n<p>Who's done that?</p>\n<p>And who gets to measure whether you are successful or not?</p>\n<p>You, your portfolio, or your family?</p>\n<p>And what about your soul, your fortitude, your honor?</p>\n<p>Does that matter in the \"success\" formula?</p>\n<p>I mean, ain't that the most important stick?</p>\n<p>What I'm getting at is:</p>\n<p>Did you have a good year?</p>\n<p>And no matter your answer, how are you defining it?</p>",
            "author": {
                "name": "杻백"
            },
            "tags": [
            ],
            "date_published": "2025-12-28T12:52:35-05:00",
            "date_modified": "2025-12-28T12:52:35-05:00"
        },
        {
            "id": "https://iterating.com/everyday-we-shuffling/",
            "url": "https://iterating.com/everyday-we-shuffling/",
            "title": "Everyday We Shuffling",
            "summary": "Again, I sit down to write without an idea about what&hellip;",
            "content_html": "<p>Again, I sit down to write without an idea about what to say.</p>\n<p>I mean, I got a lot of ideas, but I am holding back on most things.</p>\n<p>Some things do not belong on a blog.</p>\n<p>But here I am.</p>\n<p>So let's get to writing.</p>\n<p>First of all, the word \"blog\" is terrible.</p>\n<p>It stinks.</p>\n<p>It's like the word, \"brand.\"</p>\n<p>Yuck.</p>\n<p>But yeah, I do both.</p>\n<p>I suppose.</p>\n<p>In my own anti-way.</p>\n<p>Do it by not doing it right.</p>\n<p>Or [waves hands] doing it different.</p>\n<p>I'm yelling at people who cut in lines again.</p>\n<p>I suppose that's something.</p>\n<p>\"Line starts back here, boys!\"</p>\n<p>That is kind of funny to me.</p>\n<p>And then no-selling the \"Oh, sorry\" response.</p>\n<p>Like I've moved on entirely.</p>\n<p>Which I have.</p>\n<p><em>Who is apologizing to me? And for what?</em></p>\n<p>Next!</p>",
            "author": {
                "name": "杻백"
            },
            "tags": [
            ],
            "date_published": "2025-12-27T13:34:45-05:00",
            "date_modified": "2025-12-27T13:35:55-05:00"
        },
        {
            "id": "https://iterating.com/get-to/",
            "url": "https://iterating.com/get-to/",
            "title": "Get To",
            "summary": "I sit alone in a four cornered room staring at candles.",
            "content_html": "<blockquote>\n<p>I sit alone in a four cornered room staring at candles.</p>\n</blockquote>\n<p>Oh, is this thing on?</p>\n<p>Listen, I hope you had yourself a Merry little Christmas.</p>\n<p>And now, you find yourself getting ready to celebrate the end of the old year and to welcome the new.</p>\n<p>I should wax on and wax off about ends and beginnings.</p>\n<p>But that seems a little too cliche.</p>\n<p>Why on earth would I do that?</p>\n<p>Everyone does that.</p>\n<p>And if you know a little something about me, I don't do what everyone does.</p>\n<p>So here's what I will say.</p>\n<p>Most of them out there are going to be lazy these last few days.</p>\n<p>So there's opportunity in being especially active now.</p>\n<p>While the others are celebrating, it is a great time to put in the work.</p>\n<p>Sure, it's only a couple of days, but maybe you strike gold, while everyone else is drinking it.</p>\n<blockquote>\n<p>Just remember, they can buy anything. But they can't buy backbone. Don't let them forget that.</p>\n</blockquote>\n<p>And I know, I know, this is for like one person out of the millions (thousands, hundreds, dozens, handful) who read this nonsense.</p>\n<p>But yes, this is for <em>you</em>, friend.</p>\n<p>My words have never been for the crowd.</p>\n<p>Just for the ones who can keep their heads.</p>\n<p>I see you, back row, left side. On your feet. Clapping. Hollering. Underlining.</p>\n<p>This is for you.</p>",
            "author": {
                "name": "杻백"
            },
            "tags": [
            ],
            "date_published": "2025-12-26T13:20:40-05:00",
            "date_modified": "2025-12-26T13:26:16-05:00"
        },
        {
            "id": "https://iterating.com/ho-ho-hoes/",
            "url": "https://iterating.com/ho-ho-hoes/",
            "title": "Ho Ho Hoes",
            "summary": "Merry Christmas. That was going to be it. But let's keep&hellip;",
            "content_html": "<p>Merry Christmas.</p>\n<p>That was going to be it.</p>\n<p>But let's keep it going.</p>\n<p>To those hurting in these times, I want to send a special message.</p>\n<p>And to those in a great place, I also want to share the same message.</p>\n<p><em>This, too, shall pass.</em></p>\n<p>To those low, just <em>survive</em>.</p>\n<p>And to those high, just <em>bless</em>.</p>\n<p>Or maybe it's the reverse.</p>\n<p>I forget.</p>",
            "author": {
                "name": "杻백"
            },
            "tags": [
            ],
            "date_published": "2025-12-25T15:28:43-05:00",
            "date_modified": "2025-12-25T15:43:48-05:00"
        },
        {
            "id": "https://iterating.com/sacralize/",
            "url": "https://iterating.com/sacralize/",
            "title": "Sacralize",
            "summary": "Years ago, I remember Joe Rogan sharing a story on his&hellip;",
            "content_html": "<p>Years ago, I remember Joe Rogan sharing a story on his show.</p>\n<p>This was way back before he became <em>the</em> dude in podcasting.</p>\n<p>I don't listen to many podcasts anymore, but back then he would just go on and on about whatever the heck with his co-host.</p>\n<p>And this one day, he's on a roll.</p>\n<p>Talking about how we take so much for granted.</p>\n<p>And he set it up this way.</p>\n<p>Which is how I think I can best define what I mean by \"sacralize\" aka my new favorite word.</p>\n<p>He said, imagine living underground for your entire life. You only know caves and tunnels and passages and nothing else. Everyone lives this way.</p>\n<p>And one day, you hear about this ultimate attraction.</p>\n<p>It's at the end of a tunnel that leads up. Impossibly up.</p>\n<p>And if you have enough money, you can pay to go there.</p>\n<p>And the few people who have gone rave about it forever.</p>\n<p>They just can't believe it's there.</p>\n<p>So you save up, wait for your window (because it's only open during certain hours), and you go.</p>\n<p>You pay the enormous admission fee and see for yourself.</p>\n<p>And you climb up this ladder for seemingly forever in this narrow tunnel which leads to a little room with a hole in the ceiling.</p>\n<p>And through the opening you can see it.</p>\n<p>The above world.</p>\n<p>The outside world.</p>\n<p>The night's sky.</p>\n<p>And more importantly, the unlimited (give or take) amount of stars in the sky.</p>\n<p>And you sit and stare in awe.</p>\n<p>Forever changed.</p>\n<p>You'll spend the rest of your life underground talking about what you saw.</p>\n<p>Most will never believe you.</p>\n<p>And I suppose that's what I mean by sacralizing.</p>\n<p>We don't sacralize the night's starry skies because it is just so routine for us.</p>\n<p>But if we lived underground, and had to pay to see the stars, we would sacralize it.</p>\n<p>Because it deserves it.</p>\n<p>And I remember Rogan telling this story and just thinking how right he was.</p>\n<p>How we would make it a holy pilgrimage to see the night's lights.</p>\n<p>If it just wasn't available almost every single night of our lives.</p>\n<p>And that's the trick of sacralization.</p>\n<p>You make it sacred even though, and especially because, it is so routine.</p>\n<p>Yes, it is just what happens on a clear evening.</p>\n<p>Stars just show themselves.</p>\n<p>But it is also something sacred.</p>\n<p>Both can be true.</p>\n<p>Both are true.</p>\n<p>And so, 'tis the season to remember such things.</p>\n<p>How beautiful things are that you see everyday.</p>\n<p>It doesn't make them less important, I argue it does the exact opposite.</p>\n<p>The beautiful and important things you see everyday are more beautiful and more important because you see them everyday.</p>\n<p>Not less.</p>\n<p>I've learned the best things in life are free.</p>\n<p>But you have to earn them to keep them.</p>\n<p>Understand?</p>\n<p>So next time, maybe every time from here on out, you look up and see a million stars, you experience it as if you had to spend your life's savings earned living underground to see it.</p>\n<p>And the realization that hey, <em>hey</em>, this is just given to me.</p>\n<p>And do that, do that same thing, when you look down, and from side to side while you're at it.</p>\n<p>And I think, <em>I think</em>, that's the secret recipe to all of this.</p>",
            "author": {
                "name": "杻백"
            },
            "tags": [
            ],
            "date_published": "2025-12-24T00:02:00-05:00",
            "date_modified": "2025-12-24T00:02:00-05:00"
        },
        {
            "id": "https://iterating.com/diamonds-or-coals/",
            "url": "https://iterating.com/diamonds-or-coals/",
            "title": "Diamonds or Coals",
            "summary": "Now's not the time to be writing on this thing. It's&hellip;",
            "content_html": "<p>Now's not the time to be writing on this thing.</p>\n<p>It's a time to celebrate.</p>\n<p>To dance and sway a little.</p>\n<p>To find a mistletoe.</p>\n<p>To help Santa be Santa. Shhhh.</p>\n<p>To believe in magic.</p>\n<p>Have you been good?</p>\n<p>What you get?</p>\n<p>I'm notoriously hard to buy a gift for. Not because of any real reason. I just don't want many things people can buy me.</p>\n<p>The gifts I want I already have. So if people ask what I want, it would be gifts for my gifts. So that's what people do. Buy gifts for them.</p>\n<p>I don't say this piously. I enjoy watching their joy. It's wonderful.</p>\n<p>Much better than if I got a new shirt or gift card.</p>\n<p>I do like metal pens, though. Just saying.</p>\n<p>Merry almost Christmas.</p>",
            "author": {
                "name": "杻백"
            },
            "tags": [
            ],
            "date_published": "2025-12-23T12:19:03-05:00",
            "date_modified": "2025-12-23T12:29:08-05:00"
        },
        {
            "id": "https://iterating.com/snowflake-opposite/",
            "url": "https://iterating.com/snowflake-opposite/",
            "title": "Snowflake Opposite",
            "summary": "Welp, it's about that time to put a bow on 2025.",
            "content_html": "<p>Welp, it's about that time to put a bow on 2025.</p>\n<p>It's not here yet, 2026 I mean, but you can see it from here.</p>\n<p>Depending on your field, either a lot gets done this week or nothing does.</p>\n<p>I think for most it's nothing.</p>\n<p>Some might be scrambling for end of year deadlines, hosting family and friends, or last minute gifts (or gift cards), but that's about it.</p>\n<p>It's a chill time, literally for some. Figuratively for most.</p>\n<p>This year has been something. One for the record books.</p>\n<p>Like him or not, the US President has stuffed a decade of events into one year.</p>\n<p>But buckle up, buttercup.</p>\n<p>I think we're looking at another 30 years in the next handful.</p>\n<p>This might not make much sense right now, but it will.</p>\n<p>...</p>\n<p>There are two easy ways to waste time:</p>\n<p>One is to spend it on useless things. Worthless things. Under the Pareto principles, this works out to about 80% of your time spent on a whole bunch of nothing. Or at least, proportionately nothing.</p>\n<p>The other is to try to hold onto it too badly. Trying to capture it and put it into your pocket. You try to get it just right and end up missing the whole darn thing because you were too focused on holding onto it. Because you wanted to savor it.</p>\n<p>So I'm looking forward to 2026.</p>\n<p>I can't believe I'm almost there.</p>\n<p>It's a special year as far as years go, for me.</p>\n<p>But I ain't counting chickens (or crows), yet.</p>\n<p>I am enjoying this last week or so of 2025.</p>\n<p>Putting my chair back, reclining, and just taking it all in.</p>\n<p>My cup runneth over of Coke Zero.</p>\n<p>Ahhhh.</p>\n<p>Carbonation.</p>\n<p>What a life.</p>\n<p>What a run.</p>\n<p>What a world.</p>\n<p>Thank You for letting me play.</p>",
            "author": {
                "name": "杻백"
            },
            "tags": [
            ],
            "date_published": "2025-12-22T13:04:08-05:00",
            "date_modified": "2025-12-22T13:23:34-05:00"
        },
        {
            "id": "https://iterating.com/what-happens-if-i-press-this-button/",
            "url": "https://iterating.com/what-happens-if-i-press-this-button/",
            "title": "What Happens If I Press This Button?",
            "summary": "As an autodidactic amateur coder, I draw parallels and contrasts to&hellip;",
            "content_html": "<p>As an autodidactic amateur coder, I draw parallels and contrasts to things I know to the things I want to know.</p>\n<p>And it's clear that when you build something, sometimes things break.</p>\n<p>You make big updates, but something along the line was ignored, accidentally erased, or just downright incompatible, making the whole thing not work.</p>\n<p>It happens so frequently that after every change my goal is to try and break it, use it until I find a point of failure (which I usually can).</p>\n<p>So there's this delicate balance.</p>\n<p>Of making improvements but keeping it running optimally.</p>\n<p>Of adding new features but not over clunking the experience.</p>\n<p>Of changing things but not crashing it all down.</p>\n<p>This is where that word, iterating, becomes so key.</p>\n<p>You tinker. You add. You see if it still works. See if you like the changes. Then tinker again.</p>\n<p>In theory, there's a time when you stop tinkering, when you move on to another project or priority. But it's nice to think you can come back, revisit, at any time. This is what's different about code. You can always go back.</p>\n<p>Change the past.</p>\n<p>You can even make backups. You should make backups.</p>\n<p>I suppose you can do this in real life, but not in a time machine sense.</p>\n<p>So here's hoping all your updates are upgrades.</p>\n<p>And that you never break.</p>\n<p>We both know that's not going to happen forever.</p>\n<p>But that's part of the fun.</p>",
            "author": {
                "name": "杻백"
            },
            "tags": [
            ],
            "date_published": "2025-12-21T12:57:36-05:00",
            "date_modified": "2025-12-21T13:02:18-05:00"
        },
        {
            "id": "https://iterating.com/all-dawgs/",
            "url": "https://iterating.com/all-dawgs/",
            "title": "All Dawgs",
            "summary": "What's on the other side of the edge of the universe?&hellip;",
            "content_html": "<p>What's on the other side of the edge of the universe?</p>\n<p>I mean, it can't go on forever can it?</p>\n<p>What's on the other side?</p>\n<p>One step over the edge.</p>\n<p>Nothing?</p>\n<p>Everything?</p>\n<p>Another universe?</p>\n<p>Is it like a video game, where you can see there's something beyond it, but you cannot go in, because the game won't let you?</p>\n<p>They didn't code for that.</p>\n<p>Is it just pure darkness, or nothingness, or void?</p>\n<p>Or is it something cooler, more majestic, more awesome, than we can imagine?</p>\n<p>All things being equal, I always wonder why people choose to believe in there being nothing there.</p>\n<p>I mean, if you have the choice, and I think you do, why not choose to believe there's something incredible on the other side of infinity?</p>\n<p>Why not have faith that there's something larger than all of us combined, than all of this combined, and that that thing is actually rooting for us, believing in us, loving us, when we sometimes aren't worth doing so?</p>\n<p>That's the part that hurts me (such as I can hurt), it's the what happened to you to make you stop (or never start) believing?</p>\n<p>It reminds me of a story.</p>\n<p>About a pair of twins.</p>\n<p>Who grew up in a terrible home.</p>\n<p>Hurt by their world, their parents, by everyone.</p>\n<p>And one grew up just like they were raised. While the other grew up to be a loving person and live a good life.</p>\n<p>And when you asked them, after all these years, why they did what they did, they answered the same way:</p>\n<blockquote>\n<p>How was I supposed to turn out with the way I was raised?</p>\n</blockquote>\n<p>I'm probably getting it all wrong, but I hope you get the idea.</p>\n<p>One learns how to be from their upbringing, another learns how <em>not</em> to be.</p>\n<p>A playbook versus a cautionary tale.</p>\n<p>And believe me, I've seen many things that should have turned my faith, I get it.</p>\n<p>But I feel like not having faith is also somehow not having faith in yourself.</p>\n<p>Somehow, it feels like not believing is like saying, \"I don't believe in myself, anymore.\"</p>\n<p>Do you get me?</p>\n<p>And so, if I were the sort to pour out a little liquor, I'd do so right now.</p>\n<p>On the curb.</p>\n<p>For those who never had faith, or lost it along their way.</p>\n<p>And I hope you join me in pouring one out, rather than be the one we pour for.</p>\n<p>Because I think believing there's something on the other side of forever is just so much easier, it makes so much more sense, than believing there's nothing.</p>\n<p>I just do.</p>\n<p>And after everything I've gone through, everything I have won and lost, everything I have done and not done, how could I believe in anything else?</p>",
            "author": {
                "name": "杻백"
            },
            "tags": [
            ],
            "date_published": "2025-12-20T11:48:44-05:00",
            "date_modified": "2025-12-20T12:01:13-05:00"
        }
    ]
}
