{
    "version": "https://jsonfeed.org/version/1",
    "title": "Iterating",
    "description": "",
    "home_page_url": "https://iterating.com",
    "feed_url": "https://iterating.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "AL8X"
    },
    "items": [
        {
            "id": "https://iterating.com/got-a-sec/",
            "url": "https://iterating.com/got-a-sec/",
            "title": "Got A Sec?",
            "summary": "You ever talk to someone, and they are coming to you&hellip;",
            "content_html": "<p>You ever talk to someone, and they are coming to you for advice, and you realize, pretty quickly, that they are only there to hear your affirmation?</p>\n<p>Meaning, if you disagree, and give honest feedback, they are put off?</p>\n<p><em>No, no, no. You don't see. You aren't agreeing with me. [Face twitches]. Not six minute abs! Seven!</em></p>\n<p>So the feedback becomes a fight.</p>\n<p>I have an easy solution for that.</p>\n<p>But a slightly harder solution is to realize that a lot of folks (when they say they want feedback and your \"honest\" opinion) are just really saying, \"You agree with me, right?\"</p>\n<p>Right?</p>\n<p>Of course, they have evolved. And some now exist solely to anger you.</p>\n<p>They expect disagreement.</p>\n<p>Hoping you care enough to disagree.</p>\n<p>And they love it.</p>\n<p>In fact, one of the most effective ways to gather a following is to anger people.</p>\n<p>They want you to disagree. </p>\n<p>Because engagement, wrestling the pig, gets the hog paid.</p>\n<p>So now, not only do we have jabronis looking only for agreement, we got other jabronis looking for a scrap, if only behind a \"smart\" phone.</p>\n<p>So, contrary to popular opinion, I just choose not to engage.</p>\n<p>I choose not to run!</p>\n<p>Did you know that if your social media feeds are full of ragebait, it's because they know you love it?</p>\n<p>While you sit there angry, stewing, scrolling to more anger, you are being absolutely fed what you respond to.</p>\n<p>Now, if it's going the other way, the Kumbaya way, well you're probably only getting the affirmation you have been secretly seeking (like when you talk to ai).</p>\n<p>You want my advice?</p>\n<p>I have the answer.</p>\n<p>And it's just so simple a solution, it's elegant.</p>\n<p>[Phone rings]</p>\n<p>[Phone displays \"Suspected Spam\"]</p>\n<p>I gotta take this.</p>\n<p>\"What? The prince of where? Prince Whozit? Well, I always got time for royalty!\"</p>\n<p>[Points to phone, mouths to you, \"Prince Whozit!\"]</p>\n<p>[The author beams].</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-12-16T13:05:35-05:00",
            "date_modified": "2025-12-16T13:18:10-05:00"
        },
        {
            "id": "https://iterating.com/true-wuv/",
            "url": "https://iterating.com/true-wuv/",
            "title": "True Wuv",
            "summary": "I don't know what to say today. Somedays it be that&hellip;",
            "content_html": "<p>I don't know what to say today.</p>\n<p>Somedays it be that way.</p>\n<p>I will say I love <em>The Princess Bride</em>, aka <em>The Revenge Tale of Inigo Montoya</em>.</p>\n<p>Seems like a good day to say that.</p>\n<p>In a movie full of quotable lines, the ones I like to say the most (even, especially, today) are those morsels of art cooked up by Andre the Giant.</p>\n<blockquote>\n<p>Why are you wearing a mask? Were you burned by acid or something like that?</p>\n</blockquote>\n<p>Maybe it's because I grew up watching the old MSG network in NYC, and every month they'd air a World Wrestling Federation house show live from Madison Square Garden.</p>\n<p>And, if I was lucky, it'd get to see Andre.</p>\n<blockquote>\n<p>My way is not very sportsmanlike.</p>\n</blockquote>\n<p>Seeing the Giant as a nice guy (for a Brute Squad member) was a nice surprise for a kid watching him beat up Hulk Hogan.</p>\n<p>I didn't appreciate this movie as a love story as a kid. I was fixated on Inigo enacting his vengeance. Having fun storming the castle. To me, it was all about the action.</p>\n<p>But it is.</p>\n<p>It is a love story.</p>\n<p>And, as we say in our home, every story is a love story.</p>\n<p>You could call this one a story about true love.</p>\n<p>You could call it a story of a son's love for his father.</p>\n<p>You could call it a story about a grandfather's love for his grandson.</p>\n<p>And you'd be right.</p>\n<p>The way this movie ends is not, as we see, how the real deal goes sometimes.</p>\n<p>But I'm going to keep this one light.</p>\n<p>Out of respect for the fallen and those that remain.</p>\n<p>In memory of the gentle sportsman, the awfully misunderstood Vizzini (the character, not the actor!), and the guy that directed them.</p>\n<p><em>Memento</em> <em>vivere</em>, friends.</p>\n<p> </p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-12-15T12:29:44-05:00",
            "date_modified": "2025-12-15T13:05:44-05:00"
        },
        {
            "id": "https://iterating.com/sidearming-steaks/",
            "url": "https://iterating.com/sidearming-steaks/",
            "title": "Sidearming Steaks",
            "summary": "I got this theory. About pro football. I call it \"The&hellip;",
            "content_html": "<p>I got this theory.</p>\n<p>About pro football.</p>\n<p>I call it \"The curse of the decent quarterback.\"</p>\n<p>And it goes a little something like this:</p>\n<p>Teams that find a decent quarterback are cursed to play them for a decade, to middling success at best.</p>\n<p>A good enough quarterback, I argue, only gives good enough results, not a ring. But they're too good to let go. So you keep them. And you never win it all.</p>\n<p>That's my theory.</p>\n<p>So what would I do if I were running a pro team?</p>\n<p>Glad you asked.</p>\n<p>I'd do weird ess like draft a QB every year, even if I think we've got a winner already.</p>\n<p>Just stack 'em.</p>\n<p>Have the best backup in the league. And the best 3rd string. Always.</p>\n<p>Even draft 1st round QBs in consecutive years. Maybe three in a row. Get them rookie contracts on the cheap.</p>\n<p>Heck, I might draft a QB in every round one year.</p>\n<p>Or, <em>better yet</em>, forget drafting QBs at all.</p>\n<p><em>Never</em> waste a single draft pick on a QB.</p>\n<p>Instead, sign those quarterbacks considered \"busts\" by their first teams, even second or third. Just round them all up. Treat free agency, waiver wire, and trades as your draft. And just pile 'em up.</p>\n<p>Why not?</p>\n<p>With that understood, then I'd focus on the offensive line. Then all defense. And lastly, the skill players.</p>\n<p>I won't insult any QB by naming them, I think you know what I mean if you watched for any length of time. It's such an important position in today's game that you must get the decision right. And then when you do, protect it at all costs. Even if you have to keep competition flowing by bringing in their heir apparents yearly.</p>\n<p>Have the QB feel like he's got to earn the starting role every game, because he does.</p>\n<p>I'm not a one trick pony, though. </p>\n<p>I got other ideas. </p>\n<p>Like how we should make draft combine participants run the 40 yard dash in full gear. Helmets and pads and all.</p>\n<p>To get a truer gauge of game speed.</p>\n<p>You like that shee, right?</p>\n<p>Of course, this is all just from the mind of a old(ish) flag football cornerback who just so happened to have a Rico Dynamite cannon for an arm.</p>\n<p>But from my armchair, it's as clear as a Preston, Idaho winter sky.</p>\n<p>Now, where's Jon Gruden when I need him?</p>\n<blockquote>\n<p>\"Coach, I got this theory...\"</p>\n</blockquote>\n<p> </p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-12-14T18:12:31-05:00",
            "date_modified": "2025-12-14T19:48:33-05:00"
        },
        {
            "id": "https://iterating.com/wont/",
            "url": "https://iterating.com/wont/",
            "title": "Wont",
            "summary": "Writing while tired is a silly, dangerous, thing. So I won't.",
            "content_html": "<p>Writing while tired is a silly, dangerous, thing.</p>\n<p>So I won't.</p>\n<p>But let me just say, it's pretty cool to write tired.</p>\n<p>You just ramble and ramble and hope maybe something worth something will tumble out.</p>\n<p>Of course, that's how I write every day.</p>\n<p>I don't like hosting, but we're hosting this weekend. So I'm writing early.</p>\n<p>Just in case.</p>\n<p>This writing every day thing has become important to me. </p>\n<p>Even though this is my second writing, it counts as the next day, technically.</p>\n<p>So the streak continues.</p>\n<p>Hermit don't like hosting. Hermit only like to do what he like to do. Hermit curmudgeon. Hermit need sleep.</p>\n<p>Goodnight.</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-12-13T00:26:27-05:00",
            "date_modified": "2025-12-13T00:52:24-05:00"
        },
        {
            "id": "https://iterating.com/raining-bows/",
            "url": "https://iterating.com/raining-bows/",
            "title": "Raining &#x27;Bows",
            "summary": "I'm still working through this idea that the secret to life&hellip;",
            "content_html": "<p>I'm still working through this idea that the secret to life is noticing, feeling, living the magic of everyday moments.</p>\n<p>Of making the routine feel elevated.</p>\n<p>Of seeing heaven in a favorite song.</p>\n<p>I think that's the whole point of this [<em>waves hands around chaotically</em>] thing.</p>\n<p>You know?</p>\n<p>We get 30,000 sunsets (give or take). </p>\n<p>30,000 golden hours right before.</p>\n<p>Each one magical.</p>\n<p>Each one sacred.</p>\n<p>If you want them to be.</p>\n<p>I took for granted growing up in the city.</p>\n<p>I never looked <em>up</em>.</p>\n<p>And now, when I see skyscrapers, I stare in awe like a tourist.</p>\n<p>How they block out the skyline because they <em>are</em> the skyline.</p>\n<p>How creatures just like us made them.</p>\n<p>From the ground up.</p>\n<p>I'll leave it to you whether skyscrapers are a good thing or a bad thing.</p>\n<p>But they are a pretty amazing display of what humans can do.</p>\n<p>I feel that way about redwood trees, too. Except we didn't make those.</p>\n<p>I heard a long time ago that we lose just as much as we gain by learning how a rainbow is made.</p>\n<p>And I suppose most think it's easier to be awed when you're young, naive, or just foolish.</p>\n<p>But it's true (about the rainbow).</p>\n<p>Sometimes boiling it down to textbook \"science\" takes a bit of the beauty away. Takes away the \"that which cannot be said.\" Takes away the magic. Because you know how the trick is done.</p>\n<p>Rainbows are magnificent.</p>\n<p>So are small humans that have half your genes (Lord help us) and half your love's (thank God).</p>\n<p>And Robin Williams (especially in his dramatic roles).</p>\n<p>And countless other things we experience routinely.</p>\n<p>We just get used to it all.</p>\n<p>So here's to never getting used to it.</p>\n<p>To keeping it forever fresh.</p>\n<p>Groundhog day is life for most. </p>\n<p>Over and over.</p>\n<p>Same same same.</p>\n<p>Is that a blessing or a curse?</p>\n<p>Is nothing sacred?</p>\n<p>Or is everything?</p>\n<p>I made my choice.</p>\n<p>What you doing?</p>\n<blockquote>\n<p>Double rainbow!!!</p>\n</blockquote>\n<p>These are what we stay alive for.</p>\n<p>Aye aye, Captain.</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-12-12T15:57:54-05:00",
            "date_modified": "2025-12-12T16:19:25-05:00"
        },
        {
            "id": "https://iterating.com/space-lord-mother-mother/",
            "url": "https://iterating.com/space-lord-mother-mother/",
            "title": "Space Lord Mother Mother",
            "summary": "Psst. Hey you. Yeah, I'm talking to you. Get over here.",
            "content_html": "<p>Psst.</p>\n<p>Hey you.</p>\n<p>Yeah, I'm talking to you.</p>\n<p>Get over here.</p>\n<p>Listen.</p>\n<p>Listen.</p>\n<p>There's some stuff that happened this year that has probably blown your mind.</p>\n<p>But guess what?</p>\n<p>Next year will be just as weird.</p>\n<p>Maybe weirder.</p>\n<p>Just like every year coming and every year since.</p>\n<p>Sure, maybe its got on a new outfit or shade of makeup.</p>\n<p>But it's all the same.</p>\n<p>Unless aliens come from a rock rocket.</p>\n<p>That would be different.</p>\n<p>I joked with my wife: \"What if they (the aliens) put in their starfaring flight to Earth, their dumbest, most disposable representative(s) they could find?\" </p>\n<p>Their planet's idiot(s).</p>\n<p>Just because they didn't want to lose anyone important.</p>\n<p>Not for something as trivial as a flight to our solar system.</p>\n<p>And these fools from the sky come down to say hello.</p>\n<p>And we humans and our world leaders race to greet them. With records of gold detailing our efforts. Maybe some even on the ground. On their knees.</p>\n<p>And these aliens are like, \"Woah. Cool.\"</p>\n<p>While we deify them.</p>\n<p>Or kill them.</p>\n<p>50/50.</p>\n<p>Same same.</p>\n<p>What would be better: Aliens sending their very best or their very worst?</p>\n<p>In my tale, they send their dumbest.</p>\n<p>And hilarity ensues.</p>\n<p>Or tragedy.</p>\n<p>Which will get funnier over time.</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-12-11T11:35:23-05:00",
            "date_modified": "2025-12-11T11:54:43-05:00"
        },
        {
            "id": "https://iterating.com/imp-patient/",
            "url": "https://iterating.com/imp-patient/",
            "title": "Imp Patient",
            "summary": "For a guy who almost died who still plays the long&hellip;",
            "content_html": "<p>For a guy who almost died who still plays the long game (I think), I'm understandably sort of impatient.</p>\n<p>I mean, I can delay gratification, delegate, lead, and all that bull mess, but what I mean is that window of time after the deal is done where you are waiting for everything to wrap up and close.</p>\n<p>The shipping time.</p>\n<p>The transfer time.</p>\n<p>The results of your efforts time.</p>\n<p>The when you can call it complete time.</p>\n<blockquote>\n<p>Put a bow on it!</p>\n</blockquote>\n<p>But it's always been that way. </p>\n<p>Studying for the bar exam sooooked. Taking the bar sucked. </p>\n<p>But waiting six months(!) for the results?</p>\n<p>Worst of all <em>by far</em>.</p>\n<p>Why? I think it's the <em>out of my control </em>part. The <em>what if</em> part. The <strong><em>not knowing</em></strong> part.</p>\n<p>Give me a bunch of things I can do to prepare and get it done, a mountain of them (please don't), and it'll get done. But once it's fate is in someone else's hands, I suppose that drives me a <em>little</em> crazy.</p>\n<p>What's taking so long?</p>\n<p>Do they need something else?</p>\n<p>Was I unclear?</p>\n<p>There's a snow storm in the rust belt. Is that why its delayed?</p>\n<p>This is a part of young me (Yung Mi?) that I carry today in my back pocket.</p>\n<p>And while I've done enough to discipline that boy over the years, he still shows his face every once in awhile.</p>\n<p>And the holidays with all its over-promising and under-delivering, well it's enough to make an old man shake his fist in the sky and throw punches at the sun.</p>\n<p>No old men here, though.</p>\n<p>Just hurry up already.</p>\n<p>[Shakes fist at screen.]</p>\n<p>Yung Mi yaaa, what are you going to do when you grow up?</p>\n<p>Coffee's for closers, you know.</p>\n<p>Just crank up <em>Enter Sandman</em> and brew me a cup.</p>\n<p>I'm just getting warmed up.</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-12-10T11:48:54-05:00",
            "date_modified": "2025-12-10T12:29:17-05:00"
        },
        {
            "id": "https://iterating.com/wholly/",
            "url": "https://iterating.com/wholly/",
            "title": "Wholly",
            "summary": "Someday, I'm going to write about sacralizing everything. It won't be&hellip;",
            "content_html": "<p>Someday, I'm going to write about sacralizing everything.</p>\n<p>It won't be today, but I'm building up to it.</p>\n<p>In a world where nothing is sacred, we really have it backwards.</p>\n<p>Everything is.</p>\n<p>If we want it to be.</p>\n<p>I'm learning that to see the <em>forever</em> in the <em>fleeting</em> is the key to this whole life thing.</p>\n<p>When you can see God in a sun ray during golden hour.</p>\n<p>When you feel it in your tummy when you see your wife's genuine smile. Her smize.</p>\n<p>When you hear your children belly laugh at silly jokes.</p>\n<p>These are just lights, grins, and giggles, you say.</p>\n<p>And you'd be right. They are just that.</p>\n<p>But you're also so very, very wrong.</p>\n<p>Both can be true.</p>\n<p>I hope you see that.</p>\n<p>Infinity fits in the palm of your hand.</p>\n<p>Eternity is an hour.</p>\n<p>Everything and nothing.</p>\n<p><em>C'est la vie</em>.</p>\n<p>∞ and 0.</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-12-09T12:35:14-05:00",
            "date_modified": "2025-12-09T12:59:42-05:00"
        },
        {
            "id": "https://iterating.com/aint-it-fun/",
            "url": "https://iterating.com/aint-it-fun/",
            "title": "Ain&#x27;t It Fun",
            "summary": "Are you having fun yet? I sure am. I remember someone&hellip;",
            "content_html": "<p>Are you having fun yet?</p>\n<p>I sure am.</p>\n<p>I remember someone saying if you're bored, you're boring.</p>\n<p>And I take that to heart.</p>\n<p>Bored people are snoozers.</p>\n<p>Peripheral people.</p>\n<p>Background noise.</p>\n<p>I'd make an L with my hand and put it to my forehead but I think that will get me cancelled (much like many of the things we grew up with).</p>\n<p>That's just going too far.</p>\n<p>I think the secret to non-boredom is finding excitement in the mundane.</p>\n<p>Joy in the routine.</p>\n<p>Infinity in the stillness.</p>\n<p>If there's an area that you love that most people would think crazy, I think that's your sweet spot.</p>\n<p>If you hold a view that is 180 degrees opposite of most, you should cultivate that.</p>\n<p>I mean, obey the law, be morally correct, but other than that? </p>\n<p>All bets are off.</p>\n<blockquote>\n<p>\"Don't be boredom, be boresmart!\"</p>\n</blockquote>\n<p>One of these days, one of my sayings will hit.</p>\n<p>It probably won't be that one, but c'mon, <em>c'mon</em>, this is good stuff here.</p>\n<p>[<em>Puts three fingers up and places hand over forehead...holds it there and pauses for a uncomfortably long time. Puts hand down. The author is strangely satisfied and pleased with himself. Grinning (smirking?), he then leaves the room.</em>]</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-12-08T11:59:15-05:00",
            "date_modified": "2025-12-08T12:13:37-05:00"
        },
        {
            "id": "https://iterating.com/pickles/",
            "url": "https://iterating.com/pickles/",
            "title": "Pickles",
            "summary": "\"So you're a dilettante?\" \"I'm a what?\" \"A dabbler, someone who&hellip;",
            "content_html": "<blockquote>\n<p>\"So you're a dilettante?\"</p>\n<p>\"I'm a what?\"</p>\n<p>\"A dabbler, someone who pretends to be an expert but really just knows a little about a lot.\"</p>\n<p>\"Oh. I am not.\"</p>\n</blockquote>\n<p>So, it turns out, I'm a dilettante.</p>\n<p>In a lot of ways.</p>\n<p>I didn't always know what that meant, and I suppose I still really don't.</p>\n<p>I mean, I love a lot of things.</p>\n<p>Interested in a lot of things.</p>\n<p>Some things I dig deeper.</p>\n<p>Most things I dig for a while.</p>\n<p>Some things stay.</p>\n<p>Most things have to go.</p>\n<p>I always respect and admire those who can center and hone in on their one thing.</p>\n<p>Like my buddy who loves to weld. Mothereffer a welder, to the bone.</p>\n<p>But reality is, I like to dabble.</p>\n<p>Call it whatever you want, but I just enjoy learning a little something new.</p>\n<p>And even after all these years, after all I think I know, I continue to find \"new\" areas.</p>\n<p>Now most of these have been around forever, but I never saw them. Even if they highly overlapped the areas I have been interested in for decades.</p>\n<p>To me, that's so neat.</p>\n<p>Bruce Lee said something like how he doesn't fear the man who has practiced 10,000 different techniques once. But rather fears the man who has practiced one kick 10,000 times.</p>\n<p>And that's right. You would fear a dude with one massively overbuilt leg. That ess would be scary.</p>\n<p>But hear me out.</p>\n<p>How would you fare against the man who practiced 10,000 different techniques ten times? A hundred?</p>\n<p>I'm just saying.</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-12-07T12:58:46-05:00",
            "date_modified": "2025-12-07T13:06:45-05:00"
        }
    ]
}
