{
    "version": "https://jsonfeed.org/version/1",
    "title": "Iterating",
    "description": "",
    "home_page_url": "https://iterating.com",
    "feed_url": "https://iterating.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "𖤂"
    },
    "items": [
        {
            "id": "https://iterating.com/genre/",
            "url": "https://iterating.com/genre/",
            "title": "Genre",
            "summary": "Who or what has shaped you the most? I would hope&hellip;",
            "content_html": "<p>Who or what has shaped you the most?</p>\n<p>I would hope you say you, or maybe something higher.</p>\n<p>But have you really thought about that?</p>\n<p>Why are you the way you are, and who gets the most credit (or blame) for it?</p>\n<p>I think you should start asking people that.</p>\n<p>You should start asking yourself.</p>\n<p>Because you will get a lot of the answers you seek.</p>\n<p>Answers you would never get otherwise.</p>\n<p>Most importantly, you get perspective.</p>\n<p>A point of view.</p>\n<p>If your life was a TV show (do we still call it that?), would it be a drama? A comedy?</p>\n<p>A tragedy?</p>\n<p>A redemption story?</p>\n<p>A love story?</p>\n<p>Or an epic trilogy, perhaps?</p>\n<p>How about a reality show?</p>\n<p>True crime?</p>\n<p>Paranormal?</p>\n<p>Where you at?</p>\n<p>When you on?</p>\n<p>Sorry, this is just what I do.</p>\n<p>When I want to learn more about something or someone, I ask a lot of questions of it.</p>\n<p>Mostly, I never ask a question, though.</p>\n<p>Not interested.</p>\n<p>Hard pass.</p>\n<p><em>Yawns</em>.</p>\n<p>Next!</p>\n<p>I have always felt like an outsider.</p>\n<p>Always been an outsider.</p>\n<p>Too much this to be that. Too much that to be this.</p>\n<p>I liked to lift heavy things, even if only to open and read them.</p>\n<p>Too New York for Cali. Too Cali for New York. Too Midwest to be Southern. Too Korean. Not enough Korean. Too Midwest to care about it at all (after a <em>looooooooong</em> long long  time). Long duck.</p>\n<p>And so that's my answer.</p>\n<p>Sort of.</p>\n<p>My outsiderness has given me the unique opportunity to find a home everywhere, with everyone.</p>\n<p>With exiles and executives.</p>\n<p>Janitors and jet flyers.</p>\n<p>Rolexes and Timexes.</p>\n<p>Noobs and grandmasters.</p>\n<p>And let me tell you: Good people are rarely the star of their show.</p>\n<p>The \"stars\" are usually asses.</p>\n<p>Ass.</p>\n<p>Es.</p>\n<p>I mean, there are probably jerk janitors. </p>\n<p>But do I have to convince you a CEO is a hole of buttocks?</p>\n<p>Didn't think so.</p>\n<p>And believe me, most CEOs think they are the leading man or lady.</p>\n<p>Actually, I have no idea.</p>\n<p>I don't care, really. Just seems like an easy and obvious example.</p>\n<p><em>Yawns</em>.</p>\n<p>Every life story, in the end, is a complete mashup of all of the above.</p>\n<p>I simplify it and say every story is a love story. But really, in a life truly lived, you have elements of tragedy, drama, comedy, adventure, action, love, and redemption.</p>\n<p>All of the above.</p>\n<p>The order is important, I think.</p>\n<p>A show about true crime ending in love and redemption - well that sounds pretty good.</p>\n<p>A show about comedy and action ending in tragedy? Eek. Probably would get better ratings, though.</p>\n<p>I'll end it here.</p>\n<p>To be continued.</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-01-27T15:04:21-05:00",
            "date_modified": "2026-01-27T15:10:08-05:00"
        },
        {
            "id": "https://iterating.com/time-spent/",
            "url": "https://iterating.com/time-spent/",
            "title": "Time Spent",
            "summary": "I listened to a book recently where the author says that&hellip;",
            "content_html": "<p>I listened to a book recently where the author says that money is the quantification of our values.</p>\n<p>And I think that's so right.</p>\n<p>So on the nose.</p>\n<p>What we spend our money on is what we value and our values.</p>\n<p>After the bare necessities, but even there, too.</p>\n<p>Our stinginess might show us, by its lack, how little we value something or someone.</p>\n<p>It works the other way, too.</p>\n<p>As most things do.</p>\n<p>How we spend in excess, and on what and who, is telling as to what and who we find valuable.</p>\n<p>And I suppose it works for more important areas than money.</p>\n<p>It works on how we quantify our time, thought, and attention.</p>\n<p>What we spend our time on, thinking about, and attending to is a quantification of our life values.</p>\n<p>Or, it should be, ideally.</p>\n<p>So I think the right questions to ask are some derivation of the following:</p>\n<p>What values am I expressing with how I spend money?</p>\n<p>What values am I expressing with how I spend time?</p>\n<p>What values am I expressing when I contemplate?</p>\n<p>What values am I expressing when I am in the zone?</p>\n<p>If you answer these, and do not like the answers, or at least decide that you can optimize and iterate on them, well I think that's time and money well spent.</p>\n<p>In role playing games, you can tally your life values by what are sometimes called experience points (XP). And while there are always trackers for money and items, it is ultimately your XP tally that measures and quantifies your character's life story.</p>\n<p>As much as I love valuable stuff, I think we need a real-life XP counter.</p>\n<p>We need a better way to quantify our value and values.</p>\n<p>You spend enough time on this earth, you know what I'm talking about.</p>\n<p>From highest high to lowest low, you will find that good people are everywhere (and its corollary).</p>\n<p>And age ain't it.</p>\n<p>Seen plenty of level one senior citizens.</p>\n<p>So how do we quantify good character?</p>\n<p>A good soul?</p>\n<p>A person worth it?</p>\n<p>Money is an easy quantifier.</p>\n<p>But I say a terrible one.</p>\n<p>We need a better measuring stick.</p>\n<p>How you invest your time. Your energy. Your perspective.</p>\n<p>This is more in nature of what I think truly brings rewards.</p>\n<p>What's in your heart, human?</p>\n<p>And do you show it by how you spend your life?</p>\n<p>Of course, this presupposes a lot of things.</p>\n<p>Presupposes you have enough to get by.</p>\n<p>And that is a silly presupposition, as presuppositions go.</p>\n<p>Those of you still fighting this fight are probably snickering.</p>\n<p><em>Must be nice to think about your values when I am out here just trying to survive.</em></p>\n<p>And to that I say:</p>\n<p>You're right.</p>\n<p>It <em>is</em> nice.</p>\n<p>A luxury.</p>\n<p>One I hope you find.</p>\n<p>For I was once in your shoes/sandals/flip-flops/probably boots.</p>\n<p>I would say it'll get better but I don't know if it will.</p>\n<p>I will say I was an <em>awful</em> quantifier of my values.</p>\n<p>And now I feel guilty buying a budget tablet from Lenovo.</p>\n<p>Just kidding.</p>\n<p>I love them little sheets.</p>\n<p>Like toilet paper.</p>\n<p>Almost disposable.</p>\n<p>And so this is a forever (t)issue.</p>\n<p>At least while we walk the earth.</p>\n<p>Why are you reading this musings column?*</p>\n<p>Don't you have anything better to do?**</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>* Thank you for reading.</p>\n<p>** Seriously though. Even playing video games might be better.</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-01-26T15:46:47-05:00",
            "date_modified": "2026-01-26T16:07:59-05:00"
        },
        {
            "id": "https://iterating.com/drafts/",
            "url": "https://iterating.com/drafts/",
            "title": "Drafts",
            "summary": "Have I been absurd enough lately? This is an important question&hellip;",
            "content_html": "<p>Have I been absurd enough lately?</p>\n<p>This is an important question to ask.</p>\n<p>So I'm asking:</p>\n<p>Have you been absurd enough lately?</p>\n<p>Absurd is a word I like to throw around this musings column.</p>\n<p>But what does it mean?</p>\n<p>Wildly unreasonable, illogical, or inappropriate.</p>\n<p>Wildly is a fantastic word.</p>\n<p>Anyone described as \"wildly\" well that gets my shaka sign. 🤙</p>\n<p>And let me ask you something.</p>\n<p>Where does being reasonable, logical, and appropriate get you?</p>\n<p>A whole stanky pile of normal.</p>\n<p>And we don't do normal here (or stanky).</p>\n<p>Have I told you I get emails from people?</p>\n<p>I suppose that isn't out of the ordinary.</p>\n<p>But a lot of the real ones seem a bit mysterious.</p>\n<p>Some share their life story.</p>\n<p>Some share a sentence.</p>\n<p>Or maybe just a word.</p>\n<p>I haven't written a single stranger back.</p>\n<p>And I suppose I should.</p>\n<p>But I don't know what to tell them.</p>\n<p>And I don't know who's real and who's just pretending.</p>\n<p>I'm just a guy floating in mid-air.</p>\n<p>Tongue out.</p>\n<p>Like MJ in the late 80s.</p>\n<p>I'm not MJ in the late 90s.</p>\n<p>Yet. </p>\n<p>But I'm getting there.</p>\n<p>I worry about his red eyes, though.</p>\n<p>Have for a while now.</p>\n<p>Em Jay you ok?</p>\n<p>He don't respond to my emails anymore either.</p>\n<p>But I never wrote him.</p>\n<p>How do I expect a response to emails I never sent?</p>\n<p>I want to thank every real person who has ever written me to share their story.</p>\n<p>I would also like to thank (to a lesser degree) every real person who has written me but have done so in a way that leaves more questions than answers.</p>\n<p>And thank you to those who take the time to read the mind of an absurd guy who got to live an absurd life.</p>\n<p>I get all your unsent emails.</p>\n<p>Now go out there and work on your curly, steaming, stack of absurdity.</p>\n<p>Make that sheet wild.</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-01-25T16:32:59-05:00",
            "date_modified": "2026-01-25T16:44:57-05:00"
        },
        {
            "id": "https://iterating.com/zero-effs/",
            "url": "https://iterating.com/zero-effs/",
            "title": "Zero Effs",
            "summary": "Some people can talk a good game. Talk, talk, talk. It's&hellip;",
            "content_html": "<p>Some people can talk a good game.</p>\n<p>Talk, talk, talk.</p>\n<p>It's the ones that share so much about how great they are that creep me out.</p>\n<p>Especially when no one else agrees.</p>\n<p>But it can work in other ways, too.</p>\n<p>Sometimes, you stumble upon stuff you never really ever wanted to know.</p>\n<p>For example, I recently learned about a trend on one of them newfangled (aka quite old) social media hades holes that is just someone begging for money.</p>\n<p>They livestream for cash.</p>\n<p>A lot of them struggling.</p>\n<p>It is quite sad.</p>\n<p>Some of them even admonish their viewers for not giving enough.</p>\n<blockquote>\n<p>You can do better than that!</p>\n</blockquote>\n<p>Oddly, it apparently works.</p>\n<p>Actually, I have no idea.</p>\n<p>I don't want to dig any further into it.</p>\n<p>I will say, though, part of me is impressed.</p>\n<p>One of the things about growing up Korean is that you have quite a bit of shame.</p>\n<p>You carry it.</p>\n<p>That is, you are <em>raised</em> to have it.</p>\n<p>How you can bring shame to yourself, and more importantly, shame to your family.</p>\n<p>Honor is sacred.</p>\n<p>And at first I thought, about these streamers, have you no shame?</p>\n<p>And I think, some of them don't, but some oddly shift it the other way. Not only do they have no shame, they shame their viewers. </p>\n<p>They shame their donors!</p>\n<p><em>How dare you not give to me. After all I've done (nothing but asking for money).</em></p>\n<p>It's the smart play.</p>\n<p>Weeds out a lot.</p>\n<p>Like how scams often contain typos and bad grammar intentionally. For it filters out everyone else so only the most susceptible are left.</p>\n<p>Easy pickings.</p>\n<p>Anyone who gives money to someone in need is a saint.</p>\n<p>But giving money to a stranger online because they demand you do so is an interesting consequence of, I think(?), analog loneliness.</p>\n<p>People want to hear their name out loud. Want to be thanked. Want to be shamed, even.</p>\n<p>They want a friend.</p>\n<p>Shame is many things, but it's not alone, especially amongst livestreams.</p>\n<p>So all of that to say, here is my Venmo:</p>\n<p>Just kidding.</p>\n<p>But if you're offering...</p>\n<p>I shouldn't joke.</p>\n<p>Listen, if you're cutting checks...</p>\n<p>Is that what they still say? Cutting checks?</p>\n<p>I think that's right.</p>\n<p>I hope it's all some sort of artistic statement. Begging streams. Some sort of ironic tragecomedy.</p>\n<p>Like those pranks they play on people just to see what they do.</p>\n<p>And they film it.</p>\n<p>But I know, I know, somehow, that would be worse.</p>\n<p>There's a picture of near century old Billy Shatner eating a bowl of cereal from the driver's seat of his car.</p>\n<p>And I've seen a lot of folks saying that is their goal.</p>\n<p>To be able to live with that zero of an eff to give.</p>\n<p>Eating corn flakes at a red light.</p>\n<p>I just see negligence (or self-driving) at best.</p>\n<p>And I love Bill Shat.</p>\n<p>So he gets a pass.</p>\n<p>But begging for money live streaming is just stratospherically worse.</p>\n<p>I dig the chutzpah, though.</p>\n<p>Shameful, but ballsy.</p>\n<p>So these digital folks with their pixeled palms out, I'm hoping its some weird ai thing. But I know it ain't.</p>\n<p>I know it ain't.</p>\n<p>It's as real as anything is these days.</p>\n<p>This coming from an optimist.</p>\n<p>Optimist Prime.</p>\n<p>Tick tock, tick tock...</p>\n<p>⏰ = 💰</p>\n<p>🥺</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-01-24T18:55:41-05:00",
            "date_modified": "2026-01-24T19:31:13-05:00"
        },
        {
            "id": "https://iterating.com/opus-apex/",
            "url": "https://iterating.com/opus-apex/",
            "title": "Opus Apex",
            "summary": "For the first twenty or so years of your life, your&hellip;",
            "content_html": "<p>For the first twenty or so years of your life, your life is pretty much about you.</p>\n<p>Maybe 30.</p>\n<p>Sometime before 40, I hope, you start to think about other people more than you do about yourself.</p>\n<p>At least, that's what happened to me.</p>\n<p>My life hasn't been about me for a long time.</p>\n<p>And I love it that way.</p>\n<p>There was a season where everything was about me again a few years ago, but that's because I was fighting for my life.</p>\n<p>That was/is a boss battle.</p>\n<p>But even then, I wanted to make sure my family was taken care of.</p>\n<p>Was impacted least.</p>\n<p>Were finding silver linings.</p>\n<p>I don't say that to brag, I just didn't want to go out without leaving instructions or on a bad note.</p>\n<p>I wanted them to remember me at my best.</p>\n<p>I didn't want to whither away.</p>\n<p>But I almost did.</p>\n<p>I mean I withered.</p>\n<p>But not totally away.</p>\n<p>You come to peace in such moments.</p>\n<p>What a good run I had.</p>\n<p>How blessed.</p>\n<p>You see, the loss is all on this side of life.</p>\n<p>For those that remain.</p>\n<p>At least, that's how I choose to see it.</p>\n<p>It's funny.</p>\n<p>All this time feels extra.</p>\n<p>Like a bonus.</p>\n<p>Like an after-but-before-afterlife.</p>\n<p>A sequel.</p>\n<p>Like I got a second chance.</p>\n<p>I've had a few of those, you know.</p>\n<p>I wish I could tell you it will all work out. </p>\n<p>But you have to figure it out on your own.</p>\n<p>I will say that I always thought life was all about me.</p>\n<p>How I didn't need anyone.</p>\n<p>And how wrong I was.</p>\n<p>How it's all about the people you love.</p>\n<p>All about the people who love you.</p>\n<p>Not fake you.</p>\n<p>The real you.</p>\n<p>The one that appears when everyone else is gone you.</p>\n<p>They know <em>that</em> you. They know you by your actions, your thoughts, not just your words.</p>\n<p>These are the ones that get to stay.</p>\n<p>Because they loved you even at your withered.</p>\n<p>And they cheer you loudest at your best.</p>\n<p>I think the kids call it being a \"real one.\"</p>\n<p>So this is for the real ones.</p>\n<p>Am I saying that right?</p>\n<p>Oh, I'm not.</p>\n<p>This is for <em>my</em> real ones.</p>\n<p>Who know my real one.</p>\n<p>The end and the beginning.</p>\n<p>♥️</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-01-23T17:08:29-05:00",
            "date_modified": "2026-01-23T17:34:03-05:00"
        },
        {
            "id": "https://iterating.com/two-fiddy/",
            "url": "https://iterating.com/two-fiddy/",
            "title": "Two Fiddy",
            "summary": "This year marks the United States' 250th anniversary. Still a young&hellip;",
            "content_html": "<p>This year marks the United States' 250th anniversary.</p>\n<p>Still a young country by some metrics, but fully an adult.</p>\n<p>And it got me to think, I probably won't see 300th. Or if I get there, I probably won't be able to do much about it.</p>\n<p>So 250th we will celebrate.</p>\n<p>'Merica.</p>\n<p>It's weird to me to live in a time where patriotism is considered by some as bad.</p>\n<p>Where waving Old Glory can get you hurt.</p>\n<p>At least here. On home turf.</p>\n<p>That's weird, to me.</p>\n<p>I love this country.</p>\n<p>My country.</p>\n<p>Tis of thee.</p>\n<p>I'd wear yellow and red and shake and beat up heels, but yellow and red ain't my colors.</p>\n<p>I'm more rose gold.</p>\n<p>I tell you what, though, things are very interesting.</p>\n<p>I think there is a war going on.</p>\n<p>But instead of good versus evil, it's a little more nuanced. A little easier to spot.</p>\n<p>I'd say it is the beautiful versus the ugly.</p>\n<p>There is a war on beautiful.</p>\n<p>Usually fought by uglies.</p>\n<p>And I hate to say it, but we outnumbered.</p>\n<p>That's right, that was just a sneaky way to say I think I'm beautiful.</p>\n<p>A beautiful patriot. I'm a Giants fan so that \"p\" will stay lowercase.</p>\n<p>Speaking of Harbaugh, I recall a story he and his brother shared about their father. How every morning, as he dropped his two sons off at school, he would say the same thing.</p>\n<blockquote>\n<p>\"Now, boys, I want you to attack this day with an enthusiasm previously unknown to mankind.\"</p>\n</blockquote>\n<p>I heard that decades ago and I still remember it verbatim. Because, man, if that ain't America, well I don't what is.</p>\n<p>Now, I'd say that to you right now, but I'm not your daddy. </p>\n<p>Unless my kids are reading this, then, of course I am your daddy.</p>\n<p>I'm talking to these other people who want me to coach them.</p>\n<p>Who want me to mentor them.</p>\n<p>Somewhere between 250 and 300, I might be available, but not today.</p>\n<p>Not this year.</p>\n<p>This year, I celebrate some important birthdays.</p>\n<p>To singing your anthem perfectly.</p>\n<p>And motivational founding fathers.</p>\n<p>Happy birthday.</p>\n<p>🇺🇸</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-01-22T12:27:52-05:00",
            "date_modified": "2026-01-22T12:37:30-05:00"
        },
        {
            "id": "https://iterating.com/living-on-the-end-of-a-lightning-bolt/",
            "url": "https://iterating.com/living-on-the-end-of-a-lightning-bolt/",
            "title": "End Of A Lightning Bolt",
            "summary": "What a year it's been. And we're on Day 21. A&hellip;",
            "content_html": "<p>What a year it's been.</p>\n<p>And we're on Day 21.</p>\n<p>A lucky number for some.</p>\n<p>As you get older, you realize certain things.</p>\n<p>Patterns emerge.</p>\n<p><em>Didn't we do this a decade ago? Two?</em></p>\n<p>They say history doesn't repeat, it rhymes.</p>\n<p>As you get lucky enough to be an adult with silver hairs, you start to realize something.</p>\n<p>Everything is manipulated.</p>\n<p>Someone is stirring the pot.</p>\n<p>Who?</p>\n<p>Well, you should consider such questions very dangerous.</p>\n<p>And the truth is, I have no idea.</p>\n<p>I do have suspects, though.</p>\n<p>And I just wonder, if all the noise is meant to distract us.</p>\n<p>Up, down. War, peace. Win, lose. Live, die.</p>\n<p>Government doesn't always use its money honestly and fairly?</p>\n<p>Politicians can be crooked?</p>\n<p>The market is going down?</p>\n<p>We got conflict in our streets?</p>\n<p>People love to gamble?</p>\n<p>There are concerns of war all over the globe?</p>\n<p>Huh.</p>\n<p>Who knew?</p>\n<p>This is not news.</p>\n<p>This is the history of our world.</p>\n<p>Humans are flawed.</p>\n<p>Even, especially, our best ones.</p>\n<p>And good intentions can have some pretty evil consequences.</p>\n<p>Look back, it will show you what's coming towards.</p>\n<p>It might be different, but it's the same.</p>\n<p>Lock it up, lock it in. </p>\n<p>The time coming.</p>\n<p>Me?</p>\n<p>I'm changing the world by changing me.</p>\n<p>If I can change my world, the world is changed (at least to me).</p>\n<p>And shouldn't that be the first metric?</p>\n<p>So I'm dancing in the stratosphere, with Dusty, and the American Dream.</p>\n<p>Just thankful for my piece (peace).</p>\n<p>⚡</p>\n<p>🙏</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-01-21T15:52:39-05:00",
            "date_modified": "2026-01-22T12:35:04-05:00"
        },
        {
            "id": "https://iterating.com/alpha-omega/",
            "url": "https://iterating.com/alpha-omega/",
            "title": "Alpha Omega",
            "summary": "I believe in every day sacralization. To make every day, every&hellip;",
            "content_html": "<p>I believe in every day sacralization. </p>\n<p>To make every day, every moment, something beyond sacred.</p>\n<p>Beyond holy.</p>\n<p>This is, of course, easier said than done.</p>\n<p>But it's good to have nice goals.</p>\n<p>Another goal I'm narrowing down on is this idea of an Apex Opus.</p>\n<p>It's my play on magnum opus, but even more unique, more personal, more for you.</p>\n<p>The pinnacle work.</p>\n<p>Your highest success.</p>\n<p>And while I see it as an integral part of raising a family and leading your tribe, I also wonder if it could be something more distilled, more concrete, even if non-analog.</p>\n<p>Magnum opuses are works of art or books.</p>\n<p>What about apex opuses?</p>\n<p>I'm not sure yet.</p>\n<p>A word (or more), a drawing, a human being (or three), a creation of some form that you made or transformed with your own bare mind and hands.</p>\n<p>That sounds good.</p>\n<p>As I believe that we will all be remembered most for a snapshot in time (hopefully in the Best of Times), I also believe that we will be honored for our best work.</p>\n<p>At least, ideally.</p>\n<p>If you're a crook, folks tend to remember you at your worst. For your worst actions. For your worst work.</p>\n<p>But let's try to avoid that.</p>\n<p>Let's go the other way.</p>\n<p>A 180.</p>\n<p>And try to be remembered at our best.</p>\n<p>At our highest.</p>\n<p>At our grandest.</p>\n<p>At our apex.</p>\n<p>Now, for most of you, I have really good news.</p>\n<p>You haven't hit your peak yet.</p>\n<p>But I have some less good news.</p>\n<p>You have to start working on your apex opus.</p>\n<p>Wait, that sounds like excellent news.</p>\n<p>It doesn't have to become well-known, if the only person who benefits is you, I call that a win.</p>\n<p>But start to think about it.</p>\n<p>Who are you?</p>\n<p>What are you about?</p>\n<p>And what will you be at your highest point?</p>\n<p>Show your work.</p>\n<p>And what you show will be proof you were here.</p>\n<p>And that you made something of yourself.</p>\n<p>And if no one else will applaud, well, you can count on at least one pair of hands.</p>\n<p>Not me, though. </p>\n<p>Probably your umma.</p>\n<p>But it should be you.</p>\n<p>Sorry, I probably led you to think it'd be me clapping.</p>\n<p>I'm like Tony Danza ova here.</p>\n<p>Busy.</p>\n<p>AO.</p>\n<p>OA.</p>\n<p>Al out.</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-01-20T13:52:54-05:00",
            "date_modified": "2026-01-20T14:18:27-05:00"
        },
        {
            "id": "https://iterating.com/apex-opus/",
            "url": "https://iterating.com/apex-opus/",
            "title": "Apex Opus",
            "summary": "Today is like a second Sunday. It feels like that to&hellip;",
            "content_html": "<p>Today is like a second Sunday.</p>\n<p>It feels like that to me.</p>\n<p>And so, I don't want to write too much, because I already did.</p>\n<p>But here's something interesting.</p>\n<p>In a good life, I think that having a <em>magnum opus</em> is essential.</p>\n<p>Having a great work.</p>\n<p>Having made something of tremendous value.</p>\n<p>If only for yourself. And your loved ones.</p>\n<p>An impact.</p>\n<p>But even more important is having an <em>apex opus</em>.</p>\n<p>Your highest work.</p>\n<p>Your grandmasterpiece.</p>\n<p>Your verse.</p>\n<p>As in, what will be the headline on your obituary?</p>\n<p>And I mean that in a good way.</p>\n<p>In the best way.</p>\n<p>I am iterating on this big idea.</p>\n<p>To dreams.</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-01-19T16:22:32-05:00",
            "date_modified": "2026-01-19T19:10:34-05:00"
        },
        {
            "id": "https://iterating.com/don-of-kings/",
            "url": "https://iterating.com/don-of-kings/",
            "title": "Don of Kings ",
            "summary": "I interrupt this musings column with the following: Why hasn't anyone&hellip;",
            "content_html": "<p>I interrupt this musings column with the following:</p>\n<p>Why hasn't anyone told me about chess boxing?</p>\n<p>You know, the hybrid sport that alternates rounds of boxing and chess?</p>\n<p>Aka the Sport of the Future?</p>\n<p><em>60 Minutes</em> did a feature on it a couple of months ago.</p>\n<p>It's huge in Russia (I think). Has been for years (I think).</p>\n<p>And I'm just hearing about it now.</p>\n<p>Brains and brawn.</p>\n<p>Hooks and rooks (stole that from the <em>60M</em> segment, but it's pretty good!).</p>\n<p>Perfect for a nerd who can fight (sorta).</p>\n<p>Or a fighter who can nerd out (sorta).</p>\n<p>Aka, <em>my people</em>.</p>\n<p>You can have your pickles and balls.</p>\n<p>Feast on 'em.</p>\n<p>I found my old man sport.</p>\n<p>♟🥊</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-01-18T17:50:21-05:00",
            "date_modified": "2026-01-18T17:55:11-05:00"
        }
    ]
}
