{
    "version": "https://jsonfeed.org/version/1",
    "title": "Iterating",
    "description": "",
    "home_page_url": "https://iterating.com",
    "feed_url": "https://iterating.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "AL8X"
    },
    "items": [
        {
            "id": "https://iterating.com/nails-and-unicorns/",
            "url": "https://iterating.com/nails-and-unicorns/",
            "title": "Nails and Unicorns",
            "summary": "Every decision you have ever made, good or bad, has put&hellip;",
            "content_html": "<p>Every decision you have ever made, good or bad, has put you right here. </p>\n<p>To where you are right now.</p>\n<p>If you're happy with where you are right now, it's hard to have regrets.</p>\n<p>Every downturn led to an up, every up to a down. Sometimes they stack.</p>\n<p>It's the downturn stacks you must avoid. Loss on loss on loss.</p>\n<p>Upturn stacks are sacred. Gain on gain on gain.</p>\n<p>Exponential works both ways.</p>\n<p>But they happen. For want of nails or unicorns.</p>\n<p>We've all been through it. If you haven't yet, you will.</p>\n<p>And if you really think about it, every gain and every loss has also provided an accompanying loss and gain as well.</p>\n<p>Yin and yang. Bad in good. Good in bad.</p>\n<p>The real questions are:</p>\n<p>What do we lose in gain?</p>\n<p>And what do we gain in loss?</p>\n<p>Hope you find your nail, even if you stepped on it.</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-11-02T12:17:48-05:00",
            "date_modified": "2025-11-02T12:28:17-05:00"
        },
        {
            "id": "https://iterating.com/v50/",
            "url": "https://iterating.com/v50/",
            "title": "V5.0",
            "summary": "One thing they don't tell you about life is that if&hellip;",
            "content_html": "<p>One thing they don't tell you about life is that if you live long enough you go through different versions of yourself.</p>\n<p>The first version is your childhood. Large and small iterations as you turn older. Teen. Young adult. Professional. Parent. Grandparent. Retired. Professional amateur. Etc.</p>\n<p>The way I figure it, I'm at version 5.0.</p>\n<p>I'm not saying it's better than previous versions (yes, I am), but there's things that have been refined, things removed, and things added.</p>\n<p>Like all major updates.</p>\n<p>There's been a lot of hours upping my wisdom score and a lot less time in the weight room (not many centenarians walking around at 220 pounds). More long walks (for me).</p>\n<p>Oh, and there's the fact that version 4.something almost died.</p>\n<p>There's that, too.</p>\n<p>Anyways, that's what I'll leave you with.</p>\n<p>This idea that we're always changing.</p>\n<p>I don't think people tell people this enough.</p>\n<p>You don't stay the exact same your whole life. </p>\n<p>There are different phases. Seasons. Versions.</p>\n<p>You just keep iterating.</p>\n<p>Iterating.</p>\n<p>That's kind of the whole thing we're doing, right?</p>\n<p>Huh.</p>\n<p>Mental note.</p>\n<p>To versions past, present and future.</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-11-01T15:25:48-04:00",
            "date_modified": "2025-11-01T15:38:14-04:00"
        },
        {
            "id": "https://iterating.com/au-contraire/",
            "url": "https://iterating.com/au-contraire/",
            "title": "Au Contraire",
            "summary": "I am sort of a contrarian. In some things. There's headlines&hellip;",
            "content_html": "<p>I am sort of a contrarian. In some things.</p>\n<p>There's headlines all over the place of heinous crimes done and thwarted.</p>\n<p>This is the history of our world, but it sure seems like a lot of them lately. A literal doom scroll.</p>\n<p>And one of the things you see all the time is, such and such happened.</p>\n<p>Tragedy happened.</p>\n<p>Or, better, tragedy narrowly averted.</p>\n<p>We got 'em.</p>\n<p>There is no danger to the public.</p>\n<p>Go about your day.</p>\n<p>Nothing to see here, people.</p>\n<p>It's the \"no danger\" part that makes me chuckle.</p>\n<p>This illusion that hey, yeah a group of bad people were going to do a lot of not good, but we caught them all (we think, we're still looking into it), so go on about your business.</p>\n<p>It's the oxygen mask falling down in a doomed air flight.</p>\n<p>This reassurance of safety that to me is not so reassuring.</p>\n<p>Of course, this is done for many reasons, some of them strategic.</p>\n<p>Mostly, I think it's done to keep us in our little bubbles of same.</p>\n<p>So what do I do?</p>\n<p>I know that's what you're wondering.</p>\n<p>Well, I'll tell you what I do.</p>\n<p>You wanna know?</p>\n<p>Really?</p>\n<p>I suppose that's why you're here.</p>\n<p>Okay, I tell my family, when the going gets tough, when the ess is hitting the proverbs, whatever you do, whatever happens: Panic!*</p>\n<p>That's what I tell them.</p>\n<p>\"Whatever you do: Panic!\"</p>\n<p>We laugh and laugh.</p>\n<p>It always brings light to a dark hypothetical.</p>\n<p>I think these \"no danger to the public\" lines bring hypothetical lights to dark truths.</p>\n<p>And you can't see in the dark, mon frere.</p>\n<p>Especially with hypothetical lights.</p>\n<p>...</p>\n<p>PANIC!!!</p>\n<p><em>*What? Did you think I was going to say I fight crime? Who am I, Aqua Man?</em></p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-10-31T13:18:50-04:00",
            "date_modified": "2025-10-31T13:50:23-04:00"
        },
        {
            "id": "https://iterating.com/how-to-keep-score/",
            "url": "https://iterating.com/how-to-keep-score/",
            "title": "How to Keep Score",
            "summary": "How do you measure how well you're doing in your life?&hellip;",
            "content_html": "<p>How do you measure how well you're doing in your life?</p>\n<p>Money? Cars? Homes? Careers? Accolades and awards?</p>\n<p>Exits?</p>\n<p>Moonshots?</p>\n<p>Followers?</p>\n<p>PRs?</p>\n<p>Net worth?</p>\n<p>I think these are all fine and dandy metrics, but really, I think these are all wrong.</p>\n<p>I think things like:</p>\n<p>Do I have and live by my values?</p>\n<p>Am I happy and content?</p>\n<p>Do I love well?</p>\n<p>Am I blessed?</p>\n<p>These feel more right.</p>\n<p>Warren Buffett (of all people -- you'll soon see why I note this) once said something along the lines of \"Would you rather be known as the world's greatest lover but in fact be the world's worst? Or would you rather be known as the world's worst lover but in fact be the world's best?\"</p>\n<p>The idea being only you should define how well you're doing in life. If you rely on the opinion of others, you will often find that path lacking. I know I did.</p>\n<p>Too many people sell their sacred integrity for more reputation.</p>\n<p>Soul for show.</p>\n<p>It's time for a new measuring stick.</p>\n<p>Determining our own truths and sticking to our first principles is a huge and hard win. To <em>be</em> worthy. To believe we are and have enough. To seek more not for external praise but internal reward. Because you resonate most when you chase what is in harmony with your innerkeeper.</p>\n<p>Too many people want to go viral. </p>\n<p>Just be your cure.</p>\n<p> </p>\n<p> </p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-10-30T00:43:11-04:00",
            "date_modified": "2025-10-30T01:29:57-04:00"
        },
        {
            "id": "https://iterating.com/revenge-of-the-nerds/",
            "url": "https://iterating.com/revenge-of-the-nerds/",
            "title": "Revenge of the Nerds",
            "summary": "Life is oversimplification. Here is another example. People who excel early&hellip;",
            "content_html": "<p>Life is oversimplification.</p>\n<p>Here is another example.</p>\n<p>People who excel early in life in athletics use their bodies to fund their lives. Often sacrificing their health in their later years to do so.</p>\n<p>People who excel early in life in business use their brains to fund their lives. Often sacrificing their health in their early years to do so.</p>\n<p>But what I realized about nerds (especially those who do really well for themselves), they start becoming health nuts.</p>\n<p>Instead of peaking physically at an early age, they peak later. Much later.</p>\n<p>Making up for lost time.</p>\n<p>It results in this strange thing of seeing old legends in terrible shape and old nerds looking jacked.</p>\n<p>I use these terms affectionately.</p>\n<p>Who am I to say which way is best?</p>\n<p>I skipped class in law school to go lift.</p>\n<p>Look how great I turned out.</p>\n<p>You know where the weight room is?</p>\n<p>I'll check it out.</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-10-29T11:50:24-04:00",
            "date_modified": "2025-10-29T12:04:48-04:00"
        },
        {
            "id": "https://iterating.com/pros-and-cons/",
            "url": "https://iterating.com/pros-and-cons/",
            "title": "Prose and Cons",
            "summary": "You know that the \"con\" in conmen is short for confidence?&hellip;",
            "content_html": "<p>You know that the \"con\" in conmen is short for confidence?</p>\n<p>Confidence is a heck of thing. Faith in someone or something.</p>\n<p>I saw the recent video of Michael Jordan nervously (Michael Jordan!) shooting a free throw.</p>\n<p>He sank it with ease. Goats will be goats. But Michael Jordan, man. Nervous making a free throw in somebody's backyard.</p>\n<p>Ain't that something?</p>\n<p>Confidence is not the absence of nerves; being nervous is kind of like being excited, right?</p>\n<p>Who doesn't like being excited?</p>\n<p>Think about that the next time you're nervous.</p>\n<p>And sink it with ease.</p>\n<p> </p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-10-28T14:34:25-04:00",
            "date_modified": "2025-10-28T14:46:33-04:00"
        },
        {
            "id": "https://iterating.com/pen-over-sword/",
            "url": "https://iterating.com/pen-over-sword/",
            "title": "Quill Over Sword",
            "summary": "When I sit down to write here, I usually do so&hellip;",
            "content_html": "<p>When I sit down to write here, I usually do so spontaneously.</p>\n<p>You can probably tell because sometimes I wait to get to the point because I have no point when I start writing.</p>\n<p>Like right now, I have no point to make here, so I'm stalling by writing more words.</p>\n<p>Is it working?</p>\n<p>Is a point being made here?</p>\n<p>I don't know.</p>\n<p>This is my finest work yet.</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-10-27T13:31:30-04:00",
            "date_modified": "2025-10-27T13:32:13-04:00"
        },
        {
            "id": "https://iterating.com/both-can-be-true/",
            "url": "https://iterating.com/both-can-be-true/",
            "title": "Both Can Be True",
            "summary": "Almost forgot to write today. I mean, I did forget. But&hellip;",
            "content_html": "<p>Almost forgot to write today. I mean, I did forget.</p>\n<p>But no time like the present.</p>\n<p>My goal is to write at least once a day. And while no one's really paying attention, I'm paying attention. That means something, at least to me. Maybe someone in the future, too.</p>\n<p>If you ever have the good fortune to love someone, my goodness, what a thing it is.</p>\n<p>And the thing about love is it makes you stronger and weaker at the same time. </p>\n<p>Love gives you strength beyond measure, but it can also leave you so vulnerable in many ways.</p>\n<p>Heartbreaks are audible, visceral, and as true as any compound fracture. And I'm not just talking romantic ones.</p>\n<p>Love is having the utmost affection and concern. Strength and weakness.</p>\n<p>I don't know why I write about love today -- who knows why I write about anything.</p>\n<p>I am so loved in this life. For that, I am too lucky (I know it). For them, I love forever (they know it).</p>\n<p>I've been hearing a lot of people giving up on love, which just seems a foolish waste of an infinite resource.</p>\n<p>Love is reserved for those made of flesh and bone. I won't speak for celestial bodies, just all of humanity and all Earth life, if that's alright. Oh, and those things that are alive but do not have flesh or bones can probably love, too. You know what I meant.</p>\n<p>But will ai ever know love? It'll parrot anything you train it to. Some living things are that way.</p>\n<p>Humans can fall in love with anything.</p>\n<p>Strength and weakness.</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-10-26T23:22:39-04:00",
            "date_modified": "2025-10-26T23:55:46-04:00"
        },
        {
            "id": "https://iterating.com/new-dog-old-tricks/",
            "url": "https://iterating.com/new-dog-old-tricks/",
            "title": "New Dog, Old Tricks",
            "summary": "There's a part of me that grew up with this idea&hellip;",
            "content_html": "<p>There's a part of me that grew up with this idea of fair fights.</p>\n<p>Generally speaking, it was one versus one, no outside interference, and you played by a set of rules. No hitting the spinal column, eye balls, balls balls.</p>\n<p>You know, fair fights.</p>\n<p>But to those who are not yet fully formed, or those who are and were given a size, age, or health disadvantage (relative to their opponent(s)), there is no such thing as a fair fight.</p>\n<p>Every fight is unfair. Already in favor of the other side.</p>\n<p>We can do things like train and learn techniques and what not.</p>\n<p>But big can usually beat little.</p>\n<p>Usually.</p>\n<p>One of the ways it sometimes doesn't is by changing it into a fair fight.</p>\n<p>Kicking groins. Gouging eyes. Elbowing spines.</p>\n<p>Pocket sand!</p>\n<p>You know, fighting \"dirty\"? But to me, that's not fighting dirty. That's fighting fair.</p>\n<p>Real life ain't the UFC or boxing.</p>\n<p>I suppose there is the law. But that's the only rules. </p>\n<p>If someone is trying to kill you, you should be prepared to fight to the death.</p>\n<p>And should you ever find yourself unarmed and in a fight, remember that the easiest ways to win are:</p>\n<p>1) Explosive, angry, force. I mean animal mean. The will to fight and do so violently is incredibly underrated. Who wants to contend with a pissed-off yellow jacket?; and/or</p>\n<p>2) Tire them out. Most people aren't trained to fight for any length of time. If you can handle their initial wind, there usually isn't enough time for them to get their second. Fatigue and cowards, you know. This is the downside of Point 1.</p>\n<p>Oh, and this probably wouldn't work as well to those with extensive training.</p>\n<p>But yeah, like most fights, the best way to win is just to avoid them.</p>\n<p>Woof.</p>\n<p>DISCLAIMER: I am a man of peace. Do not fight, people. Follow the law. And absolutely, positively, defend yourself and your loved ones.</p>\n<p>There is no honor in violent encounters, but there is in you.</p>\n<p>Good, Dog.</p>\n<p> </p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-10-25T18:22:11-04:00",
            "date_modified": "2025-10-25T19:05:42-04:00"
        },
        {
            "id": "https://iterating.com/fall/",
            "url": "https://iterating.com/fall/",
            "title": "Fall",
            "summary": "What a wonderful time of year. Color changes. Perky cool winds.",
            "content_html": "<p>What a wonderful time of year.</p>\n<p>Color changes. Perky cool winds. Favorite hoodies.</p>\n<p>Falls seem shorter now. </p>\n<p>There's always nostalgia in my blood during these months.</p>\n<p>I'm blessed with the ability to focus on my best memories. Like how we only listen to our favorite band's best songs and forget their worst.</p>\n<p>Skip. Skip. Aww sookie.</p>\n<p>And fall is a wonderful season to reminisce. </p>\n<p>Winter is unforgiving, but autumn is more of a listener.</p>\n<p>May all your falls be short ones.</p>\n<p>To autumn and everything after.</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-10-24T22:42:01-04:00",
            "date_modified": "2025-10-24T22:59:41-04:00"
        }
    ]
}
