{
    "version": "https://jsonfeed.org/version/1",
    "title": "Iterating",
    "description": "",
    "home_page_url": "https://iterating.com",
    "feed_url": "https://iterating.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "AL8X"
    },
    "items": [
        {
            "id": "https://iterating.com/more-human-than-human/",
            "url": "https://iterating.com/more-human-than-human/",
            "title": "More Human Than Human",
            "summary": "Have you heard about this new fangled thing called Artificial Intelligence?&hellip;",
            "content_html": "<p>Have you heard about this new fangled thing called Artificial Intelligence?</p>\n<p>No?</p>\n<p>It's all the rage with kids and old people. I fit somewhere in the middle.</p>\n<p>And I have to admit, it's got a lot of utility.</p>\n<p>Just this past week, I had it rediscover (for me) a Korean singer in the 80s/90s.</p>\n<p>It's like an personal assistant who you task with an assignment that would normally take hours, days, or weeks and instead it completes it almost instantly. Sure, it's wrong more than we like, but that comes with everything.</p>\n<p>Perfection eludes even AI.</p>\n<p>Oh, and the price is right. One of the perks of this race towards AGI is that companies are losing huge amounts just to gain users like us. Of course, we are helping train it, feeding and fattening it up. But nothing in the world is free (except our souls).</p>\n<p>It seems like more than ever, the program is starting to sound real.</p>\n<p>And if it can do most of our tasks, what is left for humans?</p>\n<p>Are we all supplied a universal basic income and left to pursue our dreams?</p>\n<p>Can you buy a fleet of robots that work for you? You buy a robot that companies hire, paying you their salary.</p>\n<p>You see where I'm headed?</p>\n<p>It seems naive to not believe our future is some what dystopian.</p>\n<p>Some might say we're already there.</p>\n<p>But I think there's a lot of value in contemplating what it means to be a human being right now and in this near future.</p>\n<p>I don't know. All this is rusty writing. Rambles. Iterations.</p>\n<p>We are now able to upload a person's image, writings, voice recordings and recreate them now. Add in tangible robots or VR headsets, and you can almost have everyone you have ever wanted in your life, in your life.</p>\n<p>Sure, it wouldn't be them, but you wouldn't be able to tell the difference.</p>\n<p>Or would you?</p>\n<p>And if you could, would you even care?</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-10-21T14:51:35-04:00",
            "date_modified": "2025-10-21T14:51:35-04:00"
        },
        {
            "id": "https://iterating.com/hippos/",
            "url": "https://iterating.com/hippos/",
            "title": "Hippos",
            "summary": "Have you ever run into someone who recommended a book, like&hellip;",
            "content_html": "<p>Have you ever run into someone who recommended a book, like highly, and then you read the book, only to have come to the conclusion that the person recommending this book does nothing (and often opposite of what) the book recommends?</p>\n<p>I'm talking books that range as high as the Bible to as low as the latest hyped \"best seller\" in self-help / business. </p>\n<p>\"Oh, you gotta read this.\"</p>\n<p>You do. And then you think. Huh. Did this mothereffer read a single page? Is this opposite day?</p>\n<p>People who portray themselves as one thing, who purport to walk a certain way, have to face a cold reality that the ones who truly know them, who are closest to them, know whether it's all congruent with their true nature -- or just a way to posture.</p>\n<p>Bah. It is as it always was.</p>\n<p>And it's always the ones you suspect the most.</p>\n<p>Happy Monday!</p>\n<p> </p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-10-20T14:35:32-04:00",
            "date_modified": "2025-10-20T14:55:24-04:00"
        },
        {
            "id": "https://iterating.com/bet/",
            "url": "https://iterating.com/bet/",
            "title": "Bet",
            "summary": "Guys like to gamble. I generalize, but we do. And the&hellip;",
            "content_html": "<p>Guys like to gamble. I generalize, but we do.</p>\n<p>And the most common ways are to bet on yourself, bet on future outcomes, and bet on things to go up (or down).</p>\n<p>Unfortunately, social class only changes the type of wagering people do.</p>\n<p>From the scratch-offs at your local gas station to hedge fund long and shorts, everyone seems to have something they stake money on for the chance of multiplying their input.</p>\n<p>The best kind of wager is something called an asymmetric bet.</p>\n<p>It's usually because you hold an edge in knowledge. And take a relatively small risk for an often exponential potential output.</p>\n<p>But rather than the traditionally proportionately small chance of winning, an asymmetric bet gives you a higher than predicted success rate.</p>\n<p>So, still the same moonshots, but with a greater chance of hitting.</p>\n<p>We all should know the best gambles are those we take in ourselves. We are asymmetric gambles. A little bit of time and attention can yield lifelong rewards.</p>\n<p>I used to be the all in guy. I'd follow Rudyard Kipling's advice. </p>\n<p>But I'm old(er) now. </p>\n<p>No more risking it all on one turn of pitch-and-toss.</p>\n<p>Instead, I look for unbalanced ideas and investments of time and attention. There are so many out there. </p>\n<p>To asymmetric opportunities and outcomes and those who still believe in them.</p>\n<p>Ours is the world.</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-10-19T17:49:26-04:00",
            "date_modified": "2025-10-19T20:05:58-04:00"
        },
        {
            "id": "https://iterating.com/danger-danger/",
            "url": "https://iterating.com/danger-danger/",
            "title": "Danger Danger",
            "summary": "I remember a line that goes something like, you know you&hellip;",
            "content_html": "<p>I remember a line that goes something like, you know you are old when young men no longer find you dangerous.</p>\n<p>You know, spidey senses tingling, tapping their friends to get their attention, and getting out of the way (or getting ready to fight).</p>\n<p>It gets me to think about being older, kinder, gentler.</p>\n<p>I always try to think, even in the most negative of times, \"What does this make possible?\"</p>\n<p>There is strength in appearing weak. </p>\n<p>There is power in being dismissed.</p>\n<p>There is freedom in being unnoticed.</p>\n<p>Too much of my youth was spent trying to be seen. In my own way. But it's true.</p>\n<p>Wisdom teaches you not to feed the wild animals, otherwise, they follow you home.</p>\n<p>Keyboards and warriors.</p>\n<p>Look out!</p>\n<p> </p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-10-18T13:47:32-04:00",
            "date_modified": "2025-10-18T13:58:16-04:00"
        },
        {
            "id": "https://iterating.com/its-a-good-deal/",
            "url": "https://iterating.com/its-a-good-deal/",
            "title": "It&#x27;s A Good Deal",
            "summary": "You tired of all the bad news? Here is some good.",
            "content_html": "<p>You tired of all the bad news?</p>\n<p>Here is some good.</p>\n<p>I admit it, I used to love buying the latest tech. </p>\n<p>And best usually means expensive.</p>\n<p>Cheap tech used to suck.</p>\n<p>But is that changing/changed?</p>\n<p>You can find incredible stuff now that's a downright bargain, especially in electronics. </p>\n<p>Heck, if you can wait, buying older but still viable tech is a downright steal.</p>\n<p>And you know, I love me a good deal.</p>\n<p>There's lots of companies in the tech space producing excellent products and services for a wonderful price.</p>\n<p>The floor is rising on quality and performance. But the price is staying (relatively) in the basement. </p>\n<p>Where else can you say that?</p>\n<p>And when does good and budget beat best and pricy?</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-10-17T18:06:26-04:00",
            "date_modified": "2025-10-17T18:39:28-04:00"
        },
        {
            "id": "https://iterating.com/caged-or-free/",
            "url": "https://iterating.com/caged-or-free/",
            "title": "White Shoes and Black Gloves",
            "summary": "I remember once, chatting with an old school litigator from a&hellip;",
            "content_html": "<p>I remember once, chatting with an old school litigator from a big firm, when we were on a break. And the topic came up that I was into mixed martial arts, training Muay Thai and whatever. And this old lion shared that he represented one of the most famous fighters in the all the land. </p>\n<p>Surprised, I asked him the only thing I could think to ask. \"Is he a good guy?\"</p>\n<p>And what he said next stuck with me for the rest of my life. He thought for a moment, smiled, and said, \"Alex, he is either the smartest man I have ever met, or the dumbest.\"</p>\n<p>And I rolled.</p>\n<p>What an answer.</p>\n<p>I've asked a million questions in my life. Hope to ask a million more. And yet I've never heard an answer quite like it. And I don't think I ever will.</p>\n<p>It spoke a lot of the old lion to give the guy the benefit of the doubt, kinda like we used to say crazy like a fox. Maybe there's a glimmer of shrewdness in someone's blank stare.</p>\n<p>Or maybe, they just took too many to the golden dome.</p>\n<p>To lions and foxes. Caged or free.</p>\n<p> </p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-10-16T15:06:39-04:00",
            "date_modified": "2025-10-18T14:21:24-04:00"
        },
        {
            "id": "https://iterating.com/saxy/",
            "url": "https://iterating.com/saxy/",
            "title": "Saxy",
            "summary": "There's something about live music. Say what you want about studio&hellip;",
            "content_html": "<p>There's something about live music.</p>\n<p>Say what you want about studio albums, but for me, all the juice is in live performances.</p>\n<p>I'm not saying you have to be there, in person, especially since I'm writing to you from a digital stage.</p>\n<p>Live albums, with their slight to major differences from the studio version, make it or break it for me.</p>\n<p>And as an 80s kid, I love me some saxophone solos. Especially the minutes long versions that can only really play in a live album.</p>\n<p>It's harder and harder to find a good sax solo. If only there was a way to have access to an entire historical archive of music, live and studio.</p>\n<p>Oh right.</p>\n<p>Music is a time machine. But it doesn't always have to go back. I think, though, it's the closest we can get to our past.</p>\n<p>Nostalgic notes. Liner notes. Mixtapes. Burnt CDs. Live bootlegs. Road trips.</p>\n<p>So saxy.</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-10-15T17:47:20-04:00",
            "date_modified": "2025-10-15T17:57:24-04:00"
        },
        {
            "id": "https://iterating.com/alphanumeric/",
            "url": "https://iterating.com/alphanumeric/",
            "title": "Alphanumeric",
            "summary": "In the world I come from, nicknames are bestowed upon you.",
            "content_html": "<p>In the world I come from, nicknames are bestowed upon you. You can never give yourself a nickname. You have to earn it, good or bad.</p>\n<p>And I got a problem with that.</p>\n<p>I mean, we come into this world pre-named already.</p>\n<p>Why can't we name ourselves?</p>\n<p>Who makes these dang rules we live by?</p>\n<p>So, anyways, that's what I do from time to time. Rename myself. </p>\n<p>Try out new nicknames.</p>\n<p>And while we're at it. Call 'em by your first name-names. Alnames. Try out new Alnames. Why does Nick get all the glory?</p>\n<p>These are silly things on the surface, but deep down, underneath, what we call ourselves, what we want to be called, what we are named (how many commas can I put in a sentence?), means everything.</p>\n<p>AL8X</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-10-14T14:16:35-04:00",
            "date_modified": "2025-10-14T14:26:15-04:00"
        },
        {
            "id": "https://iterating.com/who-the/",
            "url": "https://iterating.com/who-the/",
            "title": "Who The?",
            "summary": "There's no greater (I'm sure there is, but this is how&hellip;",
            "content_html": "<p>There's no greater (I'm sure there is, but this is how I talk) sign you're getting old than when you don't recognize someone who is now famous.</p>\n<p>Who's that? Huh? </p>\n<p>I'm getting that a lot now in my brain. </p>\n<p>I couldn't tell you a star from an ad. Has it always been just marketing budget?</p>\n<p>The boy bands from my youth all had music videos where hired flocks of girls ran after them. This was before they actually were famous. After the video? Girls actually did run after them. But only after seeing others do it on the video. Monkey see.</p>\n<p>Do you see that now? Anywhere?</p>\n<p>Is it, and has it always been, all about marketing?</p>\n<p>The line between scams and gurus seems blurred. Razor, razor, thin at its widest.</p>\n<p>You know: The get rich quick folks whose plan is really getting you to pay them (and fast!).</p>\n<p>It's get rich quick <em>for them</em>. The supercars are leased, btw. The mansion, rented.</p>\n<p>I don't know who's famous these days.</p>\n<p>Everybody is suspect at best.</p>\n<p>Yeah, I'm getting old.</p>\n<p>Oh, and be careful with that social media. It ain't never been social.</p>\n<p>Just media.</p>\n<p> </p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-10-13T15:17:56-04:00",
            "date_modified": "2025-10-13T15:17:56-04:00"
        },
        {
            "id": "https://iterating.com/i-been-here-for-years/",
            "url": "https://iterating.com/i-been-here-for-years/",
            "title": "I Been Here For Years",
            "summary": "Ever heard of Kintsugi? It's popping up more and more lately.",
            "content_html": "<p>Ever heard of Kintsugi?</p>\n<p>It's popping up more and more lately. It's a Japanese thing. Where they take broken pottery and repair it using precious metals, like gold.</p>\n<p>The idea is that rather than fixing it and hiding the repairs and making it look new again, you highlight the flaws and turn them into the focal point. Beauty in the once broken.</p>\n<p>You treat the damage and its solution as part of the pottery's story. Hurt and heal.</p>\n<p>As you might expect, this has become a popular idea for life and business.</p>\n<p>Taking your scars and showing them off. Letting it shine as part of your story. Everyone breaks. Some of us build back stronger than ever.</p>\n<p>Nobody likes a story where a guy starts out perfect and stays perfect.</p>\n<p>Everybody loves comebacks, kid.</p>\n<p>But don't call it that.</p>\n<p>You been here for years.</p>\n<p>To the beautifully broken.</p>\n<p>And golden scars.</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-10-12T20:21:15-04:00",
            "date_modified": "2025-10-12T20:25:37-04:00"
        }
    ]
}
