{
    "version": "https://jsonfeed.org/version/1",
    "title": "Iterating",
    "description": "",
    "home_page_url": "https://iterating.com",
    "feed_url": "https://iterating.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "𖤂"
    },
    "items": [
        {
            "id": "https://iterating.com/malls-in-the-matrix/",
            "url": "https://iterating.com/malls-in-the-matrix/",
            "title": "Malls in the Matrix",
            "summary": "Malls are changing. I would say dying, but I don't think&hellip;",
            "content_html": "<p>Malls are changing.</p>\n<p>I would say dying, but I don't think they are.</p>\n<p>They are changing.</p>\n<p>Evolving.</p>\n<p>Iterating.</p>\n<p>I remember marveling at the amount of choices one had to shop in a mall.</p>\n<p>I didn't realize how curated all these places actually were, how narrow the options, but it was cool to see way more than one store.</p>\n<p>Now, malls are being repurposed.</p>\n<p>Multi-use. </p>\n<p>I think it would be interesting if a company bought out an old mall and turned it into a business where their employees lived there as well. Like a campus.</p>\n<p>Or a prison.</p>\n<p>Of course, this isn't necessarily a happy idea, but some might be happy for it.</p>\n<p>What I'm getting at here is what about the internet malls?</p>\n<p>Right now, we are past the ooh and ahh stage of having a digital mall where we can shop at almost any store in the world.</p>\n<p>There are too many choices, even though most of ours are still highly curated.</p>\n<p>Will the internet shopping mall pass?</p>\n<p>Or will it change?</p>\n<p>Adapt.</p>\n<p>Iterate.</p>\n<p>I'm still waiting for ai to start suggesting a product (\"link provided\") whenever I ask it something even tangentially related.</p>\n<p>That's part of this, I think. Ai shopping. Ai ads. Ai malls.</p>\n<p>Ads on search browsers shifting to ads on ai prompts.</p>\n<p>I know, I know.</p>\n<p>But it's coming.</p>\n<p>\"This prompt answer brought to you by...\"</p>\n<p>Yuck.</p>\n<p>It did turn Google into a monster. I wonder if it will do so for an ai company.</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-01-03T13:01:04-05:00",
            "date_modified": "2026-01-03T13:05:33-05:00"
        },
        {
            "id": "https://iterating.com/high-low-there/",
            "url": "https://iterating.com/high-low-there/",
            "title": "High Low There",
            "summary": "I had to write again. Can't start 2026 like an absurd&hellip;",
            "content_html": "<p>I had to write again.</p>\n<p>Can't start 2026 like an absurd person would.</p>\n<p>That was <em>so</em> 2025.</p>\n<p>Listen, I got a question:</p>\n<p>Do you have to get really low to get really high?</p>\n<p>I mean to know what high truly means.</p>\n<p>Do you have to be poor to appreciate being wealthy?</p>\n<p>Do you have to have your heart broken to treasure and enjoy real love?</p>\n<p>I mean, to value it as you should:</p>\n<p>Priceless. </p>\n<p>If you were born rich, you tend to stay it, and take it for granted.</p>\n<p>You wouldn't fully understand its literal value unless you lost it.</p>\n<p>Same with love, I think, an always in love, never broken, heart. Seems like that kind of heart would break others' hearts.</p>\n<p>You don't appreciate the unlimited power of love until it breaks you or someone close to you.</p>\n<p>The more I wrestle with it, the more I am learning that our point of view, our perspective, might be one of the only truly unique things we have.</p>\n<p>We all own a unique, one of one, perspective. A set of lenses through which we live.</p>\n<p>And as similar as some people may appear, you'll find stark differences the further you zoom in.</p>\n<p>So the challenge, then, should you choose to accept it is:</p>\n<p>Learn from your singular perspective and the infinite of others.</p>\n<p>Why do you (and they) see the world the way you (and they [<em>this is the last time I will do the \"and they\" thing so just put it after every \"you\" following</em>]) do?</p>\n<p>How do you define wealth? Is it good or evil? And why?</p>\n<p>How do you define love? Is it good or evil? Do you still believe in it? And why?</p>\n<p>How do you define yourself? Are you good or evil? Do you still believe in you? And why?</p>\n<p>And, perhaps most importantly, how do you define God? Is God benevolent or malevolent? Did you ever, or do you still, believe? And why?</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-01-02T17:04:51-05:00",
            "date_modified": "2026-01-02T23:07:41-05:00"
        },
        {
            "id": "https://iterating.com/mmxxvi/",
            "url": "https://iterating.com/mmxxvi/",
            "title": "MMXXVI",
            "summary": "Two Ms. Two Xs. A V and an I. That spells&hellip;",
            "content_html": "<p>Two Ms. Two Xs. A V and an I.</p>\n<p>That spells Ememexexveeeeye.</p>\n<p>Or something.</p>\n<p>Rolls off the tongue, don't it?</p>\n<p>Apparently, these are numerals but they look like capital letters if you ask me.</p>\n<p>I am partial to LX, though.</p>\n<p>60. And kinda, sorta, my name.</p>\n<p>LX is the new XXIX (was going to say 30, but yeah), so I hear.</p>\n<p>When in Rome...</p>\n<p>Get ready, people.</p>\n<p>Things will start out fast and hot.</p>\n<p>I can feel it in my vibes.</p>\n<p>May your Ememexexveeeeye be better than your Ememexexveee.</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-01-02T14:51:19-05:00",
            "date_modified": "2026-01-02T15:02:12-05:00"
        },
        {
            "id": "https://iterating.com/party-horn/",
            "url": "https://iterating.com/party-horn/",
            "title": "Party Horn",
            "summary": "Well, hey. Long time. What's it been, a year? Guffaw. I&hellip;",
            "content_html": "<p>Well, hey.</p>\n<p>Long time.</p>\n<p>What's it been, a year?</p>\n<p><em>Guffaw.</em></p>\n<p>I so funny.</p>\n<p><em>Guffaws again.</em></p>\n<p>Give me a second here.</p>\n<p>Ok.</p>\n<p>Man, I'm good.</p>\n<p>So witty.</p>\n<p>So this is my way of starting the new year on this here daily journal thing.</p>\n<p>If you're new here, I ramble. Rant. Reason. Revere.</p>\n<p>Mostly, this is my mental playground. </p>\n<p>Where I get to flip around and jump and flow my brain and finger muscles.</p>\n<p>I'd love for you to join me.</p>\n<p>Actually, I couldn't care less if you did, it just seems like people say that.</p>\n<p>Ooooooooh, honorable reader, will you join my journey, please?</p>\n<p>[Farts slowly, loudly, still going...you wonder \"How does he do that?\" The author, staring at you the whole time, never breaks eye contact. It is almost melodic. And ends on a high note, which, strangely, delights you. You got a few seconds before the smell hits. I would leave.]</p>\n<p> </p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-01-01T11:24:05-05:00",
            "date_modified": "2026-01-01T11:26:06-05:00"
        },
        {
            "id": "https://iterating.com/ramble-old-man-ramble/",
            "url": "https://iterating.com/ramble-old-man-ramble/",
            "title": "Ramble, Old Man, Ramble",
            "summary": "Only been writing again for the last couple of months, but&hellip;",
            "content_html": "<p>Only been writing again for the last couple of months, but it feels like a longer time.</p>\n<p>I've been blessed (cursed?) with the ability to stop things I loved doing without missing it much.</p>\n<p>I used to define myself by how much I could lift off my chest or over my head.</p>\n<p>Always a spiritual sort, I prayed to heavy metal listening to heavy metal.</p>\n<p>Found God there (and in a Muay Thai gym).</p>\n<p>But I don't do it anymore.</p>\n<p>Or at least for now I don't.</p>\n<p>And I don't miss it (much).</p>\n<p>You'd think I would, because it was a really big part of me, a big part of how I defined myself.</p>\n<p>And that's how I kind of feel about writing.</p>\n<p>I have written my entire life.</p>\n<p>Have always loved the written word.</p>\n<p>For a long time, I couldn't read or write anymore.</p>\n<p>And that sucked. More than the not lifting thing. Which shocks me, writing that truth.</p>\n<p>I started listening to stories and watching them.</p>\n<p>And that helped, a lot, but it did not replace writing.</p>\n<p>And so, all of that to just say, I'm very thankful to be able to type away again. To meander in my brain and pluck what I find and place it down on digital paper.</p>\n<p>To ramble again, if no longer to rumble.</p>\n<p>Rumbling is a young man's game.</p>\n<p>Writing can be an old man's.</p>\n<p>Something to look forward to (no old man here).</p>\n<p>This might come across as sort of a down thing, but it's not. </p>\n<p>It's the exact opposite.</p>\n<p>An up thing.</p>\n<p>I'm writing again.</p>\n<p>Wrote everyday here since early October.</p>\n<p>I'm back, baby!</p>\n<p>Or, at least, I am <em>here</em>.</p>\n<p>I still get things off my chest, just now in a different form.</p>\n<p><em>Lightweight, easy, easy</em>.</p>\n<p>What an interesting timeline.</p>\n<p>To the last day of a good year.</p>\n<p>Happy.</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2025-12-31T11:29:20-05:00",
            "date_modified": "2025-12-31T12:07:16-05:00"
        },
        {
            "id": "https://iterating.com/seconds-to-last/",
            "url": "https://iterating.com/seconds-to-last/",
            "title": "Seconds To Last",
            "summary": "I have always liked that word, \"penultimate.\" Last but one. Second&hellip;",
            "content_html": "<p>I have always liked that word, \"penultimate.\"</p>\n<p>Last but one.</p>\n<p>Second to last.</p>\n<p>The one right before the one before.</p>\n<p>Pen...ultimate!</p>\n<p>What a cool way to say almost last.</p>\n<p>So here we are writing about penultimates.</p>\n<p>How goes things?</p>\n<p>You good?</p>\n<p>You might think my asking about you is just a delay tactic.</p>\n<p>A way to avoid writing anything of substance.</p>\n<p>And to that I say, \"How dare you!?\"</p>\n<p>You're right of course, but feigned outrage is my way to counter most things.</p>\n<p>I got nothing to say, man. I'm still here.</p>\n<p>I still believe in magic.</p>\n<p>I know how the trick is done.</p>\n<p>I know it by heart.</p>\n<p>But I still believe in magic.</p>\n<p>Watch this day vanish.</p>\n<p>Poof!</p>\n<p><em>How'd he do that?</em></p>\n<p>And then the next one!</p>\n<p>Poof!</p>\n<p><em>Woah!</em></p>\n<p>The whole year gone!</p>\n<p>The trick is making the seconds last, even on the second to last.</p>\n<p><em>POOF!</em></p>\n<p>[The author vanishes in a puff of smoke, caused by a smoke machine which incidentally pumps out dance music from the 90s. Resulting in a dramatic, but not in the way he envisioned, end scene.]</p>\n<blockquote>\n<p>♫ Is this some Reebok or some Nike? ♫</p>\n</blockquote>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2025-12-30T12:45:26-05:00",
            "date_modified": "2025-12-30T12:50:18-05:00"
        },
        {
            "id": "https://iterating.com/slingshots-slingshots-slingshots/",
            "url": "https://iterating.com/slingshots-slingshots-slingshots/",
            "title": "Slingshots Slingshots Slingshots",
            "summary": "One of the reasons I like to try new things is&hellip;",
            "content_html": "<p>One of the reasons I like to try new things is because after a while, things can start sounding like an echo chamber.</p>\n<p>You hear the same things over and over.</p>\n<p>The same stuff said in a different way.</p>\n<p>Groups agreeing with one another on everything and everyone.</p>\n<p>And any ideas to the contrary are disregarded at best.</p>\n<p>For me, I could agree with you vehemently on something, but if you keep pounding the idea home, I start to see the contrary views. </p>\n<p>Your certainty makes me doubt.</p>\n<p>So I stay away from fanatics. </p>\n<p>On all sides.</p>\n<p>Or, perhaps better said, keep them at a distance.</p>\n<p>Some of my favorite ideas are led by people who basically say:</p>\n<p>If you don't get it, you're just a moron.</p>\n<p>Which, you should know by now, I understand.</p>\n<p>Maybe it's the smugness.</p>\n<p>Maybe that's why my brain goes, \"Well, maybe there is another view here.\"</p>\n<p>I always liked a well-written dissent over the more popular majority opinion.</p>\n<blockquote>\n<p>\"How are you liking the company?\"</p>\n<p>\"Well, this company feels like a Goliath. And I have always been a David guy.\"</p>\n</blockquote>\n<p>And maybe that's it.</p>\n<p>Maybe if a room feels like it's full of drooling, nodding, giants, I instinctively grab my rounds.</p>\n<p>Has the art of cordial disagreement faded away?</p>\n<p>Agree to disagree?</p>\n<p>Do professors still give out their best grades to students who disagree with their point of view, but do so so articulately and well-reasoned that it deserves a top grade?</p>\n<p>My concern is it seems the world is flocking more and more into these silos of safety.</p>\n<p>Where everyone in this silo has to think a certain way.</p>\n<p>They all say the same things, believe the same things, and if you do not, well then, please see yourself out.</p>\n<p>I am proud to say I have very few people I would call true friends. And believe it or not, some of them disagree with me. I know, I know, impossible, you say.</p>\n<p>But it's true. They have their own ideas. Their own guidelines. And when I need to hear another side to an angle I am considering, I go there first.</p>\n<p>Break this argument.</p>\n<p>Shatter it.</p>\n<p>What am I missing?</p>\n<p>Don't echo.</p>\n<p>Counter.</p>\n<p>Left jab?</p>\n<p>Right straight.</p>\n<p>Left headkick?</p>\n<p>Right legkick.</p>\n<p>Get out of them chambers that have endless mirrors.</p>\n<p>Who wants a million versions of themselves looking back at them?</p>\n<p><em>Woah, cool.</em></p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2025-12-29T14:25:20-05:00",
            "date_modified": "2025-12-29T19:03:25-05:00"
        },
        {
            "id": "https://iterating.com/fetch/",
            "url": "https://iterating.com/fetch/",
            "title": "Fetch",
            "summary": "One of the things I have always tried to distill is&hellip;",
            "content_html": "<p>One of the things I have always tried to distill is this idea of success.</p>\n<p>What is it?</p>\n<p>How do you measure it?</p>\n<p>How will you know when you are \"successful?\"</p>\n<p>I mean, does a bell chime or does some little guy dressed as an elf dance at your side when it happens?</p>\n<p>I think too many of us measure success by net worth.</p>\n<p>And I suppose that's one way to do it.</p>\n<p>I grew up with a terrible sense of money.</p>\n<p>Didn't have much, didn't need much.</p>\n<p>Maybe that's not so terrible.</p>\n<p>But what I'm getting at is can you be a great family man <em>and</em> succeed in business?</p>\n<p>Who's done that?</p>\n<p>And who gets to measure whether you are successful or not?</p>\n<p>You, your portfolio, or your family?</p>\n<p>And what about your soul, your fortitude, your honor? </p>\n<p>Does that matter in the \"success\" formula?</p>\n<p>I mean, ain't that the most important stick?</p>\n<p>What I'm getting at is:</p>\n<p>Did you have a good year?</p>\n<p>And no matter your answer, how are you defining it?</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2025-12-28T12:52:35-05:00",
            "date_modified": "2025-12-28T12:52:35-05:00"
        },
        {
            "id": "https://iterating.com/everyday-we-shuffling/",
            "url": "https://iterating.com/everyday-we-shuffling/",
            "title": "Everyday We Shuffling",
            "summary": "Again, I sit down to write without an idea about what&hellip;",
            "content_html": "<p>Again, I sit down to write without an idea about what to say.</p>\n<p>I mean, I got a lot of ideas, but I am holding back on most things.</p>\n<p>Some things do not belong on a blog.</p>\n<p>But here I am.</p>\n<p>So let's get to writing.</p>\n<p>First of all, the word \"blog\" is terrible.</p>\n<p>It stinks.</p>\n<p>It's like the word, \"brand.\" </p>\n<p>Yuck.</p>\n<p>But yeah, I do both.</p>\n<p>I suppose.</p>\n<p>In my own anti-way.</p>\n<p>Do it by not doing it right.</p>\n<p>Or [waves hands] doing it different.</p>\n<p>I'm yelling at people who cut in lines again.</p>\n<p>I suppose that's something.</p>\n<p>\"Line starts back here, boys!\"</p>\n<p>That is kind of funny to me.</p>\n<p>And then no-selling the \"Oh, sorry\" response.</p>\n<p>Like I've moved on entirely.</p>\n<p>Which I have.</p>\n<p><em>Who is apologizing to me? And for what?</em></p>\n<p>Next!</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2025-12-27T13:34:45-05:00",
            "date_modified": "2025-12-27T13:35:55-05:00"
        },
        {
            "id": "https://iterating.com/get-to/",
            "url": "https://iterating.com/get-to/",
            "title": "Get To",
            "summary": "I sit alone in a four cornered room staring at candles.",
            "content_html": "<blockquote>\n<p>I sit alone in a four cornered room staring at candles.</p>\n</blockquote>\n<p>Oh, is this thing on?</p>\n<p>Listen, I hope you had yourself a Merry little Christmas.</p>\n<p>And now, you find yourself getting ready to celebrate the end of the old year and to welcome the new.</p>\n<p>I should wax on and wax off about ends and beginnings.</p>\n<p>But that seems a little too cliche.</p>\n<p>Why on earth would I do that?</p>\n<p>Everyone does that.</p>\n<p>And if you know a little something about me, I don't do what everyone does.</p>\n<p>So here's what I will say.</p>\n<p>Most of them out there are going to be lazy these last few days.</p>\n<p>So there's opportunity in being especially active now.</p>\n<p>While the others are celebrating, it is a great time to put in the work.</p>\n<p>Sure, it's only a couple of days, but maybe you strike gold, while everyone else is drinking it.</p>\n<blockquote>\n<p>Just remember, they can buy anything. But they can't buy backbone. Don't let them forget that.</p>\n</blockquote>\n<p>And I know, I know, this is for like one person out of the millions (thousands, hundreds, dozens, handful) who read this nonsense.</p>\n<p>But yes, this is for <em>you</em>, friend.</p>\n<p>My words have never been for the crowd.</p>\n<p>Just for the ones who can keep their heads.</p>\n<p>I see you, back row, left side. On your feet. Clapping. Hollering. Underlining.</p>\n<p>This is for you.</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2025-12-26T13:20:40-05:00",
            "date_modified": "2025-12-26T13:26:16-05:00"
        }
    ]
}
