{
    "version": "https://jsonfeed.org/version/1",
    "title": "Iterating",
    "description": "",
    "home_page_url": "https://iterating.com",
    "feed_url": "https://iterating.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "AL8X"
    },
    "items": [
        {
            "id": "https://iterating.com/goldilocks-mean/",
            "url": "https://iterating.com/goldilocks-mean/",
            "title": "Goldilocks Mean",
            "summary": "It occurs to me that is is sort of my journal.",
            "content_html": "<p>It occurs to me that is is sort of my journal.</p>\n<p>I would say private journal but it's on the friggin' internet.</p>\n<p>So I won't.</p>\n<p>It's my journal.</p>\n<p>I've written a lot in my life. Always filtered, though.</p>\n<p>This is as close as I have gotten to being \"me\" but it's still heavily colandered.</p>\n<p>I don't want to share everything.</p>\n<p>I think that's the art, right?</p>\n<p>What to share, what not to.</p>\n<p>People seem to trend two ways: They either create a highlight reel or throw a pity party.</p>\n<p>But as a stoic of sorts, I believe in golden means.</p>\n<p>Goldilocks means.</p>\n<p>Not too hot, not too cold. </p>\n<p><em>Juuuuuuust</em> right.</p>\n<p>It's truly the way to go through our life campaign.</p>\n<p>And what is the optimal sliding scale setting?</p>\n<p>70% highlights, 30% rants?</p>\n<p>50/50?</p>\n<p>90/10?</p>\n<p>Bah, data. Always with the data. Numbers cruncher.</p>\n<p>I'm more of a vibe guy.</p>\n<p>Stay gold.</p>\n<p> </p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-11-25T15:56:23-05:00",
            "date_modified": "2025-11-25T16:07:06-05:00"
        },
        {
            "id": "https://iterating.com/intangible/",
            "url": "https://iterating.com/intangible/",
            "title": "(in)Tangible",
            "summary": "I have always lived on the corner of digital and analog.",
            "content_html": "<p>I have always lived on the corner of digital and analog.</p>\n<p>I mean, I love the internet. Always have.</p>\n<p>I love what I can touch, too. Always will.</p>\n<p>It seems we're all that way, now.</p>\n<p>Growing up with BBSes and dial-up modems, the digital realms were left to nerds. And I was one, being Co-SysOp of a local board. It was a niche of a niche, and that made it even better.</p>\n<p>But today, everyone wants to be online. Kids strive to be YouTubers. And you can make a living doing tangible things in an intangible world.</p>\n<p>It's almost fading the other way. The tangible stuff is becoming the niche of a niche.</p>\n<p>\"What's wrong with him?\" Was asked about those who lived on the computer and drove their family nuts by tying up the home line with a modem that screeched violently if they picked it up to make a call.</p>\n<p>Now, \"What's wrong with him?\" is asked about a person who wants to stay off social media and keep a low profile online. Suspect by not wanting to connect.</p>\n<p>The intangible has become too trusted. People used to be so suspicious of whoever they met online. Now, we're butchered like pigs because everyone trusts their little always-online pocket computer and the things it alerts them to.</p>\n<p>Maybe it's the city boy in me, but I don't trust anybody.</p>\n<p>DTA.</p>\n<p>I was writing this to celebrate the mixture of the tangible and intangible.</p>\n<p>I didn't mean to go so gloomy. </p>\n<p>It's interesting because the intangible is now a very, very real part of the world.</p>\n<p>You can get thrown in prison for actions done only in an imaginary world. </p>\n<p>Very tangible consequences from intangible actions.</p>\n<p>All of this to say:</p>\n<p>It's <em>weird</em>, right?</p>\n<p>I can't put my finger on it, but it's just really weird.</p>\n<p>There's no difference now, between digital and analog.</p>\n<p>It's just one big thing.</p>\n<p>And it's only getting bigger.</p>\n<p>This is weird, right?</p>\n<p>I live on the corner of digital and analog, but I repeat myself.</p>\n<p> </p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-11-24T01:41:53-05:00",
            "date_modified": "2025-11-24T01:55:10-05:00"
        },
        {
            "id": "https://iterating.com/thanks-given/",
            "url": "https://iterating.com/thanks-given/",
            "title": "Thanks Given",
            "summary": "I suppose this is as good a week as any to&hellip;",
            "content_html": "<p>I suppose this is as good a week as any to start feeling thankful.</p>\n<p>In the recent past, someone has (over)thanked me for holding the door for them and a grocery store employee went out of their way to thank me for returning a shopping cart.</p>\n<p>Such things are always appreciated, but it makes me wonder, do folks not do this normally?</p>\n<p>We know the answer.</p>\n<p>Bunch of savages in this town.</p>\n<p>I'm no hero, though. No, seriously, sit down. Ok, ok, I'll wait.</p>\n<p>...</p>\n<p>I'm tryptophaning this week.</p>\n<p>Sounds like a Vietnamese influencer.</p>\n<p>Trypto Phan.</p>\n<p>I gotta say, I'm more a fried chicken fellow than a deep-fried turkey man, but this week is an exception.</p>\n<p>Gobble gobble, ya'll.</p>\n<p>For gullets reborn, thanks are given.</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-11-23T20:01:28-05:00",
            "date_modified": "2025-11-23T20:39:20-05:00"
        },
        {
            "id": "https://iterating.com/play-date/",
            "url": "https://iterating.com/play-date/",
            "title": "Play Date",
            "summary": "I'm going to try and put some forethought (aforethought?) into these&hellip;",
            "content_html": "<p>I'm going to try and put some forethought (aforethought?) into these musings.</p>\n<p>Instead of just turning the faucet on and seeing what color flows out.</p>\n<p>I suppose that'd be a good way to do it.</p>\n<p>To prepare.</p>\n<p>But not today, today is Saturday. I'm chilling.</p>\n<p>So this is what you get.</p>\n<p>How are you?</p>\n<p>How are you doing?</p>\n<p>What's new?</p>\n<p>Zzzzzzz.</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-11-22T13:34:00-05:00",
            "date_modified": "2025-11-22T13:34:30-05:00"
        },
        {
            "id": "https://iterating.com/rank/",
            "url": "https://iterating.com/rank/",
            "title": "Rank",
            "summary": "Did you know that we used to score people's intelligence? I&hellip;",
            "content_html": "<p>Did you know that we used to score people's intelligence?</p>\n<p>I mean, we still do for \"geniuses\" and what not. But I'm talking about going the other way. The low way.</p>\n<p>And these ranks had titles like moron, imbecile, and idiot.</p>\n<p>Guess which one was dumbest?</p>\n<p>Idiot.</p>\n<p>An imbecile is a little smarter than an idiot.</p>\n<p>And a moron is King of the Stupid.</p>\n<p>So, calling someone a moron isn't as bad as it sounds.</p>\n<p>You're actually paying them a compliment.</p>\n<p>If they're an imbecile or an idiot.</p>\n<p>Class dismissed.</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-11-21T14:35:28-05:00",
            "date_modified": "2025-11-21T14:35:28-05:00"
        },
        {
            "id": "https://iterating.com/sip-the-juice/",
            "url": "https://iterating.com/sip-the-juice/",
            "title": "Sip the Juice",
            "summary": "My brain is starting to unfog. This writing every day thing&hellip;",
            "content_html": "<p>My brain is starting to unfog.</p>\n<p>This writing every day thing is helping me rewire.</p>\n<p>Unclogging the conduction wire.</p>\n<p>Letting more juice flow.</p>\n<p>Not to say that I wasn't flowing before, but I wasn't flowing before.</p>\n<p>Time is so interesting. </p>\n<p>Living in a bad way felt numb. Like I wasn't in my skin. Just an observer.</p>\n<p>My eyes didn't feel like my own.</p>\n<p>It felt like forever. </p>\n<p>But it's slowly and largely faded.</p>\n<p>So staggeringly thankful.</p>\n<p>I don't know if I'm just used to a new normal, a new avatar, but I am starting to understand.</p>\n<p>I am just happy to be here.</p>\n<p>An honor to be nominated.</p>\n<p>Writing to myself.</p>\n<p>To my loved ones.</p>\n<p>And to strangers (how'd you get in here?).</p>\n<p>The thing I'm focusing on now is energy. </p>\n<p>The inner fuel tank.</p>\n<p>I get about as terrible a gas mileage as my body-on-frame SUVs.</p>\n<p>But I love 'em.</p>\n<p>I'm not saying I want to be a Tesla or some hybrid, just want some more juice when I stomp.</p>\n<p>Here's the thing I'm learning, though:</p>\n<p>There was a time when I had to use my juice on just keeping myself above ground.</p>\n<p>So I conserved it. Hoarded it. Let it stock up, even as it diminished.</p>\n<p>But it is only by using it that the capacity regrows.</p>\n<p>Muscle memory applying to all sorts of circuitry.</p>\n<p>How much fuel do I got left?</p>\n<p>I got enough to go around.</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-11-20T17:38:06-05:00",
            "date_modified": "2025-11-20T18:01:12-05:00"
        },
        {
            "id": "https://iterating.com/diamond-hands-and-crystal-balls/",
            "url": "https://iterating.com/diamond-hands-and-crystal-balls/",
            "title": "Diamond Hands and Crystal Balls",
            "summary": "I see these gurus everywhere. They were shilling crypto a few&hellip;",
            "content_html": "<p>I see these gurus everywhere.</p>\n<p>They were shilling crypto a few years ago.</p>\n<p>Then, they switched to NFTs.</p>\n<p>Shouting \"generational wealth!\" </p>\n<p>Which seems like a weird thing to shout when you're talking about jpegs.</p>\n<p>Now, they're all in on AI, AGI, SI, etc.</p>\n<p>Although it's starting to see some cracks, there, too.</p>\n<p>If you're a guru, you got to keep hawking what's hot and jump to the next big thing.</p>\n<p>And what is that?</p>\n<p>I'm betting quantum.</p>\n<p>You'll see it everywhere.</p>\n<p>Computing, mechanics, physics.</p>\n<p>We are living in such a strange time.</p>\n<p>The things that happen at the quantum level, should you look into it, is stranger than any fiction, but it is as close to \"fact\" as anything is determined to be so today.</p>\n<p>I'm no guru.</p>\n<p>Just an old(ish) man.</p>\n<p>But I can see things, even if they are a little blurrier than they were before.</p>\n<p>Generational wealth!!!</p>\n<p>WOOOO!!!</p>\n<p>Spooky.</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-11-19T13:57:02-05:00",
            "date_modified": "2025-11-19T14:13:15-05:00"
        },
        {
            "id": "https://iterating.com/salted/",
            "url": "https://iterating.com/salted/",
            "title": "Salted",
            "summary": "For over a year, I couldn't eat kimchi. This might not&hellip;",
            "content_html": "<p>For over a year, I couldn't eat kimchi.</p>\n<p>This might not matter to you, but to a Korean adult, taking away their kimchi is just cruel.</p>\n<p>It's not like I didn't have it around.</p>\n<p>My family devours it.</p>\n<p>I just went through some ess. And a part of said ess messed up my chew and taste buds.</p>\n<p>And for a long time, it was just meat shakes.</p>\n<p>Literal meat shakes.</p>\n<p>During this time, I made a deal.</p>\n<p>Ok, God, if the terms are I get to live, but I have to give up kimchi, I'll do it.</p>\n<p>It wasn't easy, but I agreed.</p>\n<p>Since that year, within the last year or so, I've been given the gift of taste back. I'm not sure if it's what I've always had or if it differs, but I'm thankful that kimchi tastes <em>GOOOOOOD</em>.</p>\n<p>For every day of my life, for nearly every meal of my life, I've had kimchi.</p>\n<p>Except for a stretch of just a little over a year, when kimchi just didn't sound good. I couldn't eat it if I wanted.</p>\n<p>All of that to say, the things we take for granted, the things we consider essential, may or may not be so.</p>\n<p>I did fine without the kimchi, I mean I lived, but it wasn't as essential as I thought.</p>\n<p>It was just a food.</p>\n<p>So I ask, what is truly essential? What <em>must</em> be?</p>\n<p>What are you believing you <em>have</em> to have in your life, that just ain't true?</p>\n<p>And what is truly sacred?</p>\n<p>Truly holy?</p>\n<p>I used to think kimchi was. I mean I still love it. But I went over a year without it.</p>\n<p>It's just a jar of fermentation, like all of us. </p>\n<p>I lost a lot during that season, but nothing I couldn't live without, although I would have been wrong about that if you'd asked me before it all happened.</p>\n<p>The things I considered essential then are no longer so.</p>\n<p>A nice to have. Not a must have. Never was a must have. I just thought that it was.</p>\n<p>There are very, very, very few <em>must</em> haves.</p>\n<p>I'm spending more and more time thinking about that.</p>\n<p>But right now, I <em>get</em> to eat kimchi.</p>\n<p>What a privilege.</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-11-18T12:52:00-05:00",
            "date_modified": "2025-11-18T13:00:16-05:00"
        },
        {
            "id": "https://iterating.com/but/",
            "url": "https://iterating.com/but/",
            "title": "But",
            "summary": "When I was growing up, there was a theory. That a&hellip;",
            "content_html": "<p>When I was growing up, there was a theory.</p>\n<p>That a guy needed his butt whooped to truly be a man.</p>\n<p>His arse need kicked.</p>\n<p>It was just a rite of passage.</p>\n<p>And you could mostly tell, from their actions and/or attitude, whether said kickage had taken place in their lives.</p>\n<p>It, to me, is a measure of character. Of respect.</p>\n<p>There's a lack of respect these days. Particularly self-respect. Self-pride is off the charts. But self-respect is in a recession at best.</p>\n<blockquote>\n<p>That person needs their whoopin'!</p>\n</blockquote>\n<p>I suppose I still say that today.</p>\n<p>As a man of peace, this is more a fleeting thought in a glimmer of flame.</p>\n<p>I don't really say it.</p>\n<p>I'm a pacifist, man. </p>\n<p>Truly.</p>\n<p>Peace. Love. All that ess.</p>\n<p>Next time, though, you see someone acting a fool, remember my wisdom.</p>\n<p>It really eliminates 99% of your outrage.</p>\n<p>Should you have any. </p>\n<p>As a man of peace (have I said that yet?), I have a little (out)rage.</p>\n<p>Yang to my yin, as they say (no one says that). </p>\n<p>Have I told you I'm going for absurd?</p>\n<p>Nailed it.</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-11-17T13:03:12-05:00",
            "date_modified": "2025-11-17T13:03:12-05:00"
        },
        {
            "id": "https://iterating.com/even/",
            "url": "https://iterating.com/even/",
            "title": "Even",
            "summary": "We talk about odds. Like you have a 1 in a&hellip;",
            "content_html": "<p>We talk about odds.</p>\n<p>Like you have a 1 in a 1000 chance to do this.</p>\n<p>Or you have a 1% chance to succeed in that.</p>\n<p>But the reality is, for most people, we only care about the results.</p>\n<p>For example, if you had a 99% likelihood to pass a test, but you fail it, is there any solace in knowing you had such a high probability of passing? No, the only result you care about is your own.</p>\n<p>So to me, I think most things are 50/50.</p>\n<p>They happen or they don't.</p>\n<p>Data is important.</p>\n<p>But I don't care about the odds as it pertains to me.</p>\n<p>It's always binary.</p>\n<p>0.</p>\n<p>1.</p>\n<p>Heads.</p>\n<p>Tails. </p>\n<p>Win.</p>\n<p>Lose.</p>\n<p>Opportunity.</p>\n<p>Cost.</p>\n<p>Live.</p>\n<p>Die.</p>\n<p>To long shots and sure things.</p>\n<p>Same same.</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-11-16T16:42:35-05:00",
            "date_modified": "2025-11-16T17:36:19-05:00"
        }
    ]
}
