{
    "version": "https://jsonfeed.org/version/1",
    "title": "Iterating",
    "description": "",
    "home_page_url": "https://iterating.com",
    "feed_url": "https://iterating.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "𖤂"
    },
    "items": [
        {
            "id": "https://iterating.com/apollos-creed/",
            "url": "https://iterating.com/apollos-creed/",
            "title": "Apollo&#x27;s Creed",
            "summary": "I am an eternal optimist. A stoic one. I believe in&hellip;",
            "content_html": "<p>I am an eternal optimist.</p>\n<p>A stoic one.</p>\n<p>I believe in asking: </p>\n<p>\"What does this make possible?\"</p>\n<p>Sometimes finding a silver lining in a dark cloud more rewarding than a solar flare off a golden sun.</p>\n<p>Does that make sense?</p>\n<p>For every financial win, for most of us, there is a tax.</p>\n<p>For every loss, an accumulation of wisdom.</p>\n<p>The night after the Big Game (ugh), half of the people involved are in misery.</p>\n<p>For many on that side of the ball, this is the closest they will get to winning it all in the game of football.</p>\n<p>Some will see it as a tragedy. But it's not.</p>\n<p>It's just a game.</p>\n<p>The interesting thing about interviewing folks who win the big games, a lot of them are ecstatic. As they should be.</p>\n<p>Elated.</p>\n<p>But the thing I learned is that the superstars, the leaders, they generally aren't.</p>\n<p>They are happy, sure.</p>\n<p>Thankful, certainly.</p>\n<p>But the emotion you hear, over and over again, is a simple one:</p>\n<p>Relief.</p>\n<p>They can exhale, now.</p>\n<p>They can mark this off their to-do list.</p>\n<p>They have done it.</p>\n<p>Now the really crazy ones say, \"On to the next one...\" and get to work.</p>\n<p>But that's a rarity in all already all-too-rare population.</p>\n<p>For you see, there are superstars, there are leaders, and then there are champions.</p>\n<p>I leave it to you as to decide which you look up to, which you aim for, and who you want to be.</p>\n<p>Just promise me, whatever you do, if you own a championship belt, leave it at home.</p>\n<p>Unless of course, you are defending it.</p>\n<p>Oh, and you're always defending it, Champ.</p>\n<blockquote>\n<p>\"You know, Stallion.</p>\n<p>It's too bad we gotta get old.\"</p>\n<p>\"Ahh, just keep punching, Apollo.</p>\n<p>You wanna ring the bell?\"</p>\n<p>\"Alright, ding ding.\"</p>\n</blockquote>\n<p>Keep punching, my friends.</p>\n<p>Keep punching my enemies.</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-02-09T13:29:51-05:00",
            "date_modified": "2026-02-09T13:43:13-05:00"
        },
        {
            "id": "https://iterating.com/tribe-called-quest/",
            "url": "https://iterating.com/tribe-called-quest/",
            "title": "Tribe Called Quest",
            "summary": "Trials and tribulations are rewarded. We should be happy to have&hellip;",
            "content_html": "<p>Trials and tribulations are rewarded.</p>\n<p>We should be happy to have them.</p>\n<p>For they build long lasting strength.</p>\n<p>I would say endurance but I don't like that word.</p>\n<p>Trials and tribulations are, in a strange way, a good thing.</p>\n<p>And ultimately, like all things that matter, they are a test.</p>\n<p>A measurement.</p>\n<p>Of your mettle.</p>\n<p>Of your \"do you have what it takes.\" </p>\n<p>Of you.</p>\n<p>Now there are some trials and tribulations that pulverize you.</p>\n<p>That turn you into powder.</p>\n<p>Dust in the wind.</p>\n<p>And, believe it or not, some people keep going.</p>\n<p>Even after that.</p>\n<p>They turn into pocket sand.</p>\n<p>Ether.</p>\n<p>Essence.</p>\n<p>Eternal.</p>\n<p>I don't know anyone who hasn't gone through it.</p>\n<p>I suppose I'm too old to.</p>\n<p>I used to think that life had to always go up. </p>\n<p>Up and to the right.</p>\n<p>But it doesn't.</p>\n<p>Nor should it.</p>\n<p>If you hit a home run every time you stepped up to the plate, you wouldn't like to hit.</p>\n<p>You wouldn't love it.</p>\n<p>Because it would be too easy.</p>\n<p>Too boring.</p>\n<p>You need to whiff.</p>\n<p>You need to miss.</p>\n<p>You need to fail.</p>\n<p>That's why you love to hit bombs.</p>\n<p>Be wary of those who only share their wins.</p>\n<p>Or only share their losses.</p>\n<p>Just be wary of everyone.</p>\n<p>Sometimes, the best thing to ever happen to you will feel like heartbreak at first.</p>\n<p>And the worst thing might initially feel like elation.</p>\n<p>Only time will tell.</p>\n<p>Only time.</p>\n<p>Happens to us all.</p>\n<p>You on point?</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-02-08T17:29:51-05:00",
            "date_modified": "2026-02-08T17:36:48-05:00"
        },
        {
            "id": "https://iterating.com/clear-eyes-full-belly/",
            "url": "https://iterating.com/clear-eyes-full-belly/",
            "title": "Clear Eyes, Full Belly",
            "summary": "Full stomach. Less sleep. Blinking cursor. Staring back. Wooh boy. Got&hellip;",
            "content_html": "<p>Full stomach. </p>\n<p>Less sleep.</p>\n<p>Blinking cursor.</p>\n<p>Staring back.</p>\n<p>Wooh boy.</p>\n<p>Got my work cut out for me.</p>\n<p>Of course I kid.</p>\n<p>This sheet easy.</p>\n<p>I just like to play the disgruntled guy.</p>\n<p>Ornery.</p>\n<p>It makes me smile.</p>\n<p>For you see, even in a musings column, I got to play a part.</p>\n<p>It's me writing, but only the me I want you to see.</p>\n<p>And I'm not advertising this stuff, but it does feel a bit public and a bit private at the same time.</p>\n<p>So I do a little jig.</p>\n<p>Dancin' around ideas.</p>\n<p>Boppin' around musings.</p>\n<p>Stalling through giving you more imagery about me dancin'.</p>\n<p>But I got a point to make, and it ain't on the top of your head!</p>\n<p><em>Tee hee.</em></p>\n<p>Old insults are the best.</p>\n<p>Listen, I want you to know something about me.</p>\n<p>I don't forgive.</p>\n<p>I forget.</p>\n<p>Forgive me, what's your name...</p>\n<p>Next!</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-02-07T14:29:01-05:00",
            "date_modified": "2026-02-07T15:00:43-05:00"
        },
        {
            "id": "https://iterating.com/easy-mode/",
            "url": "https://iterating.com/easy-mode/",
            "title": "Easy Mode",
            "summary": "Some days, I do not have the time to write. Or&hellip;",
            "content_html": "<p>Some days, I do not have the time to write.</p>\n<p>Or at least, the window.</p>\n<p>Is today one of those days?</p>\n<p>Every hard day these days is not so hard. </p>\n<p>At least compared to an old hard day.</p>\n<p>I consider any new hard days a blessing, now.</p>\n<p>Perhaps I always should have.</p>\n<p>Call it enlightenment.</p>\n<p>Wisdom.</p>\n<p>Old age.</p>\n<p>Second chances.</p>\n<p>Perspective is a heck of a thing.</p>\n<p>And compared to a hard day back then, these hard days are blessings.</p>\n<p>Every hard day teaches me, reminds me, that this is part of why I survived.</p>\n<p>Why I survive.</p>\n<p>I know that might not make sense, but it does for me.</p>\n<p>And it gives me peace.</p>\n<p>I know that the road ahead will have its hard days.</p>\n<p>And I'm so very thankful, I get to be here for them.</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-02-06T18:28:12-05:00",
            "date_modified": "2026-02-06T18:38:08-05:00"
        },
        {
            "id": "https://iterating.com/false-profits/",
            "url": "https://iterating.com/false-profits/",
            "title": "False Profits",
            "summary": "Let's think about who we listen to. Who we follow. Who&hellip;",
            "content_html": "<p>Let's think about who we listen to.</p>\n<p>Who we follow.</p>\n<p>Who we believe in.</p>\n<p>And I bet you, if you have racked up some years, that the people you look towards for advice and leadership have a life you wouldn't want to trade for.</p>\n<p>And that what you perceive as a \"better\" or more \"successful\" life is that they have more money than you do.</p>\n<p>Never mind their familial turmoil. </p>\n<p>The fact that they are puppeteered by a handful of handlers who really run things.</p>\n<p>And the true cost of their sacrifices to \"make\" it.</p>\n<p>I'd also like to think that today, with all its ups and downs of having so much information at our fingertips, it's becoming more and more obvious that there are many cracks in wearing the armor of the rich and famous.</p>\n<p>And so, what I'd like to leave you with today is the idea that we try and find folks out there to lead us who do have a life worth emulating.</p>\n<p>At least in your eyes.</p>\n<p>A life worth aspiring to.</p>\n<p>These people, I've learned, like to keep to themselves.</p>\n<p>\"Who would want to follow me?\"</p>\n<p>Listen to advice from those who you believe have led a life worth listening to. Could even be as a cautionary tale, a what not to do.</p>\n<p>But heeding the advice of someone you would never, ever, want to be like is just madness.</p>\n<p>And I see people doing it everywhere.</p>\n<p>All the time.</p>\n<p>So who has done it the right way?</p>\n<p>Who has lived or lives a life you truly respect, admire, and is one worth emulating?</p>\n<p>What tragedies have befallen them? For every life is peak and valley (and hopefully peak).</p>\n<p>And are their wins worth their losses?</p>\n<p>Charles Barkley once said \"I never listen to financial advice from someone poorer than me.\"</p>\n<p>And I'd follow that up with you shouldn't listen to life advice from someone whose life you wouldn't want. Oof, a double negative.</p>\n<p>Listen to life advice only from those who have a life you consider better than your own.</p>\n<p>If they do not, then take it with a grain of salt, or treat it as a warning sign.</p>\n<p>Oh, and believe it or not, all advice is life advice.</p>\n<p>Ultimately.</p>\n<p>It's all life advice.</p>\n<p>For what will it profit a person if they gain the whole world and lose their soul?</p>\n<p>Hint hint.</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-02-05T11:44:25-05:00",
            "date_modified": "2026-02-05T11:47:12-05:00"
        },
        {
            "id": "https://iterating.com/ah-me/",
            "url": "https://iterating.com/ah-me/",
            "title": "Ah Me",
            "summary": "Would you rather: Live half a life but live to 100?&hellip;",
            "content_html": "<p>Would you rather:</p>\n<p>Live half a life but live to 100?</p>\n<p>Or live twice a life but only to 50?</p>\n<p>I used to think the latter. </p>\n<p>Not even close.</p>\n<p>This was before I started a family.</p>\n<p>Before I had a little girl.</p>\n<p>When I was at my sickest, my wife wanted me to write something for my daughter.</p>\n<p>When we all weren't sure if I'd make it.</p>\n<p>And, if you know anything about me, you should know I wrote a book for my wife and son. But this was all before my little girl came into the world.</p>\n<p>And when you have a son, well that is a dream come true.</p>\n<p>That boy is our spirit.</p>\n<p>But then my daughter appears.</p>\n<p>And she is our soul.</p>\n<p>She completes our family.</p>\n<p>I know now why fathers of daughters wear \"Girl Dad\" branding.</p>\n<p>And so I tried to write something for her.</p>\n<p>Just for her.</p>\n<p>Many times.</p>\n<p>I sit down.</p>\n<p>A goodbye note.</p>\n<p>A letter of love from her dad.</p>\n<p>But I never could.</p>\n<p>It was just too much.</p>\n<p>I pray in the end, if God agrees, that if I can live half a life so that I can live to 100, or at least to watch her grow up, it's a fine deal.</p>\n<p>No question about it.</p>\n<p>To watch them all grow.</p>\n<p>To see them each iterating to their own actualization.</p>\n<p>It's not about me anymore, and I suppose it never has been.</p>\n<p>My letter to my daughter will be in the form of my presence.</p>\n<p>I will <em>be</em> my letter.</p>\n<p>She thinks leaving her is when I go to a different floor of our home.</p>\n<p>This is the extent of how I wish she defines it.</p>\n<p>May she never know that word truly.</p>\n<p>Just that I'm on a different floor.</p>\n<blockquote>\n<p>To the best girl,</p>\n<p>Daddy loves you so much I cannot put it into words.</p>\n<p>I don't have them.</p>\n<p>I will just have to show you.</p>\n<p>For the rest of my life.</p>\n<p>And ever after.</p>\n<p>The Luckiest Father,</p>\n<p>Yours </p>\n</blockquote>\n<p>PS: I am just downstairs, Ahmlette. Typing my musings column. Be right up, love.</p>\n<p>🍳</p>\n<p>𖤂</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-02-04T13:22:23-05:00",
            "date_modified": "2026-02-05T01:06:24-05:00"
        },
        {
            "id": "https://iterating.com/a-wholly-man/",
            "url": "https://iterating.com/a-wholly-man/",
            "title": "A Wholly Man",
            "summary": "Who are you? I mean that in the most literal way.",
            "content_html": "<p>Who are you?</p>\n<p>I mean that in the most literal way.</p>\n<p>Who are you?</p>\n<p>And how do you define yourself?</p>\n<p>Most people would answer the question like I'm asking what their name is.</p>\n<p>And I love names.</p>\n<p>But what I am asking is more:</p>\n<p>What do you represent?</p>\n<p>How do you wish to be defined?</p>\n<p>What should I call you?</p>\n<p>My umma when I was still in her womb had a dream that her baby to be was all growns up and dressed in a black flowing robe. This convinced her I was destined to be a judge.</p>\n<p>And well, I guess I am.</p>\n<p>Got a law degree (in a black robe!).</p>\n<p>Got a law license (in a suit - 🕴- yuck &lt;-- but he's levitating!).</p>\n<p>Got black on right now (no robes though).</p>\n<p>Got a gavel or two.</p>\n<p>I call myself the \"Supreme Court\" but only in my house.</p>\n<p>Only to my kids.</p>\n<p>But we all get a good laugh.</p>\n<p>I should buy a black robe though. </p>\n<p>I think grandmasters wear those.</p>\n<p>Would fit my style.</p>\n<p>So sayeth, The Supreme Court!</p>\n<p>⚖</p>\n<p><em>Judge: A person able or qualified to give an opinion on something.</em></p>\n<p>Umma, you are right, I always been judge!!!</p>\n<p>👨‍⚖️</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-02-03T14:10:07-05:00",
            "date_modified": "2026-02-04T13:09:05-05:00"
        },
        {
            "id": "https://iterating.com/miyagi/",
            "url": "https://iterating.com/miyagi/",
            "title": "Miyagi",
            "summary": "This say you brave: ♥️ This say you lucky: 🎖",
            "content_html": "<p>This say you brave:</p>\n<p>♥️</p>\n<p>This say you lucky:</p>\n<p>🎖</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-02-02T15:27:00-05:00",
            "date_modified": "2026-02-02T19:57:21-05:00"
        },
        {
            "id": "https://iterating.com/always-look-eye/",
            "url": "https://iterating.com/always-look-eye/",
            "title": "Always Look Eye",
            "summary": "There was a book I read years ago. I cannot remember&hellip;",
            "content_html": "<p>There was a book I read years ago.</p>\n<p>I cannot remember the name of the book or its author.</p>\n<p>A shame.</p>\n<p>But I remember it's beginning/preface/intro.</p>\n<p>Whatever you call it.</p>\n<p>There's a little shack in the middle of nowhere.</p>\n<p>And this knock at the door.</p>\n<p>And the old man inside shouts, \"What do you want?\"</p>\n<p>And the knocker politely says, \"Sorry to bother you, but I'm looking for the master.\"</p>\n<p>And the old man retorts, \"There is no master here. Go away.\"</p>\n<p>It's written more eloquently and evocatively than that.</p>\n<p>But the idea always stuck with me.</p>\n<p>How the old man didn't want to open the door.</p>\n<p>How the knocker was searching for wisdom.</p>\n<p>How the old man didn't want to give it.</p>\n<p>And it's sort of a trope.</p>\n<p>Some wisdom is hard won.</p>\n<p>And those who have won it wear it like battle scars.</p>\n<p>Either they share it proudly or hide it securely.</p>\n<p>And those who seek it have to keep trying.</p>\n<p>The old man is a good one, but he's been burned before.</p>\n<p>Many, many times.</p>\n<p>There's a lot of old masters hanging it up, I think.</p>\n<p>Never to be seen again.</p>\n<p>I understand why.</p>\n<p>But it's a little sad.</p>\n<p>So much left to give.</p>\n<p>Nothing left to want to.</p>\n<p>Now go away.</p>\n<p>No old man here.</p>\n<p>Come back tomorrow.</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-02-02T13:02:51-05:00",
            "date_modified": "2026-02-02T13:21:12-05:00"
        },
        {
            "id": "https://iterating.com/press-record/",
            "url": "https://iterating.com/press-record/",
            "title": "Press Record",
            "summary": "I don't think we listen to music enough. At least, I&hellip;",
            "content_html": "<p>I don't think we listen to music enough.</p>\n<p>At least, I don't.</p>\n<p>And, as a music lover, this is going to change.</p>\n<p>We are a long age away from listening to the radio for hours with a blank cassette inside the tape player. Finger hovering over the record button just hoping you catch your favorite song before it starts.</p>\n<p>Cursing silently when the DJ talks over the beginning, but happy you got it nonetheless.</p>\n<p>I must have re-recorded over the tape a hundred times before I got the songs I wanted.</p>\n<p>Today, the price we pay for any song at any time is an ad or two. Maybe a subscription.</p>\n<p>It's a little bit of cash or a little bit of time. </p>\n<p>And as much as I feel a bit torn about it all, I think ai is making some good music.</p>\n<p>Yeah, I said it.</p>\n<p>It follows the formula, and song is formula.</p>\n<p>Take for example the ai song \"New Year, I'm the Same ____\" (1979). I warn you it's got some adult language.</p>\n<p>Sheet rated R.</p>\n<p>But it's got oldies soul vibes with a modern (timeless?) IDGAF mindset.</p>\n<p>So yeah, I'm dancing to music created by software with the push of a few keys.</p>\n<p>No DJs yapping at the beginning to screw things up.</p>\n<p>No vulnerable cassettes eaten up by old, slowly disloyal, boomboxes.</p>\n<p>I'd encourage you to hold an iPhone sideways over your head rocking a Peter Gabriel song, but that just seems silly.</p>\n<p>There's no better time machine than music.</p>\n<p>A rare invention that can take you back, push you forward, and stir you up.</p>\n<p>All at the same time.</p>\n<p>Life is frequency.</p>\n<p>Life is vibe.</p>\n<p>Life is music.</p>\n<p>What's your song?</p>\n<p>💽</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-02-01T17:51:38-05:00",
            "date_modified": "2026-02-01T18:08:21-05:00"
        }
    ]
}
