{
    "version": "https://jsonfeed.org/version/1",
    "title": "Iterating",
    "description": "",
    "home_page_url": "https://iterating.com",
    "feed_url": "https://iterating.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "AL8X"
    },
    "items": [
        {
            "id": "https://iterating.com/imp-patient/",
            "url": "https://iterating.com/imp-patient/",
            "title": "Imp Patient",
            "summary": "For a guy who almost died who still plays the long&hellip;",
            "content_html": "<p>For a guy who almost died who still plays the long game (I think), I'm sort of impatient.</p>\n<p>I mean, I can delay gratification and all that bull mess, but what I mean is that window of time after the deal is done where you are waiting for everything to trickle down and clear.</p>\n<p>The shipping time.</p>\n<p>The transfer time.</p>\n<p>The results of your efforts.</p>\n<p>It's always been that way. </p>\n<p>Studying for the bar exam sucked. Taking the bar sucked. </p>\n<p>But waiting six months for the results?</p>\n<p>Worst of all <em>by far</em>.</p>\n<p>Why? I think it's the <em>out of my control </em>part. The <em>what if</em> part. The <em>not knowing</em> part.</p>\n<p>Give me a bunch of things I can do to prepare and get it done, a mountain of them (please don't), and it'll get done. But once it's fate is in someone else's hands, I suppose that drives me a little crazy.</p>\n<p>What's taking so long?</p>\n<p>Do they need something else?</p>\n<p>Was I unclear?</p>\n<p>There's a snow storm in the rust belt. Is that why its delayed?</p>\n<p>This is a part of young me (Yung Mi?) that I carry today.</p>\n<p>And while I've done enough to discipline that boy over the years, he still shows his face every once in awhile.</p>\n<p>And holidays with its over-promising and under-delivering, well it's enough to make an old man shake his fist in the sky.</p>\n<p>No old men here, though.</p>\n<p>Just hurry up already.</p>\n<p>[Shakes fist at screen.]</p>\n<p>Yung Mi yaaa, get my slippers.</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-12-10T11:48:54-05:00",
            "date_modified": "2025-12-10T11:56:12-05:00"
        },
        {
            "id": "https://iterating.com/wholly/",
            "url": "https://iterating.com/wholly/",
            "title": "Wholly",
            "summary": "Someday, I'm going to write about sacralizing everything. It won't be&hellip;",
            "content_html": "<p>Someday, I'm going to write about sacralizing everything.</p>\n<p>It won't be today, but I'm building up to it.</p>\n<p>In a world where nothing is sacred, we really have it backwards.</p>\n<p>Everything is.</p>\n<p>If we want it to be.</p>\n<p>I'm learning that to see the <em>forever</em> in the <em>fleeting</em> is the key to this whole life thing.</p>\n<p>When you can see God in a sun ray during golden hour.</p>\n<p>When you feel it in your tummy when you see your wife's genuine smile. Her smize.</p>\n<p>When you hear your children belly laugh at silly jokes.</p>\n<p>These are just lights, grins, and giggles, you say.</p>\n<p>And you'd be right. They are just that.</p>\n<p>But you're also so very, very wrong.</p>\n<p>Both can be true.</p>\n<p>I hope you see that.</p>\n<p>Infinity fits in the palm of your hand.</p>\n<p>Eternity is an hour.</p>\n<p>Everything and nothing.</p>\n<p><em>C'est la vie</em>.</p>\n<p>∞ and 0.</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-12-09T12:35:14-05:00",
            "date_modified": "2025-12-09T12:59:42-05:00"
        },
        {
            "id": "https://iterating.com/aint-it-fun/",
            "url": "https://iterating.com/aint-it-fun/",
            "title": "Ain&#x27;t It Fun",
            "summary": "Are you having fun yet? I sure am. I remember someone&hellip;",
            "content_html": "<p>Are you having fun yet?</p>\n<p>I sure am.</p>\n<p>I remember someone saying if you're bored, you're boring.</p>\n<p>And I take that to heart.</p>\n<p>Bored people are snoozers.</p>\n<p>Peripheral people.</p>\n<p>Background noise.</p>\n<p>I'd make an L with my hand and put it to my forehead but I think that will get me cancelled (much like many of the things we grew up with).</p>\n<p>That's just going too far.</p>\n<p>I think the secret to non-boredom is finding excitement in the mundane.</p>\n<p>Joy in the routine.</p>\n<p>Infinity in the stillness.</p>\n<p>If there's an area that you love that most people would think crazy, I think that's your sweet spot.</p>\n<p>If you hold a view that is 180 degrees opposite of most, you should cultivate that.</p>\n<p>I mean, obey the law, be morally correct, but other than that? </p>\n<p>All bets are off.</p>\n<blockquote>\n<p>\"Don't be boredom, be boresmart!\"</p>\n</blockquote>\n<p>One of these days, one of my sayings will hit.</p>\n<p>It probably won't be that one, but c'mon, <em>c'mon</em>, this is good stuff here.</p>\n<p>[<em>Puts three fingers up and places hand over forehead...holds it there and pauses for a uncomfortably long time. Puts hand down. The author is strangely satisfied and pleased with himself. Grinning (smirking?), he then leaves the room.</em>]</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-12-08T11:59:15-05:00",
            "date_modified": "2025-12-08T12:13:37-05:00"
        },
        {
            "id": "https://iterating.com/pickles/",
            "url": "https://iterating.com/pickles/",
            "title": "Pickles",
            "summary": "\"So you're a dilettante?\" \"I'm a what?\" \"A dabbler, someone who&hellip;",
            "content_html": "<blockquote>\n<p>\"So you're a dilettante?\"</p>\n<p>\"I'm a what?\"</p>\n<p>\"A dabbler, someone who pretends to be an expert but really just knows a little about a lot.\"</p>\n<p>\"Oh. I am not.\"</p>\n</blockquote>\n<p>So, it turns out, I'm a dilettante.</p>\n<p>In a lot of ways.</p>\n<p>I didn't always know what that meant, and I suppose I still really don't.</p>\n<p>I mean, I love a lot of things.</p>\n<p>Interested in a lot of things.</p>\n<p>Some things I dig deeper.</p>\n<p>Most things I dig for a while.</p>\n<p>Some things stay.</p>\n<p>Most things have to go.</p>\n<p>I always respect and admire those who can center and hone in on their one thing.</p>\n<p>Like my buddy who loves to weld. Mothereffer a welder, to the bone.</p>\n<p>But reality is, I like to dabble.</p>\n<p>Call it whatever you want, but I just enjoy learning a little something new.</p>\n<p>And even after all these years, after all I think I know, I continue to find \"new\" areas.</p>\n<p>Now most of these have been around forever, but I never saw them. Even if they highly overlapped the areas I have been interested in for decades.</p>\n<p>To me, that's so neat.</p>\n<p>Bruce Lee said something like how he doesn't fear the man who has practiced 10,000 different techniques once. But rather fears the man who has practiced one kick 10,000 times.</p>\n<p>And that's right. You would fear a dude with one massively overbuilt leg. That ess would be scary.</p>\n<p>But hear me out.</p>\n<p>How would you fare against the man who practiced 10,000 different techniques ten times? A hundred?</p>\n<p>I'm just saying.</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-12-07T12:58:46-05:00",
            "date_modified": "2025-12-07T13:06:45-05:00"
        },
        {
            "id": "https://iterating.com/venn/",
            "url": "https://iterating.com/venn/",
            "title": "Venn",
            "summary": "I've always been careful to keep my circles separate. Family friends.",
            "content_html": "<p>I've always been careful to keep my circles separate.</p>\n<p>Family friends. Work friends. School friends. Old school friends. Digital friends.</p>\n<p>Each in their own category. </p>\n<p>Never the two shall mix.</p>\n<p>I don't know why I'd do that.</p>\n<p>In the few times they did actually interact, it felt like some wacky crossover episode had taken place, and I didn't quite know how to act.</p>\n<p>For you see, in each circle, I was a different version of \"me.\"</p>\n<p>I see that now.</p>\n<p>I didn't see it then.</p>\n<p>The reason I didn't overlap the circles was because I didn't know how to be <em>me</em> when they mixed.</p>\n<p>Was I school Alex? Work Alex? OG Alex? Digital Alex?</p>\n<p>Very few have seen me with my hair down, so to speak, and that's probably for the best.</p>\n<p>The point of all this is how so many haven't changed. And how so many have.</p>\n<p>And I don't know which one is better: Those who haven't changed and those who have.</p>\n<p>I know I've changed.</p>\n<p>I still don't venn diagram my life. But there are no separate circles, now. Just one special one.</p>\n<p>I sit in it and pilot it around this vast program called reality. My copilots actively keeping everything running, while I try to keep us on course.</p>\n<p>Every now and again, another circle, past or future, approaches.</p>\n<p>I let them bounce, though.</p>\n<p>They don't get in.</p>\n<p>This is the hermit in me, I know.</p>\n<p>But the fella they're looking for is long gone.</p>\n<p>Went to never never land and never came home.</p>\n<p>...Did they leave yet?</p>\n<p>Ok, good.</p>\n<p>I know who I am now.</p>\n<p>I know how to play it.</p>\n<p>I am bubbles clustered together. So many.</p>\n<p>That one day popped into one big bubble.</p>\n<p>I believe in the sanctity of this bubble. </p>\n<p>I <em>sacralize</em> it.</p>\n<p>There is no place in the world I would rather be, than where I am right now. With who I am with right now.</p>\n<p>Floating through the cosmos.</p>\n<p> </p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-12-06T17:28:56-05:00",
            "date_modified": "2025-12-06T17:35:04-05:00"
        },
        {
            "id": "https://iterating.com/better-than-nothing/",
            "url": "https://iterating.com/better-than-nothing/",
            "title": "Better Than Nothing",
            "summary": "They say kids are made out of rubber. Not literally of&hellip;",
            "content_html": "<p>They say kids are made out of rubber. </p>\n<p>Not literally of course.</p>\n<p>More in the way they can bounce back from injury.</p>\n<p>And I see it.</p>\n<p>How fast my kids can heal from a bump or owwie.</p>\n<p>I don't know what adults are made out of, but I marvel at how my body fixes itself.</p>\n<p>It is very cyclical.</p>\n<p>Up days. Down days.</p>\n<p>Flushing out. Feeding in.</p>\n<p>Give. </p>\n<p>Take.</p>\n<p>I want to make something clear.</p>\n<p>I'm thankful for every setback.</p>\n<p>Because it comes with a hidden perk.</p>\n<p>I just have to figure it out.</p>\n<p>The body is a universe onto itself.</p>\n<p>I don't think we think about this enough.</p>\n<p>Sure, bodies are temples, but they're way more than that.</p>\n<p>They're vast. Infinite when you zoom in.</p>\n<p>Full of life, giving you life. The total system working together (sometimes against each other) to keep you running.</p>\n<p>This is not appreciated enough.</p>\n<p>At least by me.</p>\n<p>I'm working on it though.</p>\n<p>You know what's weird?</p>\n<p>Supposedly, we are made up of more nothing than something.</p>\n<p>We are. The world is. Everything in the universe.</p>\n<p>We are more space than substance.</p>\n<p>That ess crazy.</p>\n<p>Don't believe it.</p>\n<p>You're more something than nothing.</p>\n<p>You're all something.</p>\n<p>We just haven't figured out the right way to name the nothing.</p>\n<p>There's probably a centillion nothings that are somethings. </p>\n<p>We just don't know how to delineate between them.</p>\n<p>Or how to see them.</p>\n<p>This is not a very good post. </p>\n<p>Better than nothing.</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-12-05T15:53:42-05:00",
            "date_modified": "2025-12-05T16:00:09-05:00"
        },
        {
            "id": "https://iterating.com/iterating/",
            "url": "https://iterating.com/iterating/",
            "title": "Iterating...",
            "summary": "I'm writing again today. Just to see if I can do&hellip;",
            "content_html": "<p>I'm writing again today. Just to see if I can do it.</p>\n<p>I wonder how sustainable it is to just type by feel. </p>\n<p>Don't get me wrong, I can still see. I'm fine.</p>\n<p>It's just typing on my computer has suddenly turned... off.</p>\n<p>I think I have sensitivity to certain screens. Too much flashing/refreshing/wa wah.</p>\n<p>As someone who loves tech, this is a bit of a bummer. But I'm going to roll with it. I'm in no shape to complain. I just will figure a work around.</p>\n<p>Closing my eyes to type is the first workaround.</p>\n<p>Writing by feel.</p>\n<p>I've been a bit under the weather so that's probably the reason.</p>\n<p>Who knows.</p>\n<p>What I know is that this writing thing is wired into my OS and I'm not going to stop over some vision thing.</p>\n<p>I wish I had something more to say it's just not going to happen until I get into a groove with this eyes closed typing thing.</p>\n<p>Living up to this site's domain name.</p>\n<p>Hypothesis. Testing. Receiving feedback. Updating based on feedback. New hypothesis. More testing.</p>\n<p>And so on.</p>\n<p>This whole iterating thing is relatively new to me.</p>\n<p>I used to only want to be perfect. Never fail. And I wasn't bad at it. But this made me not try the hardest things. Or prepare for them. I just jumped into them. Head first. </p>\n<p>Sometimes it worked. Sometimes it made a great story.</p>\n<p>However, this was a weakness in my youth. </p>\n<p>I can write blind.</p>\n<p>I <em>will</em> write blind.</p>\n<p>But I can see.</p>\n<p>See?</p>\n<p>The only way to get to perfect is to fail. Over and over.</p>\n<p>I know that now.</p>\n<p>Jordan had to fight the Bad Boys (and lose - over and over).</p>\n<p>Lose first. Win later.</p>\n<p>You can't stop this ess. This thing overflowing.</p>\n<p>My font runneth over.</p>\n<p>I love fonts.</p>\n<p>Ok, goodbye for now.</p>\n<p>Oh, and if you ever run into past me, tell me you read my future website and that you're a time traveler and there's this small window of time where I can't see my screen so good and that everything will be fine except you're not sure because you had to jump into the time machine again before you could read any more posts.</p>\n<p>Oh, and make sure you tell past me, that future me loves him.</p>\n<p>Man, I could go on forever.</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-12-04T16:21:08-05:00",
            "date_modified": "2025-12-04T16:39:54-05:00"
        },
        {
            "id": "https://iterating.com/by-feels/",
            "url": "https://iterating.com/by-feels/",
            "title": "By Feels",
            "summary": "Perhaps, I have figured out a way to keep writing. I&hellip;",
            "content_html": "<p>Perhaps, I have figured out a way to keep writing.</p>\n<p>I took a typing class in eight grade that changed my life.</p>\n<p>We all worked on big mechanical metal typewriters and we learned by starting with the individual keys covered with little white stickers.</p>\n<p>We learned to type by feel. Not sight. Well, I think we had an overhead projector that showed where the keys were, but we couldn't look down at the keys for help.</p>\n<p>We had to train our fingers to know which letters they were responsible for.</p>\n<p>The pinkies had the least responsibility, whereas the index and middle got the brunt.</p>\n<p>Anyways, my point being, perhaps I can type with my eyes closed.</p>\n<p>I can peek at the keys but I know when my fingers strike true.</p>\n<p>This is not an ideal way to write, but I somehow feel more attuned to writing this way.</p>\n<p>My eyes aren't fighting the screen, I'm keeping them mostly closed, just my fingers hunting the board. I know this seems like a cruel twist of fate, but I have learned we just never know what's going to happen and that there is no sustained new normals.</p>\n<p>Only seasons. Windows of time.</p>\n<p>Take nothing for granted.</p>\n<p>I can type this way. Not sure how great I'll write. But I suppose you could have asked that all along.</p>\n<p>I can write with my eyes closed. What a blessing that is. I hope to share more substantive stuff in the near future. But forgive me any typos. </p>\n<p>The key to typing by feel is knowing where you are. I touch my index fingers together to make sure they are aligned and in the right position. Otherwise, it's anarchy.</p>\n<p>What I am learning is that I must write. If only for myself. And some times, many times, all the time, when you must have something, you are tested.</p>\n<p>So, I suppose, this is some sort of test.</p>\n<p>That's ok. </p>\n<p>And, as I have learned to say, even in nonoptimal conditions, what does this make possible?</p>\n<p>I just realized, for the first time ever, that the \"j\" and \"f\" keys (where your index fingers rest), have a little notch at the bottom. None of the other keys do. I think this is so you know where to orient them. Where to rest them.</p>\n<p>I remember doing that now. When learning to type. I would peel a corner of a sticker for each hand, so I could feel a certain letter. I'd peel the corner up on \"a\" and \"l\" keys so I knew where they were by feel, fi not by sight.</p>\n<p>Have \"f\" and \"j\" always been so distinguished? Weird, I never noticed.</p>\n<p>I will now. </p>\n<p>All because I starting writing by feel.</p>\n<p> </p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-12-04T11:34:53-05:00",
            "date_modified": "2025-12-04T11:35:38-05:00"
        },
        {
            "id": "https://iterating.com/fun-while-it-lasted/",
            "url": "https://iterating.com/fun-while-it-lasted/",
            "title": "Fun While It Lasted",
            "summary": "My vision is different. I wish I could say this was&hellip;",
            "content_html": "<p>My vision is different.</p>\n<p>I wish I could say this was me being deep and mystical.</p>\n<p>But all this writing has made my vision sharper but different.</p>\n<p>This started two days ago.</p>\n<p>I can still write, and I still plan to, but it's a bit more difficult now.</p>\n<p>Strange, right?</p>\n<p>Ah well, it's this new avatar.</p>\n<p>Things don't work like they used to or work differently.</p>\n<p>Good and bad. Like all things.</p>\n<p>For a while, then, the writing may slow or stop.</p>\n<p>Until I can heal.</p>\n<p>Or find a new way to write.</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-12-03T15:09:12-05:00",
            "date_modified": "2025-12-03T15:10:48-05:00"
        },
        {
            "id": "https://iterating.com/long-decembers/",
            "url": "https://iterating.com/long-decembers/",
            "title": "Long Decembers",
            "summary": "Would we love December if it didn't have Christmas and New&hellip;",
            "content_html": "<p>Would we love December if it didn't have Christmas and New Year's Eve in it?</p>\n<p>I don't know.</p>\n<p>The last month of the year.</p>\n<p>The unofficial (early) and official start of winter.</p>\n<p>It can be a busy time and a chill time.</p>\n<p>It is time to put a bow on it and other objects.</p>\n<p>To wrap up the year and presents in celebration.</p>\n<p>This was a good year.</p>\n<p>Maybe next year will be better than the last.</p>\n<p>To holding on to moments.</p>\n<p>And letting them go.</p>\n<p>To long Decembers.</p>\n<p>And new years.</p>",
            "author": {
                "name": "AL8X"
            },
            "tags": [
            ],
            "date_published": "2025-12-02T12:15:18-05:00",
            "date_modified": "2025-12-02T12:19:48-05:00"
        }
    ]
}
