{
    "version": "https://jsonfeed.org/version/1",
    "title": "Iterating",
    "description": "",
    "home_page_url": "https://iterating.com",
    "feed_url": "https://iterating.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "𖤂"
    },
    "items": [
        {
            "id": "https://iterating.com/on-the-upside/",
            "url": "https://iterating.com/on-the-upside/",
            "title": "Up Down Up Down Up",
            "summary": "We all want a life that goes straight up. Or, along&hellip;",
            "content_html": "<p>We all want a life that goes straight up.</p>\n<p>Or, along a lifeline, up and to the right.</p>\n<p>📶</p>\n<p>Like a ramp.</p>\n<p>At the apex, you jump.</p>\n<p>Into the ether.</p>\n<p>Into the other side of finite.</p>\n<p>But really, a straight line constantly going up is just a chart in a textbook.</p>\n<p>The luckiest we can get in reality is one that goes up more often than down.</p>\n<p>The ups make up for the downs.</p>\n<p>This</p>\n<p>📈</p>\n<p>Instead of</p>\n<p>📉</p>\n<p>If you've lived a long enough lifeline, you are fortunate by that metric alone.</p>\n<p>But you also know something about these charts, in yourself and others.</p>\n<p>They don't make an emoji for my lifeline.</p>\n<p>They couldn't fit the ups and downs in that sucker.</p>\n<p>Too many pixels required.</p>\n<p>Would look like a WWW.</p>\n<p>This is no pity party, though.</p>\n<p>I don't throw those.</p>\n<p>Every down has been instructive, even and especially the destructive.</p>\n<p>And every up has been cautionary, even in jubilance.</p>\n<p>Blessings come in all forms.</p>\n<p>May your life be a bunch of Ws.</p>\n<p>And may they get bigger every year.</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-01-11T15:04:07-05:00",
            "date_modified": "2026-01-11T15:25:15-05:00"
        },
        {
            "id": "https://iterating.com/golden-delicious/",
            "url": "https://iterating.com/golden-delicious/",
            "title": "Golden Delicious",
            "summary": "One of my favorite things growing up in the 80s was&hellip;",
            "content_html": "<p>One of my favorite things growing up in the 80s was PBS cooking shows.</p>\n<p>I'd like to think this is how and why I started to love to cook but really I just enjoyed their personalities.</p>\n<p>And although some of them went horribly bad, these people were the first \"influencers.\" PBS a YouTube of sorts for old people (and me).</p>\n<p>An omen of what was to come.</p>\n<p>No one's watching Justin Wilson cook to learn how to make cajun food.</p>\n<p>You're there to hear a story.</p>\n<p>To hear the crowd giggle.</p>\n<p>Food was just the medium.</p>\n<p>The side dish.</p>\n<p>I guarantee.</p>\n<p>The first time I saw anything on television even remotely Asian was on cooking shows. Mostly Chinese stuff, but it does stand out because I never heard anything even close to my roots (Korea wasn't mentioned at all - China was \"close enough\") other than in Kung Fu movies or as villains.</p>\n<p>These things come full circle as I see my kids reaching towards items that look like them.</p>\n<p>Identity is strong and never yielding.</p>\n<blockquote>\n<p>🎵 Born in the USA! I was, Born in the USA! 🎵</p>\n</blockquote>\n<p>Oh snap.</p>\n<p>Where's Old Glory?</p>\n<p>Don't get it twisted, though. I'm a real American through and through. Like Rotundo and Windham. Hulk would be proud.</p>\n<p>Saying prayers, eating vitamins.</p>\n<p>[Doing the Hulk up. Shaking. Shaking. You!]</p>\n<blockquote>\n<p>🎵 Sent me off to a foreign land 🎵</p>\n</blockquote>\n<p>Heck yeah!</p>\n<p>Let's go!</p>\n<blockquote>\n<p>🎵 ...to go and kill the yellow man! 🎵</p>\n</blockquote>\n<p>Wait what?</p>\n<p>[Looks down at skin.]</p>\n<p>Phew, I'm <em>gold</em>.</p>\n<p><em>Surely, they can tell the difference!</em></p>\n<p><em>Or are they talking about Hogan? He's pretty yellow.</em></p>\n<p>But yeah, I loved the 80s.</p>\n<p>If Al can cook, so can you!</p>\n<p>🍛</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-01-10T13:27:33-05:00",
            "date_modified": "2026-01-10T14:03:40-05:00"
        },
        {
            "id": "https://iterating.com/depends/",
            "url": "https://iterating.com/depends/",
            "title": "Depends",
            "summary": "Have you ever known a good person to do a bad&hellip;",
            "content_html": "<p>Have you ever known a good person to do a bad thing?</p>\n<p>What about the other way?</p>\n<p>A bad person do a good thing?</p>\n<p>Sure, we have.</p>\n<p>Every day.</p>\n<p>Everywhere we look.</p>\n<p>So, here's what I will ask today:</p>\n<p>How many good things can a bad person do before they are good?</p>\n<p>And how many bad things can a good person do before they are bad?</p>\n<p>In our society, one bad action results in a permanent label.</p>\n<p>Whereas one good action really don't mean sheet.</p>\n<p>You could stack a million good actions next to one big bad one and the bad will tower over all that good.</p>\n<p>You are forever bad.</p>\n<p>This is, I think, interesting.</p>\n<p>Some things are unforgivable. At least by humans.</p>\n<p>That makes sense.</p>\n<p>A cold reality.</p>\n<p>So the trick is, when you're bad, to not pick something unforgivable.</p>\n<p>Sneak a late night snack.</p>\n<p>An off color joke at the wrong time.</p>\n<p>Dumping a bunch of tea that's taxed too highly.</p>\n<p>Oh right.</p>\n<p>Good and bad sometimes change meaning over time.</p>\n<p>Even things like genuinely trying to be a good person can somehow be taken to be bad.</p>\n<p>And vice versa.</p>\n<p>Is bad just the absence of good?</p>\n<p>Or something far darker?</p>\n<p>Some of the bad apples have had my back.</p>\n<p>Watched out for me.</p>\n<p>And some of the \"good\" ...Well... </p>\n<p><em>Where'd they go?</em></p>\n<p>The trick is knowing how to measure it all.</p>\n<p>Good and bad, I mean.</p>\n<p>For the mighty fall. And the meek inherit.</p>\n<p>I read that somewhere.</p>\n<p>I lived it somewhere, too.</p>\n<p>And no one's all of one or the other.</p>\n<p>Except angels and monsters.</p>\n<p>May you be surrounded by one, and not the other, depending on who you are.</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-01-09T17:47:39-05:00",
            "date_modified": "2026-01-09T17:55:19-05:00"
        },
        {
            "id": "https://iterating.com/vigorous-and-weird/",
            "url": "https://iterating.com/vigorous-and-weird/",
            "title": "Vigorous and Weird",
            "summary": "You know what's weird? Besides me. That kind of dancing professionals&hellip;",
            "content_html": "<p>You know what's weird?</p>\n<p>Besides me.</p>\n<p>That kind of dancing professionals do that kind of feels a little too aggressive.</p>\n<p>Like you see them do it and instinctively get into a fighter's stance.</p>\n<p>Kinda like rap battles but they're dissing you with their moves instead of their verses.</p>\n<p>It's a little <em>too</em> in your face. </p>\n<p>Should you be angry whilst dancing?</p>\n<p>Angry dancing is amusing.</p>\n<p>From mosh pits to breakers.</p>\n<p>Another thing that's weird is that war chant thing that those lovely folks from the islands do before rugby games and city council meetings.</p>\n<p>I mean, I get it for a sports warmup, but doing it before discussing ordinance 583-31 (item to change water sprinkler services) seems a bit, oh what's the word, ridiculous.</p>\n<p>[Dances aggressively. Slows. Then explodes again.]</p>\n<p><em>Oh snap.</em></p>\n<p>[Hakas violently, hands and feet doing things, eyes bulge and widen.]</p>\n<p><em>Ok, ok.</em></p>\n<p>I can see some merit in this.</p>\n<p>[Continues for far longer than necessary, extinguishing any remaining wonder or awe in it.]</p>\n<p><em>I'm ready to go to war.</em></p>\n<blockquote>\n<p>Next item on the agenda, proposal to paint fire trucks blue instead of red to give fire more fear.</p>\n</blockquote>\n<p>Here we go, mother truckers.</p>\n<p>It's on!</p>\n<p>\"You see, it's because it'll look like water!\"</p>\n<p>\"But won't it confuse people with the police?\"</p>\n<p>\"Light blue. Almost baby.\"</p>\n<p>\"Love it!\"</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-01-08T12:52:45-05:00",
            "date_modified": "2026-01-08T13:28:56-05:00"
        },
        {
            "id": "https://iterating.com/warship/",
            "url": "https://iterating.com/warship/",
            "title": "Warship",
            "summary": "Welp, almost forgot to write again today. I starting writing a&hellip;",
            "content_html": "<p>Welp, almost forgot to write again today.</p>\n<p>I starting writing a bit about worship, how we worship the wrong things, but I remembered that part of this whole thing is to realize how sacred life is.</p>\n<p>So I erased my rant.</p>\n<p>Instead, I would just like to say:</p>\n<p>We all <em>worship</em> something.</p>\n<p>We bow to it. Pray to it. And believe in it.</p>\n<p>Whether it be God or money or a political party or a damn Harley.</p>\n<p>We all have faith in something.</p>\n<p>I know where I stand.</p>\n<p>I know where I fall.</p>\n<p>What do you worship?</p>\n<p>Because we all worship something.</p>\n<p>And how's that working out for you?</p>\n<p>If you said, \"Great!\" Well, keep it up, then.</p>\n<p>But if you said something less than positive, I wonder what it could be?</p>\n<p>I think how you answer the worship question is about as important as who you choose to live your life with.</p>\n<p>It's almost the same answer.</p>\n<p>There's an old self-development trope that you are the average of the five people you spend the most time with, but I think it's really just one.</p>\n<p><em>You</em>.</p>\n<p>Take you at your highest, take you at your lowest, and everything in between.</p>\n<p>That's you.</p>\n<p>You are the average of you.</p>\n<p>You spend the most time with yourself.</p>\n<p>If that bores you, well, you're boring.</p>\n<p>If that excites you, well, you're crazy.</p>\n<p>And if part of this whole deal is that <em>everything is sacred</em>, well what does that also imply?</p>\n<p><em>You</em> are a part of everything.</p>\n<p>Which makes you...</p>\n<p>😇</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-01-07T17:45:33-05:00",
            "date_modified": "2026-01-07T18:09:12-05:00"
        },
        {
            "id": "https://iterating.com/ac-phone-home/",
            "url": "https://iterating.com/ac-phone-home/",
            "title": "AC Phone Home",
            "summary": "I can't lock in lately. Writing wise. I will say I&hellip;",
            "content_html": "<p>I can't lock in lately.</p>\n<p>Writing wise.</p>\n<p>I will say I enjoy the tactile experience of hitting keys again.</p>\n<p>Typing.</p>\n<p>Clicking.</p>\n<p>Clacking.</p>\n<p>It's not the same on touch screens.</p>\n<p>Even with the haptic stuff, it's just not the same.</p>\n<p>Real beats faux real.</p>\n<p>Sometimes.</p>\n<p>I grew up professionally using Blackberry devices. Although I started with a Treo (so good).</p>\n<p>As a bit of a tech guy, I just loved these little pocket computers.</p>\n<p>I hung onto the Blackberry line all the way to Passport, when it was clearly on the way down and out because some fruit company starting making phones.</p>\n<p>I was loyal to the tactile. The ability to write angry or at least, emotional, emails (I don't do that anymore - the former, I mean, well maybe both).</p>\n<p><em>Pro Tip:</em> <em>Brevity</em>. <em>Stoic. No emotion. </em><em>I should follow my own advice.</em></p>\n<p>The feedback.</p>\n<p>There is a bit of a comeback with these types of devices. And you know I always love a comeback.</p>\n<p>Phones with keyboards. Physical keyboards in a digital world.</p>\n<p>And it's not just us old(ish) folk, either. </p>\n<p>It's them damn kids, man.</p>\n<p>Some of them want to simplify. </p>\n<p>Narrow down their choices.</p>\n<p>They want less, and they will pay for it.</p>\n<p>Some people are learning that you do not need a four-figure handheld device to make phone calls, take pictures, text and write emails.</p>\n<p>And you certainly shouldn't pay for the privilege on a loan.</p>\n<p>But I'm just an old(ish) guy. Remembering when they gave you this stuff for free, just for locking in on a contract with the service provider.</p>\n<p>And I miss the pitter patter of little keys.</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-01-06T12:12:47-05:00",
            "date_modified": "2026-01-06T12:17:55-05:00"
        },
        {
            "id": "https://iterating.com/storm-before-the-quiet/",
            "url": "https://iterating.com/storm-before-the-quiet/",
            "title": "Storm Before The Quiet",
            "summary": "...And we're off! Man, the year is starting off with a&hellip;",
            "content_html": "<p>...And we're off!</p>\n<p>Man, the year is starting off with a bang, ain't it?</p>\n<p>A rare Monday where a lot of folks are excited.</p>\n<p>Time to shake the fog of holiday serenity/chaos and jump back into your vocational one.</p>\n<p>How many people have vocational serenity?</p>\n<p><em>Ooof</em>.</p>\n<p>I don't think many.</p>\n<p>I won't lecture you today on how important that is.</p>\n<p>You likely are busy.</p>\n<p>Chaotic.</p>\n<p>Right now.</p>\n<p>You know what's interesting? </p>\n<p>Some people cannot live in serenity. </p>\n<p>They generate their own chaos if none is provided to them.</p>\n<p>I see this in children and elders.</p>\n<p>And everything in between.</p>\n<p>I think some are bored, and some, oddly, find a strange comfort in chaos.</p>\n<p>Familiarity.</p>\n<p>Home.</p>\n<p>As an old(ish) curmudgeon, I dig quiet.</p>\n<p>Silence!</p>\n<p>But even I admit empty house quiet is too quiet. I can hear my ears ring.</p>\n<p>It's one of the tradeoffs of being here, the ringing that is.</p>\n<p><em>I'll take it</em>.</p>\n<p>I don't even hear it most of the time.</p>\n<p>Only when it's too quiet.</p>\n<p>And only sometimes.</p>\n<p>Ringing in the new year by the ringing in my old ear.</p>\n<p>I'm not complaining though. </p>\n<p>I hear rattling in the kitchen. Pots and pans moving. Beeps. Cutlery.</p>\n<p>Ahh, peace.</p>\n<p>⚡</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-01-05T11:59:41-05:00",
            "date_modified": "2026-01-05T12:02:00-05:00"
        },
        {
            "id": "https://iterating.com/eat-your-broccoli/",
            "url": "https://iterating.com/eat-your-broccoli/",
            "title": "Eat Your Broccoli",
            "summary": "The funny thing about the future. Would you want to know&hellip;",
            "content_html": "<p>The funny thing about the future.</p>\n<p>Would you want to know if you could?</p>\n<p>What happens in a week. In a month. In a year.</p>\n<p>In a decade.</p>\n<p>In a life.</p>\n<p>I was always thinking ahead (if not always planning for it), until some ess happened that made me focus on immediacy. On survival. On now.</p>\n<p>I still hold onto that feeling daily (gratitude), but I also am planning ahead again (the long game).</p>\n<p>So some balancing is in order.</p>\n<p>Cherish the day; plan for tomorrow (and beyond).</p>\n<p>Sure, it's obvious.</p>\n<p>But I used to take todays for granted.</p>\n<p>I used to take right now for granted.</p>\n<p><em>It'll be here. </em></p>\n<p><em>It always has.</em></p>\n<p>And so patience is a virtue, I hear.</p>\n<p><em>Wait</em>. </p>\n<p><em>Bide your time.</em></p>\n<p>Patience, contrary to what others think, is <em>not</em> inaction.</p>\n<p>It only looks that way.</p>\n<p>And looks can be very, very, fake. I think that's the term.</p>\n<p>You might know me as a vibe guy.</p>\n<p>Just chilling.</p>\n<p>But, really, the eyes-closed monk sitting indian-style floating a foot off the ground is just an act.</p>\n<p>In reality, I'm <em>starfaring</em>.</p>\n<p>Touching quasars and being propelled through the universe by broccoli farts.</p>\n<p>In other words,</p>\n<p>Thankful.</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-01-04T18:11:20-05:00",
            "date_modified": "2026-01-04T18:20:21-05:00"
        },
        {
            "id": "https://iterating.com/malls-in-the-matrix/",
            "url": "https://iterating.com/malls-in-the-matrix/",
            "title": "Malls In The Matrix",
            "summary": "Malls are changing. I would say dying, but I don't think&hellip;",
            "content_html": "<p>Malls are changing.</p>\n<p>I would say dying, but I don't think they are.</p>\n<p>They are changing.</p>\n<p>Evolving.</p>\n<p>Iterating.</p>\n<p>I remember marveling at the amount of choices one had to shop in a mall.</p>\n<p>I didn't realize how curated all these places actually were, how narrow the options, but it was cool to see way more than one store.</p>\n<p>Now, malls are being repurposed.</p>\n<p>Multi-use. </p>\n<p>I think it would be interesting if a company bought out an old mall and turned it into a business where their employees lived there as well. Like a campus.</p>\n<p>Or a prison.</p>\n<p>Of course, this isn't necessarily a happy idea, but some might be happy for it.</p>\n<p>What I'm getting at here is what about the internet malls?</p>\n<p>Right now, we are past the ooh and ahh stage of having a digital mall where we can shop at almost any store in the world.</p>\n<p>There are too many choices, even though most of ours are still highly curated.</p>\n<p>Will the internet shopping mall pass?</p>\n<p>Or will it change?</p>\n<p>Adapt.</p>\n<p>Iterate.</p>\n<p>I'm still waiting for ai to start suggesting a product (\"link provided\") whenever I ask it something even tangentially related.</p>\n<p>That's part of this, I think. Ai shopping. Ai ads. Ai malls.</p>\n<p>Ads on search browsers shifting to ads on ai prompts.</p>\n<p>I know, I know.</p>\n<p>But it's coming.</p>\n<p>\"This prompt answer brought to you by...\"</p>\n<p>Yuck.</p>\n<p>It did turn Google into a monster. I wonder if it will do so for an ai company.</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-01-03T13:01:04-05:00",
            "date_modified": "2026-01-05T12:01:51-05:00"
        },
        {
            "id": "https://iterating.com/high-low-there/",
            "url": "https://iterating.com/high-low-there/",
            "title": "High Low There",
            "summary": "I had to write again. Can't start 2026 like an absurd&hellip;",
            "content_html": "<p>I had to write again.</p>\n<p>Can't start 2026 like an absurd person would.</p>\n<p>That was <em>so</em> 2025.</p>\n<p>Listen, I got a question:</p>\n<p>Do you have to get really low to get really high?</p>\n<p>I mean to know what high truly means.</p>\n<p>Do you have to be poor to appreciate being wealthy?</p>\n<p>Do you have to have your heart broken to treasure and enjoy real love?</p>\n<p>I mean, to value it as you should:</p>\n<p>Priceless. </p>\n<p>If you were born rich, you tend to stay it, and take it for granted.</p>\n<p>You wouldn't fully understand its literal value unless you lost it.</p>\n<p>Same with love, I think, an always in love, never broken, heart. Seems like that kind of heart would break others' hearts.</p>\n<p>You don't appreciate the unlimited power of love until it breaks you or someone close to you.</p>\n<p>The more I wrestle with it, the more I am learning that our point of view, our perspective, might be one of the only truly unique things we have.</p>\n<p>We all own a unique, one of one, perspective. A set of lenses through which we live.</p>\n<p>And as similar as some people may appear, you'll find stark differences the further you zoom in.</p>\n<p>So the challenge, then, should you choose to accept it is:</p>\n<p>Learn from your singular perspective and the infinite of others.</p>\n<p>Why do you (and they) see the world the way you (and they [<em>this is the last time I will do the \"and they\" thing so just put it after every \"you\" following</em>]) do?</p>\n<p>How do you define wealth? Is it good or evil? And why?</p>\n<p>How do you define love? Is it good or evil? Do you still believe in it? And why?</p>\n<p>How do you define yourself? Are you good or evil? Do you still believe in you? And why?</p>\n<p>And, perhaps most importantly, how do you define God? Is God benevolent or malevolent? Did you ever, or do you still, believe? And why?</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-01-02T17:04:51-05:00",
            "date_modified": "2026-01-02T23:07:41-05:00"
        }
    ]
}
