{
    "version": "https://jsonfeed.org/version/1",
    "title": "Iterating",
    "description": "",
    "home_page_url": "https://iterating.com",
    "feed_url": "https://iterating.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "𖤂"
    },
    "items": [
        {
            "id": "https://iterating.com/a-wholly-man/",
            "url": "https://iterating.com/a-wholly-man/",
            "title": "A Wholly Man",
            "summary": "Who are you? I mean that in the most literal way.",
            "content_html": "<p>Who are you?</p>\n<p>I mean that in the most literal way.</p>\n<p>Who are you?</p>\n<p>And how do you define yourself?</p>\n<p>Most people would answer the question like I'm asking what their name is.</p>\n<p>And I love names.</p>\n<p>But what I am asking is more:</p>\n<p>What do you represent?</p>\n<p>How do you wish to be defined?</p>\n<p>What should I call you?</p>\n<p>My umma when I was still in her womb had a dream that her baby to be was all growns up and dressed in a black flowing robe. This convinced her I was destined to be a judge.</p>\n<p>And well, I guess I am.</p>\n<p>Got a law degree.</p>\n<p>Got a law license.</p>\n<p>Got black on (no robes though).</p>\n<p>I do have a gavel or two.</p>\n<p>I call myself the \"Supreme Court\" but only in my house.</p>\n<p>Only to my kids.</p>\n<p>But we all get a good laugh.</p>\n<p>I should buy a black robe though. </p>\n<p>I think grandmasters wear those.</p>\n<p>So sayeth, The Supreme Court!</p>\n<p>⚖</p>\n<p>Judge: A person able or qualified to give an opinion on something.</p>\n<p>Umma, I always been a judge!!! </p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-02-03T14:10:07-05:00",
            "date_modified": "2026-02-03T14:20:28-05:00"
        },
        {
            "id": "https://iterating.com/miyagi/",
            "url": "https://iterating.com/miyagi/",
            "title": "Miyagi",
            "summary": "This say you brave: ♥️ This say you lucky: 🎖",
            "content_html": "<p>This say you brave:</p>\n<p>♥️</p>\n<p>This say you lucky:</p>\n<p>🎖</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-02-02T15:27:00-05:00",
            "date_modified": "2026-02-02T19:57:21-05:00"
        },
        {
            "id": "https://iterating.com/always-look-eye/",
            "url": "https://iterating.com/always-look-eye/",
            "title": "Always Look Eye",
            "summary": "There was a book I read years ago. I cannot remember&hellip;",
            "content_html": "<p>There was a book I read years ago.</p>\n<p>I cannot remember the name of the book or its author.</p>\n<p>A shame.</p>\n<p>But I remember it's beginning/preface/intro.</p>\n<p>Whatever you call it.</p>\n<p>There's a little shack in the middle of nowhere.</p>\n<p>And this knock at the door.</p>\n<p>And the old man inside shouts, \"What do you want?\"</p>\n<p>And the knocker politely says, \"Sorry to bother you, but I'm looking for the master.\"</p>\n<p>And the old man retorts, \"There is no master here. Go away.\"</p>\n<p>It's written more eloquently and evocatively than that.</p>\n<p>But the idea always stuck with me.</p>\n<p>How the old man didn't want to open the door.</p>\n<p>How the knocker was searching for wisdom.</p>\n<p>How the old man didn't want to give it.</p>\n<p>And it's sort of a trope.</p>\n<p>Some wisdom is hard won.</p>\n<p>And those who have won it wear it like battle scars.</p>\n<p>Either they share it proudly or hide it securely.</p>\n<p>And those who seek it have to keep trying.</p>\n<p>The old man is a good one, but he's been burned before.</p>\n<p>Many, many times.</p>\n<p>There's a lot of old masters hanging it up, I think.</p>\n<p>Never to be seen again.</p>\n<p>I understand why.</p>\n<p>But it's a little sad.</p>\n<p>So much left to give.</p>\n<p>Nothing left to want to.</p>\n<p>Now go away.</p>\n<p>No old man here.</p>\n<p>Come back tomorrow.</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-02-02T13:02:51-05:00",
            "date_modified": "2026-02-02T13:21:12-05:00"
        },
        {
            "id": "https://iterating.com/press-record/",
            "url": "https://iterating.com/press-record/",
            "title": "Press Record",
            "summary": "I don't think we listen to music enough. At least, I&hellip;",
            "content_html": "<p>I don't think we listen to music enough.</p>\n<p>At least, I don't.</p>\n<p>And, as a music lover, this is going to change.</p>\n<p>We are a long age away from listening to the radio for hours with a blank cassette inside the tape player. Finger hovering over the record button just hoping you catch your favorite song before it starts.</p>\n<p>Cursing silently when the DJ talks over the beginning, but happy you got it nonetheless.</p>\n<p>I must have re-recorded over the tape a hundred times before I got the songs I wanted.</p>\n<p>Today, the price we pay for any song at any time is an ad or two. Maybe a subscription.</p>\n<p>It's a little bit of cash or a little bit of time. </p>\n<p>And as much as I feel a bit torn about it all, I think ai is making some good music.</p>\n<p>Yeah, I said it.</p>\n<p>It follows the formula, and song is formula.</p>\n<p>Take for example the ai song \"New Year, I'm the Same ____\" (1979). I warn you it's got some adult language.</p>\n<p>Sheet rated R.</p>\n<p>But it's got oldies soul vibes with a modern (timeless?) IDGAF mindset.</p>\n<p>So yeah, I'm dancing to music created by software with the push of a few keys.</p>\n<p>No DJs yapping at the beginning to screw things up.</p>\n<p>No vulnerable cassettes eaten up by old, slowly disloyal, boomboxes.</p>\n<p>I'd encourage you to hold an iPhone sideways over your head rocking a Peter Gabriel song, but that just seems silly.</p>\n<p>There's no better time machine than music.</p>\n<p>A rare invention that can take you back, push you forward, and stir you up.</p>\n<p>All at the same time.</p>\n<p>Life is frequency.</p>\n<p>Life is vibe.</p>\n<p>Life is music.</p>\n<p>What's your song?</p>\n<p>💽</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-02-01T17:51:38-05:00",
            "date_modified": "2026-02-01T18:08:21-05:00"
        },
        {
            "id": "https://iterating.com/chosen/",
            "url": "https://iterating.com/chosen/",
            "title": "Chosen",
            "summary": "So much of our lives, if you live it the traditional&hellip;",
            "content_html": "<p>So much of our lives, if you live it the traditional way, is about being chosen, rather than doing the choosing.</p>\n<p>Picked for a team. Picked for the best grades. Picked for a position.</p>\n<p>You work hard in school, obeying, abiding, and parroting for the distinct goal of being picked by another school for which you, if selected, get the dubious honor of paying hundreds of thousands of dollars for the privilege of them choosing you.</p>\n<p>Athletes get drafted out of school.</p>\n<p>Every kid weeping at the idea that \"Hey, I made it!\"</p>\n<p>Maybe different now with NIL money. But I'm rolling here.</p>\n<p>And why?</p>\n<p>Because they were chosen.</p>\n<p>I have always liked the word. Chosen. Reminds me of Korea.</p>\n<p>My point is simple.</p>\n<p>One you might guess by now.</p>\n<p>Being chosen is all well and good.</p>\n<p>We're all chosen, if you think about it.</p>\n<p>Apply for jobs. Interview for them. Maybe you get it.</p>\n<p>It's an honor just to be nominated is a line I love to say (lol).</p>\n<p><em>I always get it.</em></p>\n<p>But listen.</p>\n<p>This is a world of people waiting to be plucked.</p>\n<p>Where it should be a world of mother pluckers.</p>\n<p>You need to stop with things whose outcome is based upon some other person choosing you.</p>\n<p>And you need to be the selector.</p>\n<p>You choose, choose, choose you.</p>\n<p>There is no better time in our timeline's timeline than now to be the decider in what you do, where you go, and who you will be as you get there.</p>\n<p>Now, I'm sympathetic to those who are still in the choose-me ecosystem. </p>\n<p>Who are trying to Neo out.</p>\n<p>I get it. I live it (to some degree). It's everywhere.</p>\n<p>But validation of worth through external measures is... What's the word I'm searching for? I don't know. </p>\n<p>I remember getting my dream job offer (it's happened a few times now) and being so happy with being chosen. </p>\n<blockquote>\n<p>You like me. You really like me!!!</p>\n</blockquote>\n<p>Same with school. Same with honors. Same with props. Attaboy, AC. Al, you the man.</p>\n<p>Yeah, yeah, I know. </p>\n<p>I know.</p>\n<p>I KNOW.</p>\n<p>Boy, that sounds pompous, huh?</p>\n<p>Tee hee.</p>\n<p>Full of myself.</p>\n<p>Perhaps.</p>\n<p>Old.</p>\n<p>Lucky.</p>\n<p>Blessed.</p>\n<p>Chosen.</p>\n<p>If you are the type to believe in Pareto Principles, then you see the 20% (probably much less) choose the 80% (much higher).</p>\n<p>And with math being math that means most of you are just hoping you get the call.</p>\n<p>While the chosen few got the pick of the litter.</p>\n<p>What group you wanna be in?</p>\n<p>So what I will leave with you is the question of what are you waiting for?</p>\n<p>Who are you waiting for?</p>\n<p>Does someone really get to tell you if they pick you or not?</p>\n<p>Nah, baby, I pick.</p>\n<p>That's what I want you to say.</p>\n<p>I pick.</p>\n<p>You are the chosen one.</p>\n<p>At least, that's how I choose to see it.</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-01-31T14:28:33-05:00",
            "date_modified": "2026-01-31T14:39:40-05:00"
        },
        {
            "id": "https://iterating.com/tbc/",
            "url": "https://iterating.com/tbc/",
            "title": "TBC",
            "summary": "Kids live in their own universes. Some adults are that way,&hellip;",
            "content_html": "<p>Kids live in their own universes. Some adults are that way, too.</p>\n<p>Currently, my universes are overlapping, so I have to go.</p>\n<p>I get to go.</p>\n<p>Doing the stuff that makes you want to write a musings column in the first place.</p>\n<p>I'll see ya when I see ya.</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-01-30T13:25:12-05:00",
            "date_modified": "2026-01-30T13:28:45-05:00"
        },
        {
            "id": "https://iterating.com/one-sheep-two-sheep-what-the-sheep/",
            "url": "https://iterating.com/one-sheep-two-sheep-what-the-sheep/",
            "title": "One Sheep, Two Sheep...What the Sheep?",
            "summary": "I tried to write this when I had a window of&hellip;",
            "content_html": "<p>I tried to write this when I had a window of time. But my belly's full and I just don't know what to say.</p>\n<p>I was going to write about William Belichick but it's been said.</p>\n<p>I was going to talk about how I am a Barry Bonds guy so I understand why this happened but whatever.</p>\n<p>Then I was going to say they both have BB as initials.</p>\n<p>But then I thought, bah!</p>\n<p>I thought bah!!</p>\n<p><em>Bah!!!</em></p>\n<p>Black sheep, man.</p>\n<p>Tough out there.</p>\n<p>I'm more of a black sheep dog, dawg.</p>\n<p><em>Woof woof.</em></p>\n<p>🐾</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-01-29T15:02:24-05:00",
            "date_modified": "2026-01-29T17:17:56-05:00"
        },
        {
            "id": "https://iterating.com/soaking-it-all-in/",
            "url": "https://iterating.com/soaking-it-all-in/",
            "title": "Soaking It All In",
            "summary": "As you float through the cosmos, you learn that seemingly big&hellip;",
            "content_html": "<p>As you float through the cosmos, you learn that seemingly big problems and big wins are really just tiny.</p>\n<p>At least from up here.</p>\n<p>Heck, even our planet can look like a dot. </p>\n<p>A speck.</p>\n<p>Pocket sand remnants.</p>\n<p>The spectrum of suffering to elation is lost up here.</p>\n<p>It's all the same thing.</p>\n<p>Meaningless.</p>\n<p>Or rather, irrelevant.</p>\n<p>Insignificant.</p>\n<p>Rounding error.</p>\n<p>All the chaos happening down there just doesn't matter in the grand scheme of things.</p>\n<p>I say this as an stoic optimist.</p>\n<p>I say this to encourage you.</p>\n<p>You could be living in hell or heaven (on earth).</p>\n<p>And it doesn't matter.</p>\n<p>On a larger scale.</p>\n<p>...</p>\n<p>Or does it?</p>\n<p>Does it matter universally?</p>\n<p>Cosmically?</p>\n<p>Existentially?</p>\n<p>What if your happiness or sadness, jubilance or sorrow, is quantumly entangled to something out there in the universe?</p>\n<p>What if you make someone else happy on some other galaxy when you're happy?</p>\n<p>Mikmak Janpol from planet Starfarter (what a terrible name for a planet, but hey, I don't make the rules!) suddenly leaps for joy every time you laugh from your belly.</p>\n<p>I walk this line between how trivial one person is in the scheme of reality to how important knowing that your reality is just the perspective of one person (hopefully your own).</p>\n<p>But science, not just faith, <em>science</em> teaches us we are connected.</p>\n<p>Entangled.</p>\n<p>To something.</p>\n<p>Something that could be really close.</p>\n<p>Or, more likely (?), something really, really, really far away.</p>\n<p>There could be a single cell in you tied to another cell on the other side of forever.</p>\n<p>Isn't that weird?</p>\n<p>Am I getting that right?</p>\n<p>I'm probably making Einstein twitch.</p>\n<p>Oh, Bert, don't ever change.</p>\n<p>Yeah, I'm just passing through.</p>\n<p>Where am I going?</p>\n<p>Ahhhh soooo, hopper of space, that is a wondrous question.</p>\n<p>But I got to go.</p>\n<p>I bet someone, or something - out <em>there</em> - is belly laughing.</p>\n<p>I can feel it.</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-01-28T11:38:22-05:00",
            "date_modified": "2026-01-28T12:06:43-05:00"
        },
        {
            "id": "https://iterating.com/genre/",
            "url": "https://iterating.com/genre/",
            "title": "Genre",
            "summary": "Who or what has shaped you the most? I would hope&hellip;",
            "content_html": "<p>Who or what has shaped you the most?</p>\n<p>I would hope you say you, or maybe something higher.</p>\n<p>But have you really thought about that?</p>\n<p>Why are you the way you are, and who gets the most credit (or blame) for it?</p>\n<p>I think you should start asking people that.</p>\n<p>You should start asking yourself.</p>\n<p>Because you will get a lot of the answers you seek.</p>\n<p>Answers you would never get otherwise.</p>\n<p>Most importantly, you get perspective.</p>\n<p>A point of view.</p>\n<p>If your life was a TV show (do we still call it that?), would it be a drama? A comedy?</p>\n<p>A tragedy?</p>\n<p>A redemption story?</p>\n<p>A love story?</p>\n<p>Or an epic trilogy, perhaps?</p>\n<p>How about a reality show?</p>\n<p>True crime?</p>\n<p>Paranormal?</p>\n<p>Where you at?</p>\n<p>When you on?</p>\n<p>Sorry, this is just what I do.</p>\n<p>When I want to learn more about something or someone, I ask a lot of questions of it.</p>\n<p>Mostly, I never ask a question, though.</p>\n<p>Not interested.</p>\n<p>Hard pass.</p>\n<p><em>Yawns</em>.</p>\n<p>Next!</p>\n<p>I have always felt like an outsider.</p>\n<p>Always been an outsider.</p>\n<p>Too much this to be that. Too much that to be this.</p>\n<p>I liked to lift heavy things, even if only to open and read them.</p>\n<p>Too New York for Cali. Too Cali for New York. Too Midwest to be Southern. Too Korean. Not enough Korean. Too Midwest to care about it at all (after a <em>looooooooong</em> long long  time). Long duck.</p>\n<p>And so that's my answer.</p>\n<p>Sort of.</p>\n<p>My outsiderness has given me the unique opportunity to find a home everywhere, with everyone.</p>\n<p>With exiles and executives.</p>\n<p>Janitors and jet flyers.</p>\n<p>Rolexes and Timexes.</p>\n<p>Noobs and grandmasters.</p>\n<p>And let me tell you: Good people are rarely the star of their show.</p>\n<p>The \"stars\" are usually asses.</p>\n<p>Ass.</p>\n<p>Es.</p>\n<p>I mean, there are probably jerk janitors. </p>\n<p>But do I have to convince you a CEO is a hole of buttocks?</p>\n<p>Didn't think so.</p>\n<p>And believe me, most CEOs think they are the leading man or lady.</p>\n<p>Actually, I have no idea.</p>\n<p>I don't care, really. Just seems like an easy and obvious example.</p>\n<p><em>Yawns</em>.</p>\n<p>Every life story, in the end, is a complete mashup of all of the above.</p>\n<p>I simplify it and say every story is a love story. But really, in a life truly lived, you have elements of tragedy, drama, comedy, adventure, action, love, and redemption.</p>\n<p>All of the above.</p>\n<p>The order is important, I think.</p>\n<p>A show about true crime ending in love and redemption - well that sounds pretty good.</p>\n<p>A show about comedy and action ending in tragedy? Eek. Probably would get better ratings, though.</p>\n<p>I'll end it here.</p>\n<p>To be continued.</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-01-27T15:04:21-05:00",
            "date_modified": "2026-01-27T15:10:37-05:00"
        },
        {
            "id": "https://iterating.com/time-spent/",
            "url": "https://iterating.com/time-spent/",
            "title": "Time Spent",
            "summary": "I listened to a book recently where the author says that&hellip;",
            "content_html": "<p>I listened to a book recently where the author says that money is the quantification of our values.</p>\n<p>And I think that's so right.</p>\n<p>So on the nose.</p>\n<p>What we spend our money on is what we value and our values.</p>\n<p>After the bare necessities, but even there, too.</p>\n<p>Our stinginess might show us, by its lack, how little we value something or someone.</p>\n<p>It works the other way, too.</p>\n<p>As most things do.</p>\n<p>How we spend in excess, and on what and who, is telling as to what and who we find valuable.</p>\n<p>And I suppose it works for more important areas than money.</p>\n<p>It works on how we quantify our time, thought, and attention.</p>\n<p>What we spend our time on, thinking about, and attending to is a quantification of our life values.</p>\n<p>Or, it should be, ideally.</p>\n<p>So I think the right questions to ask are some derivation of the following:</p>\n<p>What values am I expressing with how I spend money?</p>\n<p>What values am I expressing with how I spend time?</p>\n<p>What values am I expressing when I contemplate?</p>\n<p>What values am I expressing when I am in the zone?</p>\n<p>If you answer these, and do not like the answers, or at least decide that you can optimize and iterate on them, well I think that's time and money well spent.</p>\n<p>In role playing games, you can tally your life values by what are sometimes called experience points (XP). And while there are always trackers for money and items, it is ultimately your XP tally that measures and quantifies your character's life story.</p>\n<p>As much as I love valuable stuff, I think we need a real-life XP counter.</p>\n<p>We need a better way to quantify our value and values.</p>\n<p>You spend enough time on this earth, you know what I'm talking about.</p>\n<p>From highest high to lowest low, you will find that good people are everywhere (and its corollary).</p>\n<p>And age ain't it.</p>\n<p>Seen plenty of level one senior citizens.</p>\n<p>So how do we quantify good character?</p>\n<p>A good soul?</p>\n<p>A person worth it?</p>\n<p>Money is an easy quantifier.</p>\n<p>But I say a terrible one.</p>\n<p>We need a better measuring stick.</p>\n<p>How you invest your time. Your energy. Your perspective.</p>\n<p>This is more in nature of what I think truly brings rewards.</p>\n<p>What's in your heart, human?</p>\n<p>And do you show it by how you spend your life?</p>\n<p>Of course, this presupposes a lot of things.</p>\n<p>Presupposes you have enough to get by.</p>\n<p>And that is a silly presupposition, as presuppositions go.</p>\n<p>Those of you still fighting this fight are probably snickering.</p>\n<p><em>Must be nice to think about your values when I am out here just trying to survive.</em></p>\n<p>And to that I say:</p>\n<p>You're right.</p>\n<p>It <em>is</em> nice.</p>\n<p>A luxury.</p>\n<p>One I hope you find.</p>\n<p>For I was once in your shoes/sandals/flip-flops/probably boots.</p>\n<p>I would say it'll get better but I don't know if it will.</p>\n<p>I will say I was an <em>awful</em> quantifier of my values.</p>\n<p>And now I feel guilty buying a budget tablet from Lenovo.</p>\n<p>Just kidding.</p>\n<p>I love them little sheets.</p>\n<p>Like toilet paper.</p>\n<p>Almost disposable.</p>\n<p>And so this is a forever (t)issue.</p>\n<p>At least while we walk the earth.</p>\n<p>Why are you reading this musings column?*</p>\n<p>Don't you have anything better to do?**</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>* Thank you for reading.</p>\n<p>** Seriously though. Even playing video games might be better.</p>",
            "author": {
                "name": "𖤂"
            },
            "tags": [
            ],
            "date_published": "2026-01-26T15:46:47-05:00",
            "date_modified": "2026-01-26T16:07:59-05:00"
        }
    ]
}
